<!DOCTYPE html>


<html lang="zh-CN">
  

    <head>
      <meta charset="utf-8" />
        
      <meta name="description" content="一个八股文拾荒者&lt;br&gt;- A collector who is focuced on asshole-Java." />
      
      <meta
        name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1"
      />
      <title>12A002.[存储引擎]-InnoDB表空间原理 |  xugang.xie&#39;s blog</title>
  <meta name="generator" content="hexo-theme-ayer">
      
      <link rel="shortcut icon" href="/favicon.ico" />
       
<link rel="stylesheet" href="/dist/main.css">

      
<link rel="stylesheet" href="/css/fonts/remixicon.css">

      
<link rel="stylesheet" href="/css/custom.css">
 
      <script src="https://cdn.staticfile.org/pace/1.2.4/pace.min.js"></script>
       
 

      <link
        rel="stylesheet"
        href="https://cdn.jsdelivr.net/npm/@sweetalert2/theme-bulma@5.0.1/bulma.min.css"
      />
      <script src="https://cdn.jsdelivr.net/npm/sweetalert2@11.0.19/dist/sweetalert2.min.js"></script>

      <!-- mermaid -->
      
      <style>
        .swal2-styled.swal2-confirm {
          font-size: 1.6rem;
        }
      </style>
    <link rel="alternate" href="/atom.xml" title="xugang.xie's blog" type="application/atom+xml">
</head>
  </html>
</html>


<body>
  <div id="app">
    
      
    <main class="content on">
      <section class="outer">
  <article
  id="post-12A002.[存储引擎]-InnoDB表空间原理"
  class="article article-type-post"
  itemscope
  itemprop="blogPost"
  data-scroll-reveal
>
  <div class="article-inner">
    
    <header class="article-header">
       
<h1 class="article-title sea-center" style="border-left:0" itemprop="name">
  12A002.[存储引擎]-InnoDB表空间原理
</h1>
 

      
    </header>
     
    <div class="article-meta">
      <a href="/2020/05/01/12A002.%5B%E5%AD%98%E5%82%A8%E5%BC%95%E6%93%8E%5D-InnoDB%E8%A1%A8%E7%A9%BA%E9%97%B4%E5%8E%9F%E7%90%86/" class="article-date">
  <time datetime="2020-04-30T16:00:00.000Z" itemprop="datePublished">2020-05-01</time>
</a> 
  <div class="article-category">
    <a class="article-category-link" href="/categories/Database-%E6%95%B0%E6%8D%AE%E5%BA%93/">Database-数据库</a>
  </div>
  
<div class="word_count">
    <span class="post-time">
        <span class="post-meta-item-icon">
            <i class="ri-quill-pen-line"></i>
            <span class="post-meta-item-text"> 字数统计:</span>
            <span class="post-count">2.3k</span>
        </span>
    </span>

    <span class="post-time">
        &nbsp; | &nbsp;
        <span class="post-meta-item-icon">
            <i class="ri-book-open-line"></i>
            <span class="post-meta-item-text"> 阅读时长≈</span>
            <span class="post-count">14 分钟</span>
        </span>
    </span>
</div>
 
    </div>
      
    <div class="tocbot"></div>




  
    <div class="article-entry" itemprop="articleBody">
       
  <h3 id="InnoDB&#x8868;&#x7A7A;&#x95F4;&#x539F;&#x7406;"><a href="#InnoDB&#x8868;&#x7A7A;&#x95F4;&#x539F;&#x7406;" class="headerlink" title="InnoDB&#x8868;&#x7A7A;&#x95F4;&#x539F;&#x7406;"></a>InnoDB&#x8868;&#x7A7A;&#x95F4;&#x539F;&#x7406;</h3><p>InnoDB&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x63D0;&#x4F9B;&#x4E8C;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;<br>1&#x3001;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;<br>2&#x3001;&#x72EC;&#x5360;&#x8868;&#x7A7A;&#x95F4;</p>
<span id="more"></span>

<p><code>&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x65B9;&#x5F0F;</code>&#xFF0C;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x6570;&#x636E;&#x548C;&#x7D22;&#x5F15;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x9ED8;&#x8BA4;&#x653E;&#x5728;/usr/local/mysqldata&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8868;&#x6709;&#x4E00;&#x4E2A;.frm&#x8868;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#xFF0C;&#x653E;&#x5728;mysqldata&#x4E0B;&#x7684;&#x5177;&#x4F53;&#x6570;&#x636E;&#x5E93;&#x76EE;&#x5F55;&#xFF1B;</p>
<p><code>&#x72EC;&#x5360;&#x8868;&#x7A7A;&#x95F4;&#x65B9;&#x5F0F;</code>&#xFF0C;&#x5728;mysqldata/yourdatabase&#x4E0B;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8868;&#x90FD;&#x6709;&#x4E00;&#x4E2A;.frm&#x8868;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;.ibd&#xFF0C;&#x6BCF;&#x4E2A;&#x8868;&#x7684;&#x6570;&#x636E;&#x548C;&#x7D22;&#x5F15;&#x5355;&#x72EC;&#x5B58;&#x653E;&#x5728;&#x4EE5;&#x8868;&#x547D;&#x540D;&#x7684;ibd&#x6587;&#x4EF6;&#x4E2D;&#xFF1B;</p>
<p>&#x5B89;&#x88C5;&#x7684;&#x65F6;&#x5019;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;my.cnf &#x4E2D; innodb_file_per_table &#x53C2;&#x6570;&#x51B3;&#x5B9A;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#xFF0C;1&#xFF1A;&#x72EC;&#x5360;&#xFF0C;0&#xFF1A;&#x5171;&#x4EAB;&#xFF1B;</p>
<p><strong>&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;</strong>&#xFF1A;<br>&#x4F18;&#x70B9;&#xFF1A;<br>1&#x3001;&#x8868;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x5B58;&#x653E;&#x5230;&#x5404;&#x4E2A;&#x78C1;&#x76D8;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x5206;&#x5E03;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x4E0A;&#x3002;&#x8868;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x4E0D;&#x518D;&#x662F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5355;&#x4E2A;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x800C;&#x662F;InnoDB&#x81EA;&#x8EAB;&#x7684;&#x9650;&#x5236;&#x3002;&#x4ECE;Innodb&#x5B98;&#x65B9;&#x6587;&#x6863;&#x53EF;&#x77E5;&#xFF0C;&#x5176;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x6700;&#x5927;&#x9650;&#x5236;&#x4E3A;64TB&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;Innodb&#x7684;&#x5355;&#x8868;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x4E5F;&#x5728;64TB&#x5DE6;&#x53F3;&#x3002;<br>&#x7F3A;&#x70B9;&#xFF1A;<br>1&#x3001;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x548C;&#x7D22;&#x5F15;&#x5B58;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5E38;&#x5927;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x5927;&#x6587;&#x4EF6;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x5C0F;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8868;&#x53CA;&#x7D22;&#x5F15;&#x5728;&#x8868;&#x7A7A;&#x95F4;&#x4E2D;&#x6DF7;&#x5408;&#x5B58;&#x50A8;&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x505A;&#x4E86;&#x5927;&#x91CF;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x540E;&#x8868;&#x7A7A;&#x95F4;&#x4E2D;&#x5C06;&#x4F1A;&#x6709;&#x5927;&#x91CF;&#x7684;&#x7A7A;&#x9699;&#x3002;</p>
<p><strong>&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;</strong>&#xFF1A;<br>&#x4F18;&#x70B9;&#xFF1A;<br>1&#x3001;&#x6BCF;&#x4E2A;&#x8868;&#x90FD;&#x6709;&#x81EA;&#x5DF2;&#x72EC;&#x7ACB;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#x7269;&#x7406;&#x6587;&#x4EF6;&#xFF0C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x6E05;&#x6670;&#xFF0C;&#x707E;&#x96BE;&#x6062;&#x590D;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#xFF0C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x8868;&#x3002;<br>2&#x3001;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5355;&#x8868;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x79FB;&#x52A8;&#x3002;<br>3&#x3001;&#x7A7A;&#x95F4;&#x66F4;&#x5BB9;&#x6613;&#x56DE;&#x6536;&#x3002;<br>4&#x3001;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#xFF0C;&#x4F7F;&#x7528;&#x72EC;&#x5360;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x6027;&#x80FD;&#x4F1A;&#x66F4;&#x9AD8;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x7F3A;&#x70B9;&#xFF1A;<br>&#x4F7F;&#x7528;&#x72EC;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x6765;&#x5B58;&#x653E;Innodb&#x7684;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x8868;&#x7684;&#x6570;&#x636E;&#x4EE5;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6587;&#x4EF6;&#x6765;&#x5B58;&#x653E;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x5355;&#x8868;&#x6570;&#x636E;&#x91CF;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x53C8;&#x53D8;&#x6210;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x50CF;linux&#x65B0;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;ext3&#x3001;ext4&#x7B49;&#xFF0C;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x4E5F;&#x591F;&#x7528;&#x4E86;&#x3002;</p>
<hr>
<p>InnoDB &#x91C7;&#x7528;&#x6309;&#x8868;&#x7A7A;&#x95F4;(tablespace)&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x5927;&#x5C0F;&#x4E3A;10MB&#xFF0C; &#x540D;&#x5B57;&#x4E3A;ibdata1&#x7684;&#x6587;&#x4EF6;&#xFF0C; &#x8BE5;&#x6587;&#x4EF6;&#x5C31;&#x662F;&#x9ED8;&#x8BA4;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#x6587;&#x4EF6;(tablespce file)&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53C2;&#x6570; innodb_data_file_path &#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E; innodb_file_per_table &#x7684;&#x8BDD;&#xFF0C; &#x90A3;&#x4E9B;Innodb&#x5B58;&#x50A8;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x7684;&#x6570;&#x636E;&#x90FD;&#x653E;&#x5728;&#x8FD9;&#x4E2A;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x800C;&#x7CFB;&#x7EDF;&#x53D8;&#x91CF; <code>innodb_file_per_table=1</code> &#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;InnoDB&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x4E00;&#x3001;&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x4F18;&#x7F3A;&#x70B9;</p>
<ol>
<li><p>&#x4F18;&#x70B9;&#xFF1A;<br>(1) &#x6BCF;&#x4E2A;&#x8868;&#x90FD;&#x6709;&#x81EA;&#x5DF2;&#x72EC;&#x7ACB;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#x3002;<br>(2) &#x6BCF;&#x4E2A;&#x8868;&#x7684;&#x6570;&#x636E;&#x548C;&#x7D22;&#x5F15;&#x90FD;&#x4F1A;&#x5B58;&#x5728;&#x81EA;&#x5DF2;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#x4E2D;&#x3002;<br>(3) &#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5355;&#x8868;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x79FB;&#x52A8;&#x3002;<br>(4) &#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x56DE;&#x6536;</p>
</li>
<li><p>&#x7F3A;&#x70B9;</p>
</li>
</ol>
<p>&#x5224;&#x522B;&#x6570;&#x636E;&#x8868;&#x662F;&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x8FD8;&#x662F;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;</p>
<ol>
<li><p>&#x901A;&#x8FC7;ibd&#x6587;&#x4EF6;&#x5224;&#x522B;<br>&#x5982;&#x679C;&#x8868;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x662F;InnoDB&#xFF0C;&#x800C;&#x4E14;&#x8868;&#x7A7A;&#x95F4;(tablespace)&#x662F;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x5E93;&#x5BF9;&#x5E94;&#x76EE;&#x5F55;&#x4E0B;&#x9762;&#x662F;&#x6CA1;&#x6709;&#x201D;&#x8868;&#x540D;.ibd&#x201D;&#x6587;&#x4EF6;&#x7684;&#x3002;&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x8868;&#x7684;&#x8BDD;&#xFF0C;&#x5219;&#x6709;&#x201D;&#x8868;&#x540D;.ibd&#x201D;&#x6587;&#x4EF6;&#x3002;</p>
</li>
<li><p>INFORMATION_SCHEMA.INNODB_SYS_TABLES&#x5224;&#x522B;(&#x63A8;&#x8350;)</p>
</li>
</ol>
<hr>
<p>&#x8868;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>MySQL&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#x7BA1;&#x7406;&#x3002;<br>MySQL&#x7684;Innodb&#x5305;&#x542B;&#x4E24;&#x79CD;&#x8868;&#x7A7A;&#x95F4;&#x6587;&#x4EF6;&#x6A21;&#x5F0F;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x548C;&#x6BCF;&#x4E2A;&#x8868;&#x5206;&#x79BB;&#x7684;&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x3002;<br>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5F53;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x5927;&#x7684;&#x65F6;&#x5019;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x67E5;&#x770B;&#x8868;&#x7A7A;&#x95F4;&#x6A21;&#x5F0F;&#xFF1A;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">mysql&gt; show variables like &apos;%innodb_file_per_table%&apos; ;</span><br><span class="line"></span><br><span class="line">| innodb_file_per_table | ON    |</span><br></pre></td></tr></table></figure>

<p>&#x8868;&#x793A;&#x5F53;&#x524D;&#x662F;&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x3002;<br>&#x82E5;&#x4E3A;OFF&#xFF0C;&#x5219;&#x8868;&#x793A;&#x4E3A;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x3002;<br>&#x540C;&#x6837;&#xFF1A;1&#x8868;&#x793A;ON&#x3001;0&#x8868;&#x793A;OFF</p>
<p>&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x89C4;&#x5219;&#xFF1A;<br>&#x8868;&#x7ED3;&#x6784;&#x5B9A;&#x4E49;&#x6587;&#x4EF6;&#xFF1A;$datadir/$dbname/$tabname.frm<br>&#x6570;&#x636E;&#x6587;&#x4EF6;&#xFF1A;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x89C4;&#x5219;&#xFF1A;<br>&#x8868;&#x7ED3;&#x6784;&#x5B9A;&#x4E49;&#x6587;&#x4EF6;&#xFF1A;<code>$datadir/$dbname/$tabname.frm</code><br>&#x6570;&#x636E;&#x6587;&#x4EF6;&#xFF1A;<code>$datadir/$dbname/$tabname.ibd</code></p>
<p>&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>Innodb&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#x91CC;&#x9762;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x8868;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x7531;&#x5F88;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x7EC4;&#x6210;&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x53EF;&#x4EE5;&#x8DE8;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x5B58;&#x5728;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x4E0D;&#x518D;&#x662F;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x800C;&#x662F;&#x5176;&#x81EA;&#x8EAB;&#x7684;&#x9650;&#x5236;&#x3002;&#x4ECE;Innodb&#x7684;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5176;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x6700;&#x5927;&#x9650;&#x5236;&#x4E3A;64TB&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;Innodb&#x7684;&#x5355;&#x8868;&#x9650;&#x5236;&#x57FA;&#x672C;&#x4E0A;&#x4E5F;&#x5728;64TB&#x5DE6;&#x53F3;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x5927;&#x5C0F;&#x662F;&#x5305;&#x62EC;&#x8FD9;&#x4E2A;&#x8868;&#x7684;&#x6240;&#x6709;&#x7D22;&#x5F15;&#x7B49;&#x5176;&#x4ED6;&#x76F8;&#x5173;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x4F18;&#x70B9;&#xFF1A;</p>
<p>&#x8868;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x5B58;&#x653E;&#x5230;&#x5404;&#x4E2A;&#x78C1;&#x76D8;&#xFF0C;&#x6240;&#x4EE5;&#x8868;&#x4E5F;&#x5C31;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x5B58;&#x653E;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#xFF0C;&#x8868;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x53D7;&#x78C1;&#x76D8;&#x5927;&#x5C0F;&#x7684;&#x9650;&#x5236;&#x3002;</p>
<p>&#x6570;&#x636E;&#x548C;&#x6587;&#x4EF6;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x65B9;&#x4FBF;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;<br>1&#x3001;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x548C;&#x7D22;&#x5F15;&#x5B58;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x5927;&#x6587;&#x4EF6;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x5C0F;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x591A;&#x4E2A;&#x8868;&#x53CA;&#x7D22;&#x5F15;&#x5728;&#x8868;&#x7A7A;&#x95F4;&#x4E2D;&#x6DF7;&#x5408;&#x5B58;&#x50A8;&#xFF0C;&#x5F53;&#x6570;&#x636E;&#x91CF;&#x975E;&#x5E38;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8868;&#x505A;&#x4E86;&#x5927;&#x91CF;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x540E;&#x8868;&#x7A7A;&#x95F4;&#x4E2D;&#x5C06;&#x4F1A;&#x6709;&#x5927;&#x91CF;&#x7684;&#x7A7A;&#x9699;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x7EDF;&#x8BA1;&#x5206;&#x6790;&#xFF0C;&#x5BF9;&#x4E8E;&#x7ECF;&#x5E38;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x7684;&#x8FD9;&#x7C7B;&#x5E94;&#x7528;&#x6700;&#x4E0D;&#x9002;&#x5408;&#x7528;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x3002;<br>2&#x3001;&#x5171;&#x4EAB;&#x8868;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#x540E;&#x4E0D;&#x80FD;&#x56DE;&#x7F29;&#xFF1A;&#x5F53;&#x51FA;&#x73B0;&#x4E34;&#x65F6;&#x5EFA;&#x7D22;&#x5F15;&#x6216;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x8868;&#x7684;&#x64CD;&#x4F5C;&#x8868;&#x7A7A;&#x95F4;&#x6269;&#x5927;&#x540E;&#xFF0C;&#x5C31;&#x662F;&#x5220;&#x9664;&#x76F8;&#x5173;&#x7684;&#x8868;&#x4E5F;&#x6CA1;&#x529E;&#x6CD5;&#x56DE;&#x7F29;&#x90A3;&#x90E8;&#x5206;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x51B7;&#x5907;&#x5F88;&#x6162;&#xFF1B;</p>
<p>&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x4F18;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x6BCF;&#x4E2A;&#x8868;&#x90FD;&#x6709;&#x81EA;&#x5DF2;&#x72EC;&#x7ACB;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#xFF0C;&#x6BCF;&#x4E2A;&#x8868;&#x7684;&#x6570;&#x636E;&#x548C;&#x7D22;&#x5F15;&#x90FD;&#x4F1A;&#x5B58;&#x5728;&#x81EA;&#x5DF2;&#x7684;&#x8868;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5355;&#x8868;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x79FB;&#x52A8;&#x3002;</li>
<li>&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#xFF08;&#x9664;drop table&#x64CD;&#x4F5C;&#x5904;&#xFF0C;&#x8868;&#x7A7A;&#x4E0D;&#x80FD;&#x81EA;&#x5DF2;&#x56DE;&#x6536;&#xFF09;&#xFF0C;Drop table&#x64CD;&#x4F5C;&#x81EA;&#x52A8;&#x56DE;&#x6536;&#x8868;&#x7A7A;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x7EDF;&#x8BA1;&#x5206;&#x6790;&#x6216;&#x662F;&#x65E5;&#x503C;&#x8868;&#xFF0C;&#x5220;&#x9664;&#x5927;&#x91CF;&#x6570;&#x636E;&#x540E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;:alter table TableName engine=innodb;&#x56DE;&#x7F29;&#x4E0D;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x8868;&#xFF0C;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x5220;&#x9664;&#xFF0C;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x788E;&#x7247;&#x4E0D;&#x4F1A;&#x592A;&#x4E25;&#x91CD;&#x7684;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x673A;&#x4F1A;&#x5904;&#x7406;&#x3002;</li>
</ol>
<p>&#x72EC;&#x7ACB;&#x8868;&#x7A7A;&#x95F4;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x5F53;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x8868;&#x6570;&#x91CF;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x7EA7;&#x522B;&#x65F6;&#xFF0C;&#x6BCF;&#x6B21;&#x64CD;&#x4F5C;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x6587;&#x4EF6;&#x8FC7;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x6309;&#x7167;&#x9ED8;&#x8BA4;Centos&#x7684;ulimit -n = 1024&#x7684;&#x8BDD;&#xFF0C;&#x4EC5;&#x4EC5;&#x53EA;&#x80FD;&#x4FDD;&#x8BC1;&#x540C;&#x65F6;&#x6253;&#x5F00;256&#x4E2A;&#x8868;&#x4EE5;&#x5185;&#xFF0C;&#x8FD9;&#x5728;&#x4E60;&#x60EF;&#x4E0A;&#x201C;&#x62C6;&#x5E93;&#x62C6;&#x8868;&#x201D;&#x7684;MySQL&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0A;&#x5F88;&#x96BE;&#x8FBE;&#x5230;&#x8981;&#x6C42;&#x3002;</li>
<li>&#x53E6;&#x5916;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x7684;&#x5229;&#x7528;&#x7387;&#x4E0D;&#x7B97;&#x5F88;&#x9AD8;&#xFF0C;&#x5F53;&#x5927;&#x91CF;&#x201C;&#x4E0D;&#x9AD8;&#x201D;&#x7684;&#x6587;&#x4EF6;&#x96C6;&#x4E2D;&#x8D77;&#x6765;&#xFF0C;&#x6D6A;&#x8D39;&#x7684;&#x7A7A;&#x95F4;&#x4E5F;&#x5F88;&#x60CA;&#x4EBA;&#xFF0C;&#x66F4;&#x4F55;&#x51B5;&#x6700;&#x540E;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x72B6;&#x51B5;&#x4E0D;&#x662F;&#x201C;&#x4E00;&#x5806;K&#x7EA7;&#x522B;&#x7684;&#x5C0F;&#x6587;&#x4EF6;&#x201D;&#x800C;&#x662F;&#x201C;&#x4E00;&#x5806;G&#x7EA7;&#x522B;&#x7684;&#x5927;&#x6587;&#x4EF6;&#x201D;&#xFF0C;&#x6709;&#x70B9;&#x9002;&#x5F97;&#x5176;&#x53CD;&#x7684;&#x610F;&#x601D;&#x3002;</li>
</ol>
<hr>
<p>&#x4ECE;&#x5916;&#x90E8;&#x6765;&#x770B;&#xFF0C;&#x8868;&#x7A7A;&#x95F4;&#x662F;&#x7531;&#x8FDE;&#x7EED;&#x7684;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;page&#x6784;&#x6210;&#x3002;&#x5176;&#x5B9E;&#x8868;&#x7A7A;&#x95F4;&#x6587;&#x4EF6;&#x5185;&#x90E8;&#x8FD8;&#x662F;&#x7EC4;&#x7EC7;&#x4E3A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#xFF0C;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x53EF;&#x5206;&#x4E3A;segment&#x3001;extent&#x548C;page&#x3002;</p>
<p>&#x8868;&#x7A7A;&#x95F4;&#x4E0B;&#x4E00;&#x7EA7;&#x79F0;&#x4E3A;segment&#x3002;segment&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x7D22;&#x5F15;&#x76F8;&#x6620;&#x5C04;&#x3002;Innodb&#x5F15;&#x64CE;&#x5185;&#xFF0C;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x5BF9;&#x5E94;&#x4E24;&#x4E2A;segment&#xFF1A;&#x7BA1;&#x7406;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;segment&#x548C;&#x7BA1;&#x7406;&#x975E;&#x53F6;&#x5B50;&#x8282;&#x70B9;segment&#x3002;&#x521B;&#x5EFA;&#x7D22;&#x5F15;&#x4E2D;&#x5F88;&#x5173;&#x952E;&#x7684;&#x6B65;&#x9AA4;&#x4FBF;&#x662F;&#x5206;&#x914D;segment&#xFF0C;<strong>Innodb&#x5185;&#x90E8;&#x4F7F;&#x7528;INODE&#x6765;&#x63CF;&#x8FF0;segment</strong>&#x3002;</p>
<p>segment&#x7684;&#x4E0B;&#x4E00;&#x7EA7;&#x662F;extent&#xFF0C;extent&#x4EE3;&#x8868;&#x4E00;&#x7EC4;&#x8FDE;&#x7EED;&#x7684;page&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;64&#x4E2A;page&#xFF0C;&#x5927;&#x5C0F;1MB&#x3002;extent&#x7684;&#x4F5C;&#x7528;&#x662F;&#x63D0;&#x9AD8;page&#x5206;&#x914D;&#x6548;&#x7387;&#xFF0C;&#x6279;&#x91CF;&#x5206;&#x914D;&#x5728;&#x6548;&#x7387;&#x4E0A;&#x603B;&#x662F;&#x4F18;&#x4E8E;&#x79BB;&#x6563;&#x3001;&#x5355;&#x4E00;&#x7684;page&#x5206;&#x914D;&#xFF0C;&#x53E6;&#x5916;&#x5728;&#x6570;&#x636E;&#x8FDE;&#x7EED;&#x6027;&#x65B9;&#x9762;&#x4E5F;&#x66F4;&#x4F73;&#xFF0C;segment&#x6269;&#x5BB9;&#x65F6;&#x4EE5;extent&#x4E3A;&#x5355;&#x4F4D;&#x5206;&#x914D;&#x3002;Innodb&#x5185;&#x90E8;&#x4F7F;&#x7528;XDES&#x6765;&#x63CF;&#x8FF0;extent&#x3002;</p>
<p>page&#x5219;&#x662F;&#x8868;&#x7A7A;&#x95F4;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;innodb&#x5C06;&#x8868;&#x6587;&#x4EF6;&#xFF08;xxx.ibd&#xFF09;&#x6309;page&#x5207;&#x5206;&#xFF0C;&#x4F9D;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#xFF0C;page&#x5185;&#x5BB9;&#x4E5F;&#x6709;&#x6240;&#x533A;&#x522B;&#xFF0C;&#x6700;&#x4E3A;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x884C;&#x8BB0;&#x5F55;&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/12A002.[%E5%AD%98%E5%82%A8%E5%BC%95%E6%93%8E]-InnoDB%E8%A1%A8%E7%A9%BA%E9%97%B4%E5%8E%9F%E7%90%86/1.jpg"></p>
<p>from:</p>
<ul>
<li><a target="_blank" rel="noopener" href="http://mysql.taobao.org/monthly/2019/10/01/">http://mysql.taobao.org/monthly/2019/10/01/</a></li>
<li><a target="_blank" rel="noopener" href="https://blog.csdn.net/qq_18312025/article/details/78658171">https://blog.csdn.net/qq_18312025/article/details/78658171</a></li>
</ul>
 
      <!-- reward -->
      
    </div>
    

    <!-- copyright -->
    
    <footer class="article-footer">
       
  <ul class="article-tag-list" itemprop="keywords"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/MySQL/" rel="tag">MySQL</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/%E5%AD%98%E5%82%A8%E5%BC%95%E6%93%8E/" rel="tag">存储引擎</a></li></ul>

    </footer>
  </div>

   
  <nav class="article-nav">
    
      <a href="/2020/05/01/12A001.%5B%E5%AD%98%E5%82%A8%E5%BC%95%E6%93%8E%5D-%E5%AD%98%E5%82%A8%E5%BC%95%E6%93%8EInnoDB%E5%92%8CMyISAM%E5%8C%BA%E5%88%AB/" class="article-nav-link">
        <strong class="article-nav-caption">上一篇</strong>
        <div class="article-nav-title">
          
            12A001.[存储引擎]-存储引擎InnoDB和MyISAM区别
          
        </div>
      </a>
    
    
      <a href="/2020/05/01/12.004.%5B%E7%BB%BC%E5%90%88%5D-MySQL%E5%BA%95%E5%B1%82%E6%9E%B6%E6%9E%84%EF%BC%9A%E7%BC%93%E5%86%B2%E4%B8%8E%E7%A3%81%E7%9B%98/" class="article-nav-link">
        <strong class="article-nav-caption">下一篇</strong>
        <div class="article-nav-title">12.004.[综合]-MySQL底层架构：缓冲与磁盘</div>
      </a>
    
  </nav>

  
   
    
    <script src="https://cdn.staticfile.org/twikoo/1.4.18/twikoo.all.min.js"></script>
    <div id="twikoo" class="twikoo"></div>
    <script>
        twikoo.init({
            envId: ""
        })
    </script>
 
</article>

</section>
      <footer class="footer">
  <div class="outer">
    <ul>
      <li>
        Copyrights &copy;
        2015-2023
        <i class="ri-heart-fill heart_icon"></i> xugang.xie
      </li>
    </ul>
    <ul>
      <li>
        
      </li>
    </ul>
    <ul>
      <li>
        
        
        <span>
  <span><i class="ri-user-3-fill"></i>访问人数:<span id="busuanzi_value_site_uv"></span></span>
  <span class="division">|</span>
  <span><i class="ri-eye-fill"></i>浏览次数:<span id="busuanzi_value_page_pv"></span></span>
</span>
        
      </li>
    </ul>
    <ul>
      
    </ul>
    <ul>
      
    </ul>
    <ul>
      <li>
        <!-- cnzz统计 -->
        
        <script type="text/javascript" src='https://s9.cnzz.com/z_stat.php?id=1278069914&amp;web_id=1278069914'></script>
        
      </li>
    </ul>
  </div>
</footer>    
    </main>
    <div class="float_btns">
      <div class="totop" id="totop">
  <i class="ri-arrow-up-line"></i>
</div>

<div class="todark" id="todark">
  <i class="ri-moon-line"></i>
</div>

    </div>
    <aside class="sidebar on">
      <button class="navbar-toggle"></button>
<nav class="navbar">
  
  <div class="logo">
    <a href="/"><img src="/images/ayer-side.svg" alt="xugang.xie&#39;s blog"></a>
  </div>
  
  <ul class="nav nav-main">
    
    <li class="nav-item">
      <a class="nav-item-link" href="/">主页</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/archives">归档</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/categories">分类</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/tags">标签</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/friends">友链</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/about">关于我</a>
    </li>
    
  </ul>
</nav>
<nav class="navbar navbar-bottom">
  <ul class="nav">
    <li class="nav-item">
      
      <a class="nav-item-link nav-item-search"  title="搜索">
        <i class="ri-search-line"></i>
      </a>
      
      
      <a class="nav-item-link" target="_blank" href="/atom.xml" title="RSS Feed">
        <i class="ri-rss-line"></i>
      </a>
      
    </li>
  </ul>
</nav>
<div class="search-form-wrap">
  <div class="local-search local-search-plugin">
  <input type="search" id="local-search-input" class="local-search-input" placeholder="Search...">
  <div id="local-search-result" class="local-search-result"></div>
</div>
</div>
    </aside>
    <div id="mask"></div>

<!-- #reward -->
<div id="reward">
  <span class="close"><i class="ri-close-line"></i></span>
  <p class="reward-p"><i class="ri-cup-line"></i>请我喝杯咖啡吧~</p>
  <div class="reward-box">
    
    <div class="reward-item">
      <img class="reward-img" src="/images/alipay.jpg">
      <span class="reward-type">支付宝</span>
    </div>
    
    
    <div class="reward-item">
      <img class="reward-img" src="/images/wechat.jpg">
      <span class="reward-type">微信</span>
    </div>
    
  </div>
</div>
    
<script src="/js/jquery-3.6.0.min.js"></script>
 
<script src="/js/lazyload.min.js"></script>

<!-- Tocbot -->
 
<script src="/js/tocbot.min.js"></script>

<script>
  tocbot.init({
    tocSelector: ".tocbot",
    contentSelector: ".article-entry",
    headingSelector: "h1, h2, h3, h4, h5, h6",
    hasInnerContainers: true,
    scrollSmooth: true,
    scrollContainer: "main",
    positionFixedSelector: ".tocbot",
    positionFixedClass: "is-position-fixed",
    fixedSidebarOffset: "auto",
  });
</script>

<script src="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.js"></script>
<link
  rel="stylesheet"
  href="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.css"
/>
<script src="https://cdn.staticfile.org/justifiedGallery/3.8.1/js/jquery.justifiedGallery.min.js"></script>

<script src="/dist/main.js"></script>

<!-- ImageViewer -->
 <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                        <div class="pswp__preloader__cut">
                            <div class="pswp__preloader__donut"></div>
                        </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div>
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>

<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.css">
<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/default-skin/default-skin.min.css">
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.js"></script>
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe-ui-default.min.js"></script>

<script>
    function viewer_init() {
        let pswpElement = document.querySelectorAll('.pswp')[0];
        let $imgArr = document.querySelectorAll(('.article-entry img:not(.reward-img)'))

        $imgArr.forEach(($em, i) => {
            $em.onclick = () => {
                // slider展开状态
                // todo: 这样不好，后面改成状态
                if (document.querySelector('.left-col.show')) return
                let items = []
                $imgArr.forEach(($em2, i2) => {
                    let img = $em2.getAttribute('data-idx', i2)
                    let src = $em2.getAttribute('data-target') || $em2.getAttribute('src')
                    let title = $em2.getAttribute('alt')
                    // 获得原图尺寸
                    const image = new Image()
                    image.src = src
                    items.push({
                        src: src,
                        w: image.width || $em2.width,
                        h: image.height || $em2.height,
                        title: title
                    })
                })
                var gallery = new PhotoSwipe(pswpElement, PhotoSwipeUI_Default, items, {
                    index: parseInt(i)
                });
                gallery.init()
            }
        })
    }
    viewer_init()
</script> 
<!-- MathJax -->

<!-- Katex -->

<!-- busuanzi  -->
 
<script src="/js/busuanzi-2.3.pure.min.js"></script>
 
<!-- ClickLove -->

<!-- ClickBoom1 -->

<!-- ClickBoom2 -->

<!-- CodeCopy -->
 
<link rel="stylesheet" href="/css/clipboard.css">
 <script src="https://cdn.staticfile.org/clipboard.js/2.0.10/clipboard.min.js"></script>
<script>
  function wait(callback, seconds) {
    var timelag = null;
    timelag = window.setTimeout(callback, seconds);
  }
  !function (e, t, a) {
    var initCopyCode = function(){
      var copyHtml = '';
      copyHtml += '<button class="btn-copy" data-clipboard-snippet="">';
      copyHtml += '<i class="ri-file-copy-2-line"></i><span>COPY</span>';
      copyHtml += '</button>';
      $(".highlight .code pre").before(copyHtml);
      $(".article pre code").before(copyHtml);
      var clipboard = new ClipboardJS('.btn-copy', {
        target: function(trigger) {
          return trigger.nextElementSibling;
        }
      });
      clipboard.on('success', function(e) {
        let $btn = $(e.trigger);
        $btn.addClass('copied');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-checkbox-circle-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPIED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-checkbox-circle-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
      clipboard.on('error', function(e) {
        e.clearSelection();
        let $btn = $(e.trigger);
        $btn.addClass('copy-failed');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-time-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPY FAILED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-time-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
    }
    initCopyCode();
  }(window, document);
</script>
 
<!-- CanvasBackground -->

<script>
  if (window.mermaid) {
    mermaid.initialize({ theme: "forest" });
  }
</script>


    
    

  </div>
</body>

</html>