<!DOCTYPE html>


<html lang="zh-CN">
  

    <head>
      <meta charset="utf-8" />
        
      <meta name="description" content="一个八股文拾荒者&lt;br&gt;- A collector who is focuced on asshole-Java." />
      
      <meta
        name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1"
      />
      <title>中间件系列之kafka-消息丢失与消费精确一次性 |  xugang.xie&#39;s blog</title>
  <meta name="generator" content="hexo-theme-ayer">
      
      <link rel="shortcut icon" href="/favicon.ico" />
       
<link rel="stylesheet" href="/dist/main.css">

      
<link rel="stylesheet" href="/css/fonts/remixicon.css">

      
<link rel="stylesheet" href="/css/custom.css">
 
      <script src="https://cdn.staticfile.org/pace/1.2.4/pace.min.js"></script>
       
 

      <link
        rel="stylesheet"
        href="https://cdn.jsdelivr.net/npm/@sweetalert2/theme-bulma@5.0.1/bulma.min.css"
      />
      <script src="https://cdn.jsdelivr.net/npm/sweetalert2@11.0.19/dist/sweetalert2.min.js"></script>

      <!-- mermaid -->
      
      <style>
        .swal2-styled.swal2-confirm {
          font-size: 1.6rem;
        }
      </style>
    <link rel="alternate" href="/atom.xml" title="xugang.xie's blog" type="application/atom+xml">
</head>
  </html>
</html>


<body>
  <div id="app">
    
      
    <main class="content on">
      <section class="outer">
  <article
  id="post-7E.105.中间件系列之kafka-消息丢失与消费精确一次性"
  class="article article-type-post"
  itemscope
  itemprop="blogPost"
  data-scroll-reveal
>
  <div class="article-inner">
    
    <header class="article-header">
       
<h1 class="article-title sea-center" style="border-left:0" itemprop="name">
  中间件系列之kafka-消息丢失与消费精确一次性
</h1>
 

      
    </header>
     
    <div class="article-meta">
      <a href="/2022/07/12/7E.105.%E4%B8%AD%E9%97%B4%E4%BB%B6%E7%B3%BB%E5%88%97%E4%B9%8Bkafka-%E6%B6%88%E6%81%AF%E4%B8%A2%E5%A4%B1%E4%B8%8E%E6%B6%88%E8%B4%B9%E7%B2%BE%E7%A1%AE%E4%B8%80%E6%AC%A1%E6%80%A7/" class="article-date">
  <time datetime="2022-07-11T16:00:00.000Z" itemprop="datePublished">2022-07-12</time>
</a> 
  <div class="article-category">
    <a class="article-category-link" href="/categories/%E4%B8%AD%E9%97%B4%E4%BB%B6/">中间件</a>
  </div>
  
<div class="word_count">
    <span class="post-time">
        <span class="post-meta-item-icon">
            <i class="ri-quill-pen-line"></i>
            <span class="post-meta-item-text"> 字数统计:</span>
            <span class="post-count">2.8k</span>
        </span>
    </span>

    <span class="post-time">
        &nbsp; | &nbsp;
        <span class="post-meta-item-icon">
            <i class="ri-book-open-line"></i>
            <span class="post-meta-item-text"> 阅读时长≈</span>
            <span class="post-count">17 分钟</span>
        </span>
    </span>
</div>
 
    </div>
      
    <div class="tocbot"></div>




  
    <div class="article-entry" itemprop="articleBody">
       
  <blockquote>
<p>Kafka &#x6D88;&#x606F;&#x4E22;&#x5931;&#x4E0E;&#x6D88;&#x8D39;&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#x6027;: <a target="_blank" rel="noopener" href="https://zhuanlan.zhihu.com/p/154502456">https://zhuanlan.zhihu.com/p/154502456</a></p>
</blockquote>
<span id="more"></span>
<h3 id="&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x573A;&#x666F;"><a href="#&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x573A;&#x666F;" class="headerlink" title="&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x573A;&#x666F;"></a>&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x573A;&#x666F;</h3><p>&#x5982;&#x679C;Kafka Producer&#x4F7F;&#x7528;&#x201C;&#x53D1;&#x540E;&#x5373;&#x5FD8;&#x201D;&#x7684;&#x65B9;&#x5F0F;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x5373;&#x8C03;&#x7528;producer.send(msg)&#x65B9;&#x6CD5;&#x6765;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x65B9;&#x6CD5;&#x4F1A;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#xFF0C;&#x4F46;&#x6B64;&#x65F6;&#x5E76;&#x4E0D;&#x80FD;&#x8BF4;&#x660E;&#x6D88;&#x606F;&#x5DF2;&#x7ECF;&#x53D1;&#x9001;&#x6210;&#x529F;&#x3002;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x65B9;&#x5F0F;&#x8BE6;&#x89C1;&#x521D;&#x6B21;&#x9082;&#x9005;Kafka&#x751F;&#x4EA7;&#x8005;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5728;&#x6D88;&#x606F;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x4E86;&#x7F51;&#x7EDC;&#x6296;&#x52A8;&#xFF0C;&#x90A3;&#x4E48;&#x6D88;&#x606F;&#x5C31;&#x4F1A;&#x4E22;&#x5931;&#xFF1B;&#x6216;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x672C;&#x8EAB;&#x4E0D;&#x7B26;&#x5408;&#x8981;&#x6C42;&#xFF0C;&#x5982;&#x5927;&#x5C0F;&#x8D85;&#x8FC7;Broker&#x7AEF;&#x7684;&#x627F;&#x53D7;&#x80FD;&#x529B;&#x7B49;&#xFF08;&#x6D88;&#x606F;&#x592A;&#x5927;&#x7684;&#x60C5;&#x51B5;&#x5728;&#x751F;&#x4EA7;&#x4E2D;&#x5B9E;&#x9645;&#x9047;&#x5230;&#x8FC7;&#xFF0C;&#x6700;&#x540E;&#x901A;&#x8FC7;&#x5728;&#x53D1;&#x9001;&#x524D;&#x5C06;&#x6D88;&#x606F;&#x5206;&#x5305;&#xFF0C;&#x518D;&#x4F9D;&#x6B21;&#x53D1;&#x9001;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x8BE5;&#x95EE;&#x9898;&#xFF09;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8BE5;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#xFF1A;Producer&#x8981;&#x4F7F;&#x7528;&#x5E26;&#x56DE;&#x8C03;&#x901A;&#x77E5;&#x7684;&#x65B9;&#x6CD5;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x5373;<code>producer.send(msg, callback)</code>&#x3002;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;callback&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x6D88;&#x606F;&#x662F;&#x5426;&#x771F;&#x7684;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x4E00;&#x65E6;&#x51FA;&#x73B0;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x5BB9;&#x9519;&#x53CA;&#x8865;&#x6551;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x7F51;&#x7EDC;&#x6296;&#x52A8;&#x5BFC;&#x81F4;&#x7684;&#x6D88;&#x606F;&#x4E22;&#x5931;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;Producer&#x91CD;&#x8BD5;&#xFF1B;&#x6D88;&#x606F;&#x4E0D;&#x5408;&#x683C;&#xFF0C;&#x5219;&#x5C06;&#x6D88;&#x606F;&#x683C;&#x5F0F;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x518D;&#x53D1;&#x9001;&#x3002;Producer&#x4F7F;&#x7528;&#x5E26;&#x56DE;&#x8C03;&#x7684;&#x6D88;&#x606F;&#x53D1;&#x9001;API&#xFF0C;&#x53EF;&#x4EE5;&#x53CA;&#x65F6;&#x53D1;&#x73B0;&#x6D88;&#x606F;&#x662F;&#x5426;&#x53D1;&#x9001;&#x5931;&#x8D25;&#x5E76;&#x4F5C;&#x76F8;&#x5E94;&#x5904;&#x7406;&#x3002;</p>
<h3 id="&#x6D88;&#x8D39;&#x8005;&#x4E22;&#x5931;&#x6570;&#x636E;"><a href="#&#x6D88;&#x8D39;&#x8005;&#x4E22;&#x5931;&#x6570;&#x636E;" class="headerlink" title="&#x6D88;&#x8D39;&#x8005;&#x4E22;&#x5931;&#x6570;&#x636E;"></a>&#x6D88;&#x8D39;&#x8005;&#x4E22;&#x5931;&#x6570;&#x636E;</h3><p>Consumer&#x7AEF;&#x4E22;&#x5931;&#x6570;&#x636E;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x5728;&#xFF1A;&#x62C9;&#x53D6;&#x4E86;&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x63D0;&#x4EA4;&#x4E86;&#x6D88;&#x8D39;&#x4F4D;&#x79FB;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6D88;&#x606F;&#x5904;&#x7406;&#x7ED3;&#x675F;&#x4E4B;&#x524D;&#x7A81;&#x7136;&#x53D1;&#x751F;&#x4E86;&#x5B95;&#x673A;&#x7B49;&#x6545;&#x969C;&#x3002;&#x6D88;&#x8D39;&#x8005;&#x91CD;&#x751F;&#x540E;&#xFF0C;&#x4F1A;&#x4ECE;&#x4E4B;&#x524D;&#x5DF2;&#x63D0;&#x4EA4;&#x7684;&#x4F4D;&#x79FB;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x6D88;&#x8D39;&#xFF0C;&#x4E4B;&#x524D;&#x672A;&#x5904;&#x7406;&#x5B8C;&#x6210;&#x7684;&#x6D88;&#x606F;&#x4E0D;&#x4F1A;&#x518D;&#x6B21;&#x5904;&#x7406;&#xFF0C;&#x5373;&#x76F8;&#x5F53;&#x4E8E;&#x6D88;&#x8D39;&#x8005;&#x4E22;&#x5931;&#x4E86;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x89E3;&#x51B3;Consumer&#x7AEF;&#x4E22;&#x5931;&#x6D88;&#x606F;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5C06;&#x4F4D;&#x79FB;&#x63D0;&#x4EA4;&#x7684;&#x65F6;&#x673A;&#x6539;&#x4E3A;&#x6D88;&#x606F;&#x5904;&#x7406;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x786E;&#x8BA4;&#x6D88;&#x8D39;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x6279;&#x6D88;&#x606F;&#x518D;&#x63D0;&#x4EA4;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x79FB;&#x3002;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x5373;&#x4F7F;&#x5904;&#x7406;&#x6D88;&#x606F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x4E86;&#x5F02;&#x5E38;&#xFF0C;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#x4F4D;&#x79FB;&#xFF0C;&#x4E0B;&#x6B21;&#x6D88;&#x8D39;&#x65F6;&#x8FD8;&#x4F1A;&#x4ECE;&#x4E0A;&#x6B21;&#x7684;&#x4F4D;&#x79FB;&#x5904;&#x91CD;&#x65B0;&#x62C9;&#x53D6;&#x6D88;&#x606F;&#xFF0C;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x4E3A;&#xFF0C;Consumer&#x5728;&#x6D88;&#x8D39;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x5173;&#x95ED;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x4F4D;&#x79FB;&#xFF0C;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x624B;&#x52A8;&#x63D0;&#x4EA4;&#x4F4D;&#x79FB;&#x3002;</p>
<h3 id="Broker&#x7AEF;&#x4E22;&#x5931;&#x6570;&#x636E;"><a href="#Broker&#x7AEF;&#x4E22;&#x5931;&#x6570;&#x636E;" class="headerlink" title="Broker&#x7AEF;&#x4E22;&#x5931;&#x6570;&#x636E;"></a>Broker&#x7AEF;&#x4E22;&#x5931;&#x6570;&#x636E;</h3><p>Broker&#x7AEF;&#x4E22;&#x5931;&#x6570;&#x636E;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>&#x539F;&#x6765;&#x7684;Broker&#x5B95;&#x673A;&#x4E86;&#xFF0C;&#x5374;&#x9009;&#x4E3E;&#x4E86;&#x4E00;&#x4E2A;&#x843D;&#x540E;Leader&#x592A;&#x591A;&#x7684;Broker&#x6210;&#x4E3A;&#x65B0;&#x7684;Leader&#xFF0C;&#x90A3;&#x4E48;&#x843D;&#x540E;&#x7684;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x5C31;&#x90FD;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x7981;&#x6B62;&#x8FD9;&#x4E9B;&#x201C;unclean&#x201D;&#x7684;Broker&#x7ADE;&#x9009;&#x6210;&#x4E3A;Leader&#xFF1B;</p>
<p>Kafka&#x4F7F;&#x7528;&#x9875;&#x7F13;&#x5B58;&#x673A;&#x5236;&#xFF0C;&#x5C06;&#x6D88;&#x606F;&#x5199;&#x5165;&#x9875;&#x7F13;&#x5B58;&#x800C;&#x975E;&#x76F4;&#x63A5;&#x6301;&#x4E45;&#x5316;&#x81F3;&#x78C1;&#x76D8;&#xFF0C;&#x5C06;&#x5237;&#x76D8;&#x5DE5;&#x4F5C;&#x4EA4;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6765;&#x8C03;&#x5EA6;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x4FDD;&#x8BC1;&#x9AD8;&#x6548;&#x7387;&#x548C;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E00;&#x90E8;&#x5206;&#x6D88;&#x606F;&#x8FD8;&#x5728;&#x5185;&#x5B58;&#x9875;&#x4E2D;&#xFF0C;&#x672A;&#x6301;&#x4E45;&#x5316;&#x81F3;&#x78C1;&#x76D8;&#xFF0C;&#x6B64;&#x65F6;Broker&#x5B95;&#x673A;&#xFF0C;&#x91CD;&#x542F;&#x540E;&#x5219;&#x8FD9;&#x90E8;&#x5206;&#x6D88;&#x606F;&#x4E22;&#x5931;&#xFF0C;&#x4F7F;&#x7528;&#x591A;&#x526F;&#x672C;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x907F;&#x514D;Broker&#x7AEF;&#x4E22;&#x5931;&#x6D88;&#x606F;&#xFF1B;</p>
<h3 id="&#x907F;&#x514D;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;"><a href="#&#x907F;&#x514D;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;" class="headerlink" title="&#x907F;&#x514D;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;"></a>&#x907F;&#x514D;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</h3><ul>
<li><p>&#x4E0D;&#x4F7F;&#x7528;producer.send(msg)&#xFF0C;&#x800C;&#x4F7F;&#x7528;&#x5E26;&#x56DE;&#x8C03;&#x7684;producer.send(msg, callback)&#x65B9;&#x6CD5;&#xFF1B;</p>
</li>
<li><p>&#x8BBE;&#x7F6E;acks = all&#x3002;acks&#x53C2;&#x6570;&#x662F;Producer&#x7684;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x4EE3;&#x8868;&#x4E86;&#x5BF9;&#x6D88;&#x606F;&#x201C;&#x5DF2;&#x63D0;&#x4EA4;&#x201D;&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x6210;all&#xFF0C;&#x5219;&#x8868;&#x793A;&#x6240;&#x6709;&#x7684;Broker&#x526F;&#x672C;&#x90FD;&#x8981;&#x63A5;&#x6536;&#x5230;&#x6D88;&#x606F;&#xFF0C;&#x624D;&#x7B97;&#x6D88;&#x606F;&#x201C;&#x5DF2;&#x63D0;&#x4EA4;&#x201D;&#xFF0C;&#x662F;&#x6700;&#x9AD8;&#x7B49;&#x7EA7;&#x7684;&#x201C;&#x5DF2;&#x63D0;&#x4EA4;&#x201D;&#x6807;&#x51C6;&#xFF1B;</p>
</li>
<li><p>&#x8BBE;&#x7F6E;retries&#x4E3A;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x7684;&#x503C;&#xFF0C;retries&#x8868;&#x793A;Producer&#x53D1;&#x9001;&#x6D88;&#x606F;&#x5931;&#x8D25;&#x540E;&#x7684;&#x91CD;&#x8BD5;&#x6B21;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x751F;&#x4E86;&#x7F51;&#x7EDC;&#x6296;&#x52A8;&#x7B49;&#x77AC;&#x65F6;&#x6545;&#x969C;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x91CD;&#x8BD5;&#x673A;&#x5236;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x907F;&#x514D;&#x6D88;&#x606F;&#x4E22;&#x5931;&#xFF1B;</p>
</li>
<li><p>&#x8BBE;&#x7F6E;unclean.leader.election.enable = false&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;Broker&#x7AEF;&#x53C2;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x54EA;&#x4E9B;Broker&#x6709;&#x8D44;&#x683C;&#x7ADE;&#x9009;&#x4E3A;&#x5206;&#x533A;&#x7684;Leader&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x843D;&#x540E;Leader&#x592A;&#x591A;&#x7684;Follower&#x6240;&#x5728;Broker&#x6210;&#x4E3A;&#x4E86;&#x65B0;&#x7684;Leader&#xFF0C;&#x5219;&#x5FC5;&#x7136;&#x4F1A;&#x5BFC;&#x81F4;&#x6D88;&#x606F;&#x7684;&#x4E22;&#x5931;&#xFF0C;&#x6545;&#x5C06;&#x8BE5;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E3A;false&#xFF0C;&#x5373;&#x4E0D;&#x5141;&#x8BB8;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x53D1;&#x751F;&#xFF1B;</p>
</li>
<li><p>&#x8BBE;&#x7F6E;replication.factor &gt;= 3&#x3002;Broker&#x7AEF;&#x53C2;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x526F;&#x672C;&#x6570;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;3&#xFF0C;&#x4F7F;&#x7528;&#x5197;&#x4F59;&#x7684;&#x673A;&#x5236;&#x6765;&#x9632;&#x6B62;&#x6D88;&#x606F;&#x4E22;&#x5931;&#xFF1B;</p>
</li>
<li><p>&#x8BBE;&#x7F6E;min.insync.replicas &gt; 1&#x3002;Broker&#x7AEF;&#x53C2;&#x6570;&#xFF0C;&#x63A7;&#x5236;&#x7684;&#x662F;&#x6D88;&#x606F;&#x81F3;&#x5C11;&#x88AB;&#x5199;&#x5165;&#x591A;&#x5C11;&#x4E2A;&#x526F;&#x672C;&#x8521;&#x6813;&#x662F;&#x201C;&#x5DF2;&#x63D0;&#x4EA4;&#x201D;&#xFF0C;&#x5C06;&#x8BE5;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x6210;&#x5927;&#x4E8E;1&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x6D88;&#x606F;&#x6301;&#x4E45;&#x6027;&#xFF1B;</p>
</li>
<li><p>&#x786E;&#x4FDD;replication.factor &gt; min.insync.replicas&#x3002;&#x82E5;&#x4E24;&#x8005;&#x76F8;&#x7B49;&#xFF0C;&#x5219;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x6302;&#x4E86;&#xFF0C;&#x6574;&#x4E2A;&#x5206;&#x533A;&#x5C31;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x63A8;&#x8350;&#x8BBE;&#x7F6E;&#x4E3A;&#xFF1A;replication.factor = min.insync.replicas + 1&#xFF1B;</p>
</li>
<li><p>&#x786E;&#x4FDD;&#x6D88;&#x606F;&#x6D88;&#x8D39;&#x5B8C;&#x518D;&#x63D0;&#x4EA4;&#x4F4D;&#x79FB;&#xFF0C;&#x5C06;Consumer&#x7AEF;&#x53C2;&#x6570;enable.auto.commit&#x8BBE;&#x7F6E;&#x4E3A;fasle&#xFF0C;&#x5173;&#x95ED;&#x4F4D;&#x79FB;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#xFF0C;&#x4F7F;&#x7528;&#x624B;&#x52A8;&#x63D0;&#x4EA4;&#x4F4D;&#x79FB;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
</li>
</ul>
<h3 id="&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#x6D88;&#x8D39;"><a href="#&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#x6D88;&#x8D39;" class="headerlink" title="&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#x6D88;&#x8D39;"></a>&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#x6D88;&#x8D39;</h3><p>&#x76EE;&#x524D;Kafka&#x9ED8;&#x8BA4;&#x63D0;&#x4F9B;&#x7684;&#x6D88;&#x606F;&#x53EF;&#x9760;&#x673A;&#x5236;&#x662F;&#x201C;&#x81F3;&#x5C11;&#x4E00;&#x6B21;&#x201D;&#xFF0C;&#x5373;&#x6D88;&#x606F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x3002;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;Producer&#x5982;&#x679C;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x91CD;&#x8BD5;&#x89E3;&#x51B3;&#xFF0C;&#x82E5;Broker&#x7AEF;&#x7684;&#x5E94;&#x7B54;&#x672A;&#x6210;&#x529F;&#x53D1;&#x9001;&#x7ED9;Producer&#xFF08;&#x5982;&#x7F51;&#x7EDC;&#x6296;&#x52A8;&#xFF09;&#xFF0C;Producer&#x6B64;&#x65F6;&#x4E5F;&#x4F1A;&#x8FDB;&#x884C;&#x91CD;&#x8BD5;&#xFF0C;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x539F;&#x6765;&#x7684;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x5C31;&#x662F;Kafka&#x9ED8;&#x8BA4;&#x63D0;&#x4F9B;&#x6D88;&#x606F;&#x81F3;&#x5C11;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6D88;&#x606F;&#x91CD;&#x590D;&#x53D1;&#x9001;&#x3002;</p>
<p>&#x5982;&#x679C;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x6D88;&#x606F;&#x6D88;&#x8D39;&#x7684;&#x201C;&#x6700;&#x591A;&#x4E00;&#x6B21;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x7981;&#x6B62;Producer&#x7684;&#x91CD;&#x8BD5;&#x5373;&#x53EF;&#x3002;&#x4F46;&#x662F;&#x5199;&#x5165;&#x5931;&#x8D25;&#x7684;&#x6D88;&#x606F;&#x5982;&#x679C;&#x4E0D;&#x91CD;&#x8BD5;&#x5219;&#x4F1A;&#x6C38;&#x8FDC;&#x4E22;&#x5931;&#x3002;&#x662F;&#x5426;&#x6709;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x6765;&#x4FDD;&#x8BC1;&#x6D88;&#x606F;&#x7684;&#x53D1;&#x9001;&#x65E2;&#x4E0D;&#x4E22;&#x5931;&#xFF0C;&#x4E5F;&#x4E0D;&#x91CD;&#x590D;&#x6D88;&#x8D39;&#xFF1F;&#x6216;&#x8005;&#x8BF4;&#x5373;&#x4F7F;Producer&#x91CD;&#x590D;&#x53D1;&#x9001;&#x4E86;&#x67D0;&#x4E9B;&#x6D88;&#x606F;&#xFF0C;Broker&#x7AEF;&#x4E5F;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x53BB;&#x91CD;&#x3002;</p>
<p>Kafka&#x5B9E;&#x9645;&#x4E0A;&#x901A;&#x8FC7;&#x4E24;&#x79CD;&#x673A;&#x5236;&#x6765;&#x786E;&#x4FDD;&#x6D88;&#x606F;&#x6D88;&#x8D39;&#x7684;&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#xFF1A;</p>
<p>&#x5E42;&#x7B49;&#x6027;&#xFF08;Idempotence&#xFF09;</p>
<p>&#x4E8B;&#x52A1;&#xFF08;Transaction&#xFF09;</p>
<p>&#x5E42;&#x7B49;&#x6027;</p>
<p>&#x6240;&#x8C13;&#x7684;&#x5E42;&#x7B49;&#xFF0C;&#x7B80;&#x5355;&#x8BF4;&#x5C31;&#x662F;&#x5BF9;&#x63A5;&#x53E3;&#x7684;&#x591A;&#x6B21;&#x8C03;&#x7528;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x7ED3;&#x679C;&#x548C;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x5728;Kafka&#x4E2D;&#xFF0C;Producer&#x9ED8;&#x8BA4;&#x4E0D;&#x662F;&#x5E42;&#x7B49;&#x6027;&#x7684;&#xFF0C;Kafka&#x4E8E;0.11.0.0&#x7248;&#x672C;&#x5F15;&#x5165;&#x8BE5;&#x7279;&#x6027;&#x3002;&#x8BBE;&#x7F6E;&#x53C2;&#x6570;enable.idempotence&#x4E3A;true&#x5373;&#x53EF;&#x6307;&#x5B9A;Producer&#x7684;&#x5E42;&#x7B49;&#x6027;&#x3002;&#x5F00;&#x542F;&#x5E42;&#x7B49;&#x751F;&#x4EA7;&#x8005;&#x540E;&#xFF0C;Kafka&#x4F1A;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x6D88;&#x606F;&#x7684;&#x53BB;&#x91CD;&#x53D1;&#x9001;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x751F;&#x4EA7;&#x8005;&#x7684;&#x5E42;&#x7B49;&#x6027;&#xFF0C;Kafka&#x5F15;&#x5165;&#x4E86;producer id&#xFF08;&#x540E;&#x7B80;&#x79F0;PID&#xFF09;&#x548C;&#x5E8F;&#x5217;&#x53F7;&#xFF08;sequence number&#xFF09;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x751F;&#x4EA7;&#x8005;&#x5B9E;&#x4F8B;&#x5728;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x5206;&#x914D;&#x4E00;&#x4E2A;PID&#xFF0C;&#x8FD9;&#x4E2A;PID&#x5BF9;&#x7528;&#x6237;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;PID&#xFF0C;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#x90FD;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E8F;&#x5217;&#x53F7;&#x4ECE;0&#x5F00;&#x59CB;&#x5355;&#x8C03;&#x9012;&#x589E;&#x3002;&#x751F;&#x4EA7;&#x8005;&#x6BCF;&#x53D1;&#x9001;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x5C31;&#x4F1A;&#x5C06;<code>&lt;PID, &#x5206;&#x533A;&gt;</code>&#x5BF9;&#x5E94;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x503C;&#x52A0;1&#x3002;</p>
<p>Broker&#x7AEF;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4E3A;&#x6BCF;&#x4E00;&#x5BF9;&lt;PID, &#x5206;&#x533A;&gt;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;SN_old&#x3002;&#x9488;&#x5BF9;&#x751F;&#x4EA7;&#x8005;&#x53D1;&#x9001;&#x6765;&#x7684;&#x6BCF;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x5BF9;&#x5176;&#x5E8F;&#x5217;&#x53F7;SN_new&#x8FDB;&#x884C;&#x5224;&#x65AD;&#xFF0C;&#x5E76;&#x4F5C;&#x76F8;&#x5E94;&#x5904;&#x7406;&#x3002;</p>
<p>&#x53EA;&#x6709;SN_new&#x6BD4;SN_old&#x5927;1&#x65F6;&#xFF0C;&#x5373;SN_new = SN_old + 1&#x65F6;&#xFF0C;broker&#x624D;&#x4F1A;&#x63A5;&#x53D7;&#x8FD9;&#x6761;&#x6D88;&#x606F;&#xFF1B;</p>
<p>SN_new &lt; SN_old + 1&#xFF0C;&#x8BF4;&#x660E;&#x6D88;&#x606F;&#x88AB;&#x91CD;&#x590D;&#x5199;&#x5165;&#xFF0C;broker&#x76F4;&#x63A5;&#x4E22;&#x5F03;&#x8BE5;&#x6761;&#x6D88;&#x606F;&#xFF1B;</p>
<p>SN_new &gt; SN_old + 1&#xFF0C;&#x8BF4;&#x660E;&#x4E2D;&#x95F4;&#x6709;&#x6570;&#x636E;&#x5C1A;&#x672A;&#x5199;&#x5165;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x6D88;&#x606F;&#x4E71;&#x5E8F;&#xFF0C;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x751F;&#x4EA7;&#x8005;&#x4F1A;&#x629B;&#x51FA;OutOfOrderSequenceException&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x5E8F;&#x5217;&#x53F7;&#x9488;&#x5BF9;&lt;PID, &#x5206;&#x533A;&gt;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5E42;&#x7B49;&#x751F;&#x4EA7;&#x8005;&#x53EA;&#x80FD;&#x4FDD;&#x8BC1;&#x5355;&#x4E2A;&#x4E3B;&#x9898;&#x7684;&#x5355;&#x4E00;&#x5206;&#x533A;&#x5185;&#x6D88;&#x606F;&#x4E0D;&#x91CD;&#x590D;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x5B9E;&#x73B0;&#x5355;&#x4F1A;&#x8BDD;&#x4E0A;&#x7684;&#x5E42;&#x7B49;&#x6027;&#xFF0C;&#x4E0D;&#x80FD;&#x5B9E;&#x73B0;&#x8DE8;&#x4F1A;&#x8BDD;&#x7684;&#x5E42;&#x7B49;&#x6027;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x4F1A;&#x8BDD;&#x5373;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#xFF1A;Producer&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x3002;&#x5F53;&#x91CD;&#x542F;&#x4E86;Producer&#x8FDB;&#x7A0B;&#x4E4B;&#x540E;&#xFF0C;&#x5219;&#x5E42;&#x7B49;&#x6027;&#x4FDD;&#x8BC1;&#x5C31;&#x5931;&#x6548;&#x4E86;&#x3002;</p>
<p>&#x4E8B;&#x52A1;</p>
<p>&#x5E42;&#x7B49;&#x6027;&#x5E76;&#x4E0D;&#x80FD;&#x8DE8;&#x591A;&#x4E2A;&#x5206;&#x533A;&#x8FD0;&#x4F5C;&#xFF0C;&#x800C;Kafka&#x4E8B;&#x52A1;&#x5219;&#x53EF;&#x4EE5;&#x5F25;&#x8865;&#x8FD9;&#x4E2A;&#x7F3A;&#x9677;&#x3002;Kafka&#x4ECE;0.11&#x7248;&#x672C;&#x5F00;&#x59CB;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x4E8B;&#x52A1;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4E3B;&#x8981;&#x5728;read committed&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;&#x5B83;&#x80FD;&#x4FDD;&#x8BC1;&#x591A;&#x6761;&#x6D88;&#x606F;&#x539F;&#x5B50;&#x6027;&#x5730;&#x5199;&#x5165;&#x5230;&#x76EE;&#x6807;&#x5206;&#x533A;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x80FD;&#x5B9D;&#x6052;Consumer&#x53EA;&#x80FD;&#x770B;&#x5230;&#x4E8B;&#x52A1;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p>Producer&#x7AEF;&#x914D;&#x7F6E;</p>
<p>&#x4E8B;&#x52A1;&#x578B;Producer&#x80FD;&#x4FDD;&#x8BC1;&#x6D88;&#x606F;&#x539F;&#x5B50;&#x6027;&#x5730;&#x5199;&#x5165;&#x591A;&#x4E2A;&#x5206;&#x533A;&#x3002;&#x6279;&#x91CF;&#x7684;&#x6D88;&#x606F;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x5199;&#x5165;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x5931;&#x8D25;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x4E8B;&#x52A1;&#x578B;Producer&#x5728;&#x91CD;&#x542F;&#x540E;&#xFF0C;Kafka&#x4F9D;&#x7136;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x7684;&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#x5904;&#x7406;&#x3002;&#x5F00;&#x542F;&#x4E8B;&#x52A1;&#x578B;Producer&#x7684;&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x548C;&#x5E42;&#x7B49;&#x6027;Producer&#x4E00;&#x6837;&#xFF0C;&#x5F00;&#x542F;enable.idempotence = true&#x3002;</p>
<p>&#x8BBE;&#x7F6E;Producer&#x7AEF;&#x53C2;&#x6570;transcational.id&#x3002;&#x6700;&#x597D;&#x4E3A;&#x5176;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x540D;&#x5B57;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x4E86;&#x4E8B;&#x52A1;&#x578B;&#x7684;Producer&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x4E00;&#x4E9B;&#x4E8B;&#x52A1;API&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;initTransaction&#x3001;beginTransaction&#x3001;commitTransaction&#x548C;abortTransaction&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x4E8B;&#x52A1;&#x7684;&#x521D;&#x59CB;&#x5316;&#x3001;&#x4E8B;&#x52A1;&#x5F00;&#x542F;&#x3001;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x548C;&#x4E8B;&#x52A1;&#x7EC8;&#x6B62;&#x3002;</p>
<p>producer.initTransactions();<br>try {<br> producer.beginTransaction();<br>  producer.send(record1);<br>  producer.send(record2);<br>  producer.commitTransaction();<br>  }<br> catch (KafkaExecption e) {<br> producer.abortTransaction();<br> }<br>&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x4E8B;&#x52A1;&#x578B;Producer&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;record1&#x548C;record2&#x8981;&#x4E48;&#x5168;&#x90E8;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x5199;&#x5165;&#x5931;&#x8D25;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5373;&#x4F7F;&#x5199;&#x5165;&#x5931;&#x8D25;&#xFF0C;Kafka&#x4E5F;&#x4F1A;&#x5C06;&#x5B83;&#x4EEC;&#x5199;&#x5165;&#x5230;&#x5E95;&#x5C42;&#x7684;&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;Consumer&#x8FD8;&#x662F;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#xFF0C;&#x5177;&#x4F53;Consumer&#x7AEF;&#x8BFB;&#x53D6;&#x4E8B;&#x52A1;&#x578B;Producer&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x9700;&#x8981;&#x53E6;&#x884C;&#x914D;&#x7F6E;&#x3002;</p>
<p>Consumer&#x7AEF;&#x914D;&#x7F6E;<br>&#x8BFB;&#x53D6;&#x4E8B;&#x52A1;&#x578B;Producer&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x65F6;&#xFF0C;Consumer&#x7AEF;&#x7684;isolation.level&#x53C2;&#x6570;&#x8868;&#x5F81;&#x7740;&#x4E8B;&#x52A1;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x5373;&#x51B3;&#x5B9A;&#x4E86;Consumer&#x4EE5;&#x600E;&#x6837;&#x7684;&#x7EA7;&#x522B;&#x53BB;&#x8BFB;&#x53D6;&#x6D88;&#x606F;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x53D6;&#x503C;&#xFF1A; read_uncommitted&#xFF1A;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x8868;&#x9762;Consumer&#x80FD;&#x591F;&#x8BFB;&#x5230;Kafka&#x5199;&#x5165;&#x7684;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#xFF0C;&#x4E0D;&#x8BBA;&#x4E8B;&#x52A1;&#x578B;Producer&#x662F;&#x5426;&#x6B63;&#x5E38;&#x63D0;&#x4EA4;&#x4E86;&#x4E8B;&#x52A1;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x542F;&#x7528;&#x4E86;&#x4E8B;&#x52A1;&#x578B;&#x7684;Producer&#xFF0C;&#x5219;Consumer&#x7AEF;&#x53C2;&#x6570;&#x5C31;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x8BE5;&#x503C;&#xFF0C;&#x5426;&#x5219;&#x4E8B;&#x52A1;&#x662F;&#x65E0;&#x6548;&#x7684;&#x3002; read_committed&#xFF1A;&#x8868;&#x9762;Consumer&#x53EA;&#x4F1A;&#x8BFB;&#x53D6;&#x4E8B;&#x52A1;&#x578B;Producer&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x7684;&#x4E8B;&#x52A1;&#x4E2D;&#x5199;&#x5165;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x975E;&#x4E8B;&#x52A1;&#x578B;Producer&#x5199;&#x5165;&#x7684;&#x6240;&#x6709;&#x6D88;&#x606F;&#x5BF9;Consumer&#x4E5F;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;</p>
<p>&#x603B;&#x7ED3;<br>Kafka&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x6D88;&#x606F;&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#x6D88;&#x8D39;&#x7684;&#x624B;&#x6BB5;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;&#x5E42;&#x7B49;&#x6027;Producer&#x548C;&#x4E8B;&#x52A1;&#x578B;Producer&#x3002; &#x5E42;&#x7B49;&#x6027;Producer&#x53EA;&#x80FD;&#x4FDD;&#x8BC1;&#x5355;&#x4F1A;&#x8BDD;&#x3001;&#x5355;&#x5206;&#x533A;&#x4E0A;&#x7684;&#x6D88;&#x606F;&#x5E42;&#x7B49;&#x6027;&#xFF1B; &#x4E8B;&#x52A1;&#x578B;Producer&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x8DE8;&#x5206;&#x533A;&#x3001;&#x8DE8;&#x4F1A;&#x8BDD;&#x95F4;&#x7684;&#x5E42;&#x7B49;&#x6027;&#xFF1B; &#x4E8B;&#x52A1;&#x578B;Producer&#x529F;&#x80FD;&#x66F4;&#x4E3A;&#x5F3A;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x540C;&#x65F6;&#xFF0C;&#x5176;&#x6548;&#x7387;&#x4E5F;&#x4F1A;&#x6BD4;&#x8F83;&#x4F4E;&#x4E0B;&#x3002;</p>
 
      <!-- reward -->
      
    </div>
    

    <!-- copyright -->
    
    <footer class="article-footer">
       
  <ul class="article-tag-list" itemprop="keywords"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/kafka/" rel="tag">kafka</a></li></ul>

    </footer>
  </div>

   
  <nav class="article-nav">
    
      <a href="/2022/07/12/7E.103.%E4%B8%AD%E9%97%B4%E4%BB%B6%E7%B3%BB%E5%88%97%E4%B9%8Bkafka-Kafka%E6%98%AF%E9%9D%A0%E4%BB%80%E4%B9%88%E6%9C%BA%E5%88%B6%E4%BF%9D%E6%8C%81%E9%AB%98%E5%8F%AF%E9%9D%A0%EF%BC%8C%E9%AB%98%E5%8F%AF%E7%94%A8%E7%9A%84/" class="article-nav-link">
        <strong class="article-nav-caption">上一篇</strong>
        <div class="article-nav-title">
          
            中间件系列之kafka-Kafka是靠什么机制保持高可靠，高可用的
          
        </div>
      </a>
    
    
      <a href="/2022/07/12/7E.107.%E4%B8%AD%E9%97%B4%E4%BB%B6%E7%B3%BB%E5%88%97%E4%B9%8Bkafka-kafka%E5%A6%82%E4%BD%95%E4%BF%9D%E8%AF%81%E4%B8%8D%E9%87%8D%E5%A4%8D%E6%B6%88%E8%B4%B9/" class="article-nav-link">
        <strong class="article-nav-caption">下一篇</strong>
        <div class="article-nav-title">中间件系列之kafka-kafka如何保证不重复消费</div>
      </a>
    
  </nav>

  
   
    
    <script src="https://cdn.staticfile.org/twikoo/1.4.18/twikoo.all.min.js"></script>
    <div id="twikoo" class="twikoo"></div>
    <script>
        twikoo.init({
            envId: ""
        })
    </script>
 
</article>

</section>
      <footer class="footer">
  <div class="outer">
    <ul>
      <li>
        Copyrights &copy;
        2015-2023
        <i class="ri-heart-fill heart_icon"></i> xugang.xie
      </li>
    </ul>
    <ul>
      <li>
        
      </li>
    </ul>
    <ul>
      <li>
        
        
        <span>
  <span><i class="ri-user-3-fill"></i>访问人数:<span id="busuanzi_value_site_uv"></span></span>
  <span class="division">|</span>
  <span><i class="ri-eye-fill"></i>浏览次数:<span id="busuanzi_value_page_pv"></span></span>
</span>
        
      </li>
    </ul>
    <ul>
      
    </ul>
    <ul>
      
    </ul>
    <ul>
      <li>
        <!-- cnzz统计 -->
        
        <script type="text/javascript" src='https://s9.cnzz.com/z_stat.php?id=1278069914&amp;web_id=1278069914'></script>
        
      </li>
    </ul>
  </div>
</footer>    
    </main>
    <div class="float_btns">
      <div class="totop" id="totop">
  <i class="ri-arrow-up-line"></i>
</div>

<div class="todark" id="todark">
  <i class="ri-moon-line"></i>
</div>

    </div>
    <aside class="sidebar on">
      <button class="navbar-toggle"></button>
<nav class="navbar">
  
  <div class="logo">
    <a href="/"><img src="/images/ayer-side.svg" alt="xugang.xie&#39;s blog"></a>
  </div>
  
  <ul class="nav nav-main">
    
    <li class="nav-item">
      <a class="nav-item-link" href="/">主页</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/archives">归档</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/categories">分类</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/tags">标签</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/friends">友链</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/about">关于我</a>
    </li>
    
  </ul>
</nav>
<nav class="navbar navbar-bottom">
  <ul class="nav">
    <li class="nav-item">
      
      <a class="nav-item-link nav-item-search"  title="搜索">
        <i class="ri-search-line"></i>
      </a>
      
      
      <a class="nav-item-link" target="_blank" href="/atom.xml" title="RSS Feed">
        <i class="ri-rss-line"></i>
      </a>
      
    </li>
  </ul>
</nav>
<div class="search-form-wrap">
  <div class="local-search local-search-plugin">
  <input type="search" id="local-search-input" class="local-search-input" placeholder="Search...">
  <div id="local-search-result" class="local-search-result"></div>
</div>
</div>
    </aside>
    <div id="mask"></div>

<!-- #reward -->
<div id="reward">
  <span class="close"><i class="ri-close-line"></i></span>
  <p class="reward-p"><i class="ri-cup-line"></i>请我喝杯咖啡吧~</p>
  <div class="reward-box">
    
    <div class="reward-item">
      <img class="reward-img" src="/images/alipay.jpg">
      <span class="reward-type">支付宝</span>
    </div>
    
    
    <div class="reward-item">
      <img class="reward-img" src="/images/wechat.jpg">
      <span class="reward-type">微信</span>
    </div>
    
  </div>
</div>
    
<script src="/js/jquery-3.6.0.min.js"></script>
 
<script src="/js/lazyload.min.js"></script>

<!-- Tocbot -->
 
<script src="/js/tocbot.min.js"></script>

<script>
  tocbot.init({
    tocSelector: ".tocbot",
    contentSelector: ".article-entry",
    headingSelector: "h1, h2, h3, h4, h5, h6",
    hasInnerContainers: true,
    scrollSmooth: true,
    scrollContainer: "main",
    positionFixedSelector: ".tocbot",
    positionFixedClass: "is-position-fixed",
    fixedSidebarOffset: "auto",
  });
</script>

<script src="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.js"></script>
<link
  rel="stylesheet"
  href="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.css"
/>
<script src="https://cdn.staticfile.org/justifiedGallery/3.8.1/js/jquery.justifiedGallery.min.js"></script>

<script src="/dist/main.js"></script>

<!-- ImageViewer -->
 <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                        <div class="pswp__preloader__cut">
                            <div class="pswp__preloader__donut"></div>
                        </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div>
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>

<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.css">
<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/default-skin/default-skin.min.css">
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.js"></script>
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe-ui-default.min.js"></script>

<script>
    function viewer_init() {
        let pswpElement = document.querySelectorAll('.pswp')[0];
        let $imgArr = document.querySelectorAll(('.article-entry img:not(.reward-img)'))

        $imgArr.forEach(($em, i) => {
            $em.onclick = () => {
                // slider展开状态
                // todo: 这样不好，后面改成状态
                if (document.querySelector('.left-col.show')) return
                let items = []
                $imgArr.forEach(($em2, i2) => {
                    let img = $em2.getAttribute('data-idx', i2)
                    let src = $em2.getAttribute('data-target') || $em2.getAttribute('src')
                    let title = $em2.getAttribute('alt')
                    // 获得原图尺寸
                    const image = new Image()
                    image.src = src
                    items.push({
                        src: src,
                        w: image.width || $em2.width,
                        h: image.height || $em2.height,
                        title: title
                    })
                })
                var gallery = new PhotoSwipe(pswpElement, PhotoSwipeUI_Default, items, {
                    index: parseInt(i)
                });
                gallery.init()
            }
        })
    }
    viewer_init()
</script> 
<!-- MathJax -->

<!-- Katex -->

<!-- busuanzi  -->
 
<script src="/js/busuanzi-2.3.pure.min.js"></script>
 
<!-- ClickLove -->

<!-- ClickBoom1 -->

<!-- ClickBoom2 -->

<!-- CodeCopy -->
 
<link rel="stylesheet" href="/css/clipboard.css">
 <script src="https://cdn.staticfile.org/clipboard.js/2.0.10/clipboard.min.js"></script>
<script>
  function wait(callback, seconds) {
    var timelag = null;
    timelag = window.setTimeout(callback, seconds);
  }
  !function (e, t, a) {
    var initCopyCode = function(){
      var copyHtml = '';
      copyHtml += '<button class="btn-copy" data-clipboard-snippet="">';
      copyHtml += '<i class="ri-file-copy-2-line"></i><span>COPY</span>';
      copyHtml += '</button>';
      $(".highlight .code pre").before(copyHtml);
      $(".article pre code").before(copyHtml);
      var clipboard = new ClipboardJS('.btn-copy', {
        target: function(trigger) {
          return trigger.nextElementSibling;
        }
      });
      clipboard.on('success', function(e) {
        let $btn = $(e.trigger);
        $btn.addClass('copied');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-checkbox-circle-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPIED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-checkbox-circle-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
      clipboard.on('error', function(e) {
        e.clearSelection();
        let $btn = $(e.trigger);
        $btn.addClass('copy-failed');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-time-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPY FAILED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-time-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
    }
    initCopyCode();
  }(window, document);
</script>
 
<!-- CanvasBackground -->

<script>
  if (window.mermaid) {
    mermaid.initialize({ theme: "forest" });
  }
</script>


    
    

  </div>
</body>

</html>