<!DOCTYPE html>


<html lang="zh-CN">
  

    <head>
      <meta charset="utf-8" />
        
      <meta
        name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1"
      />
      <title>GC-Shenadoah收集器 |  xugang.xie&#39;s blog</title>
  <meta name="generator" content="hexo-theme-ayer">
      
      <link rel="shortcut icon" href="/favicon.ico" />
       
<link rel="stylesheet" href="/dist/main.css">

      
<link rel="stylesheet" href="/css/fonts/remixicon.css">

      
<link rel="stylesheet" href="/css/custom.css">
 
      <script src="https://cdn.staticfile.org/pace/1.2.4/pace.min.js"></script>
       
 

      <link
        rel="stylesheet"
        href="https://cdn.jsdelivr.net/npm/@sweetalert2/theme-bulma@5.0.1/bulma.min.css"
      />
      <script src="https://cdn.jsdelivr.net/npm/sweetalert2@11.0.19/dist/sweetalert2.min.js"></script>

      <!-- mermaid -->
      
      <style>
        .swal2-styled.swal2-confirm {
          font-size: 1.6rem;
        }
      </style>
    <link rel="alternate" href="/atom.xml" title="xugang.xie's blog" type="application/atom+xml">
</head>
  </html>
</html>


<body>
  <div id="app">
    
      
    <main class="content on">
      <section class="outer">
  <article
  id="post-4.008.GC-Shenadoah收集器"
  class="article article-type-post"
  itemscope
  itemprop="blogPost"
  data-scroll-reveal
>
  <div class="article-inner">
    
    <header class="article-header">
       
<h1 class="article-title sea-center" style="border-left:0" itemprop="name">
  GC-Shenadoah收集器
</h1>
 

      
    </header>
     
    <div class="article-meta">
      <a href="/2022/05/12/4.008.GC-Shenadoah%E6%94%B6%E9%9B%86%E5%99%A8/" class="article-date">
  <time datetime="2022-05-11T16:00:00.000Z" itemprop="datePublished">2022-05-12</time>
</a> 
  <div class="article-category">
    <a class="article-category-link" href="/categories/GC/">GC</a>
  </div>
  
<div class="word_count">
    <span class="post-time">
        <span class="post-meta-item-icon">
            <i class="ri-quill-pen-line"></i>
            <span class="post-meta-item-text"> 字数统计:</span>
            <span class="post-count">5.9k</span>
        </span>
    </span>

    <span class="post-time">
        &nbsp; | &nbsp;
        <span class="post-meta-item-icon">
            <i class="ri-book-open-line"></i>
            <span class="post-meta-item-text"> 阅读时长≈</span>
            <span class="post-count">36 分钟</span>
        </span>
    </span>
</div>
 
    </div>
      



  
    <div class="article-entry" itemprop="articleBody">
       
  <blockquote>
<p><a target="_blank" rel="noopener" href="http://codefun007.xyz/a/article_detail/911.htm">http://codefun007.xyz/a/article_detail/911.htm</a><br><a target="_blank" rel="noopener" href="http://openjdk.java.net/projects/shenandoah/">http://openjdk.java.net/projects/shenandoah/</a></p>
</blockquote>
<span id="more"></span>
<p>Shenandoah is an ultra-low pause time garbage collector that reduces GC pause times<br>by performing more garbage collection work concurrently with the running Java program.<br>CMS and G1 both perform concurrent marking of live objects.<br>Shenandoah adds concurrent compaction.</p>
<p>&#x6700;&#x5F00;&#x59CB;&#x7531;RedHat&#x516C;&#x53F8;&#x72EC;&#x7ACB;&#x53D1;&#x5C55;&#x540E;&#x6765;&#x8D21;&#x732E;&#x7ED9;&#x4E86;OpenJDK&#xFF0C;&#x76F8;&#x6BD4;G1&#x4E3B;&#x8981;&#x6539;&#x8FDB;&#x70B9;&#x5728;&#x4E8E;</p>
<p>&#x652F;&#x6301;&#x5E76;&#x53D1;&#x7684;&#x6574;&#x7406;&#x7B97;&#x6CD5;&#xFF0C;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x53EF;&#x4EE5;&#x548C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;</p>
<p>Shenandoah &#x76EE;&#x524D;&#x4E0D;&#x4F7F;&#x7528;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#xFF0C;&#x6CA1;&#x6709;&#x533A;&#x5206; &#x5E74;&#x8F7B;&#x4EE3; &#x548C; &#x8001;&#x5E74;&#x4EE3;</p>
<p>Shenandoah &#x6452;&#x5F03;&#x4E86;&#x5728;G1&#x4E2D;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x548C;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x53BB;&#x7EF4;&#x62A4;&#x7684;&#x8BB0;&#x5FC6;&#x96C6;&#xFF0C;<br>&#x6539;&#x7528; &#x8FDE;&#x63A5;&#x77E9;&#x9635;&#xFF08;Connection Matrix&#xFF09;&#x7684;&#x5168;&#x5C40;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x8BB0;&#x5F55;&#x8DE8;Region&#x7684;&#x5F15;&#x7528;&#x5173;&#x7CFB;&#xFF0C;<br>&#x964D;&#x4F4E;&#x4E86;&#x5904;&#x7406;&#x8DE8;&#x4EE3;&#x6307;&#x9488;&#x65F6;&#x7684;&#x8BB0;&#x5FC6;&#x96C6;&#x7EF4;&#x62A4;&#x6D88;&#x8017;&#xFF0C;&#x4E5F;&#x964D;&#x4F4E;&#x4E86;&#x4F2A;&#x5171;&#x4EAB;&#x95EE;&#x9898;&#x7684;&#x53D1;&#x751F;&#x6982;&#x7387;&#x3002;</p>
<p>&#x521D;&#x59CB;&#x6807;&#x8BB0;&#xFF08;Initial Marking&#xFF09;<br>&#x4E0E;G1&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x6807;&#x8BB0;&#x4E0E;GC Roots&#x76F4;&#x63A5;&#x5173;&#x8054;&#x7684;&#x5BF9;&#x8C61;&#xFF0C; &#x505C;&#x987F;&#x65F6;&#x95F4;&#x4E0E;&#x5806;&#x5927;&#x5C0F;&#x65E0;&#x5173;&#xFF0C;&#x53EA;&#x4E0E;GC Roots&#x7684;&#x6570;&#x91CF;&#x76F8;&#x5173;&#x3002;</p>
<p>&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#xFF08;Concurrent Marking&#xFF09;<br>&#x4E0E;G1&#x4E00;&#x6837;&#xFF0C;&#x4ECE;GC Root&#x5F00;&#x59CB;&#x5BF9;&#x5806;&#x4E2D;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x53EF;&#x8FBE;&#x6027;&#x5206;&#x6790;&#xFF0C;&#x627E;&#x51FA;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x4E0E;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x8017;&#x65F6;&#x53D6;&#x51B3;&#x4E8E;&#x5806;&#x4E2D;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x91CF;&#x548C;&#x5BF9;&#x8C61;&#x56FE;&#x7684;&#x7ED3;&#x6784;&#x590D;&#x6742;&#x5EA6;</p>
<p>&#x6700;&#x7EC8;&#x6807;&#x8BB0;&#xFF08;Final Marking&#xFF09;<br>&#x4E0E;G1&#x4E00;&#x6837;&#xFF0C;&#x5904;&#x7406;&#x5269;&#x4F59;&#x7684;SATB&#x626B;&#x63CF;&#xFF0C;&#x5E76;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7EDF;&#x8BA1;&#x51FA;&#x56DE;&#x6536;&#x4EF7;&#x503C;&#x6700;&#x9AD8;&#x7684;Region&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;Region&#x6784;&#x6210;&#x4E00;&#x7EC4;&#x56DE;&#x6536;&#x96C6;&#xFF08;Collection Set&#xFF09;</p>
<p>&#x5E76;&#x53D1;&#x6E05;&#x7406;&#xFF08;Concurrent Cleanup&#xFF09;<br>&#x7528;&#x4E8E;&#x6E05;&#x7406; &#x6574;&#x4E2A;&#x533A;&#x57DF;&#x5185;&#x8FDE;&#x4E00;&#x4E2A;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x90FD;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x7684;Region&#xFF08;Immediate Garbage Region&#xFF09;</p>
<p>&#x5E76;&#x53D1;&#x56DE;&#x6536;&#xFF08;Concurrent Evacuation&#xFF09;<br>&#x9996;&#x5148;&#x628A;&#x56DE;&#x6536;&#x96C6;&#x91CC;&#x9762;&#x7684;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5148;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x5230;&#x5176;&#x4ED6;&#x672A;&#x88AB;&#x4F7F;&#x7528;&#x7684;Region&#x4E4B;&#x4E2D;&#xFF0C;<br>&#x7136;&#x540E;&#x901A;&#x8FC7; &#x8BFB;&#x5C4F;&#x969C; &#x548C; Brooks Pointers&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x6280;&#x672F; &#x6765;&#x89E3;&#x51B3;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x671F;&#x95F4;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x7EE7;&#x7EED;&#x8BFB;&#x5199;&#x88AB;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x7684;&#x95EE;&#x9898;&#xFF0C;<br>&#x8017;&#x65F6;&#x53D6;&#x51B3;&#x4E8E;&#x56DE;&#x6536;&#x96C6;&#x7684;&#x5927;&#x5C0F;</p>
<p>&#x521D;&#x59CB;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#xFF08;Initial Update Reference&#xFF09;<br>&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x5806;&#x4E2D;&#x6240;&#x6709;&#x6307;&#x5411;&#x65E7;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x4FEE;&#x6B63;&#x5230;&#x590D;&#x5236;&#x540E;&#x7684;&#x65B0;&#x5730;&#x5740;&#x3002;<br>&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x7684;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x672A;&#x505A;&#x4EC0;&#x4E48;&#x5177;&#x4F53;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x8BBE;&#x7ACB;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x96C6;&#x5408;&#x70B9;&#xFF0C;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#x6536;&#x96C6;&#x5668;&#x7EBF;&#x7A0B;&#x90FD;&#x5DF2;&#x5B8C;&#x6210;&#x5206;&#x914D;&#x7ED9;&#x5B83;&#x4EEC;&#x7684;&#x5BF9;&#x8C61;&#x79FB;&#x52A8;&#x4EFB;&#x52A1;&#x800C;&#x5DF2;&#x3002;<br>&#x521D;&#x59CB;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x65F6;&#x95F4;&#x5F88;&#x77ED;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x77ED;&#x6682;&#x7684;&#x505C;&#x987F;&#x3002;</p>
<p>&#x5E76;&#x53D1;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#xFF08;Concurrent Update Reference&#xFF09;<br>&#x771F;&#x6B63;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x4E0E;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4E00;&#x8D77;&#x5E76;&#x53D1;&#x7684;&#xFF0C;&#x65F6;&#x95F4;&#x957F;&#x77ED;&#x53D6;&#x51B3;&#x4E8E;&#x5185;&#x5B58;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x5F15;&#x7528;&#x6570;&#x91CF;&#x7684;&#x591A;&#x5C11;&#x3002;<br>&#x5E76;&#x53D1;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x4E0E;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x6CBF;&#x7740;&#x5BF9;&#x8C61;&#x56FE;&#x6765;&#x641C;&#x7D22;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x6309;&#x7167;&#x5185;&#x5B58;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x7EBF;&#x6027;&#x5730;&#x641C;&#x7D22;&#x51FA;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x628A;&#x65E7;&#x503C;&#x6539;&#x4E3A;&#x65B0;&#x503C;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#xFF08;Final Update Reference&#xFF09;<br>&#x89E3;&#x51B3;&#x4E86;&#x5806;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x540E;&#xFF0C;&#x8FD8;&#x8981;&#x4FEE;&#x6B63;&#x5B58;&#x5728;&#x4E8E;GCRoots&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x3002;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x77ED;&#x6682;&#x7684;&#x505C;&#x987F;&#xFF0C;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x53EA;&#x4E0E;GC Roots&#x7684;&#x6570;&#x91CF;&#x76F8;&#x5173;&#x3002;</p>
<p>&#x5E76;&#x53D1;&#x6E05;&#x7406;&#xFF08;Concurrent Cleanup&#xFF09;<br>&#x7ECF;&#x8FC7;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x548C;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x4E4B;&#x540E;&#xFF0C;&#x6574;&#x4E2A;&#x56DE;&#x6536;&#x96C6;&#x4E2D;&#x6240;&#x6709;&#x7684;Region&#x5DF2;&#x65E0;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#x5E76;&#x53D1;&#x6E05;&#x7406;&#x8FC7;&#x7A0B;&#x6765;&#x56DE;&#x6536;&#x8FD9;&#x4E9B;Region&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;</p>
<p>&#x8FDE;&#x63A5;&#x77E9;&#x9635;<br>&#x8FDE;&#x63A5;&#x77E9;&#x9635;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x5F20;&#x4E8C;&#x7EF4;&#x8868;&#x683C;&#xFF0C;&#x5982;&#x679C;Region N&#x6709;&#x5BF9;&#x8C61;&#x6307;&#x5411;RegionM&#xFF0C;&#x5C31;&#x5728;&#x8868;&#x683C;&#x7684;N&#x884C;M&#x5217;&#x4E2D;&#x6253;&#x4E0A;&#x4E00;&#x4E2A;&#x6807;&#x8BB0;&#xFF0C;<br>&#x5982;&#x679C;Region 5&#x4E2D;&#x7684;&#x5BF9;&#x8C61;Baz&#x5F15;&#x7528;&#x4E86;Region 3&#x7684;Foo&#xFF0C;Foo&#x53C8;&#x5F15;&#x7528;&#x4E86;Region 1&#x7684;Bar&#xFF0C;&#x90A3;&#x8FDE;&#x63A5;&#x77E9;&#x9635;&#x4E2D;&#x7684;5&#x884C;3&#x5217;&#x3001;3&#x884C;1&#x5217;&#x4F1A;&#x88AB;&#x6253;&#x4E0A;&#x6807;&#x8BB0;&#x3002;<br>&#x5728;&#x56DE;&#x6536;&#x65F6;&#x901A;&#x8FC7;&#x8FD9;&#x5F20;&#x8868;&#x683C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x54EA;&#x4E9B;Region&#x4E4B;&#x95F4;&#x4EA7;&#x751F;&#x4E86;&#x8DE8;&#x4EE3;&#x5F15;&#x7528;&#x3002;</p>
<p>Brooks Pointer &#x8F6C;&#x53D1;&#x6307;&#x9488;&#x6280;&#x672F;<br>&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x5982;&#x679C;&#x5C06;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x51BB;&#x7ED3;&#x8D77;&#x6765;&#x518D;&#x505A;&#x90A3;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4E24;&#x8005;&#x5FC5;&#x987B;&#x8981;&#x540C;&#x65F6;&#x5E76;&#x53D1;&#x8FDB;&#x884C;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x3002;<br>&#x5176;&#x56F0;&#x96BE;&#x70B9;&#x662F;&#x5728;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x4E0D;&#x505C;&#x5BF9;&#x88AB;&#x79FB;&#x52A8;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x8BBF;&#x95EE;&#xFF0C;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x884C;&#x4E3A;&#xFF0C;<br>&#x4F46;&#x79FB;&#x52A8;&#x4E4B;&#x540E;&#x6574;&#x4E2A;&#x5185;&#x5B58;&#x4E2D;&#x6240;&#x6709;&#x6307;&#x5411;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x90FD;&#x8FD8;&#x662F;&#x65E7;&#x5BF9;&#x8C61;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5F88;&#x96BE;&#x4E00;&#x77AC;&#x95F4;&#x5168;&#x90E8;&#x6539;&#x8FC7;&#x6765;&#x3002;</p>
<p>Brooks Pointer &#x8F6C;&#x53D1;&#x6307;&#x9488;&#x6280;&#x672F;  &#x5BF9;&#x8C61;&#x79FB;&#x52A8;&#x4E0E;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x8BFB;&#x5199;&#x5BF9;&#x8C61;</p>
<p>Brooks &#x5728;&#x539F;&#x6709;&#x5BF9;&#x8C61;&#x5E03;&#x5C40;&#x7ED3;&#x6784;&#x7684;&#x6700;&#x524D;&#x9762;&#x7EDF;&#x4E00;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F15;&#x7528;&#x5B57;&#x6BB5;&#xFF0C;&#x5728;&#x6B63;&#x5E38;&#x4E0D;&#x5904;&#x4E8E;&#x5E76;&#x53D1;&#x79FB;&#x52A8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BE5;&#x5F15;&#x7528;&#x6307;&#x5411;&#x5BF9;&#x8C61;&#x81EA;&#x5DF1;<br>&#x5728;&#x5BF9;&#x8C61;&#x79FB;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5C06;Brooks Pointer &#x6307;&#x5411;&#x65B0;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EA;&#x901A;&#x4E00;&#x6761;mov&#x6307;&#x4EE4;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5BF9;&#x65B0;&#x5BF9;&#x8C61;&#x7684;&#x8BBF;&#x95EE;</p>
<p>&#x5199;&#x64CD;&#x4F5C;  CAS&#xFF08;Compare And Swap&#xFF09;  GC&#x7EBF;&#x7A0B; &#x548C; &#x7528;&#x6237;&#x7EBF;&#x7A0B;  </p>
<p>&#x4F18;&#x70B9; &#x5EF6;&#x8FDF;&#x4F4E;</p>
<p>&#x7F3A;&#x70B9;<br>&#x9AD8;&#x8FD0;&#x884C;&#x8D1F;&#x62C5;&#x4F7F;&#x5F97;&#x541E;&#x5410;&#x91CF;&#x4E0B;&#x964D;&#xFF1B;&#x4F7F;&#x7528;&#x5927;&#x91CF;&#x7684;&#x8BFB;&#x5199;&#x5C4F;&#x969C;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8BFB;&#x5C4F;&#x969C;&#xFF0C;&#x589E;&#x5927;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x5F00;&#x9500;&#xFF1B;</p>
<hr>
<blockquote>
<p><a target="_blank" rel="noopener" href="https://lanlan2017.github.io/JavaReadingNotes/9da7cb3e/">https://lanlan2017.github.io/JavaReadingNotes/9da7cb3e/</a></p>
</blockquote>
<p>&#x5728;&#x672C;&#x4E66;&#x6240;&#x51FA;&#x73B0;&#x7684;&#x4F17;&#x591A;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x91CC;&#xFF0C;Shenandoah&#x5927;&#x6982;&#x662F;&#x6700;&#x201C;&#x5B64;&#x72EC;&#x201D;&#x7684;&#x4E00;&#x4E2A;&#x3002;&#x73B0;&#x4EE3;&#x793E;&#x4F1A;&#x7ADE;&#x4E89;&#x6FC0;&#x70C8;&#xFF0C;&#x8FDE;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x91CC;&#x4E0D;&#x540C;&#x56E2;&#x961F;&#x4E4B;&#x95F4;&#x90FD;&#x5B58;&#x5728;&#x201C;&#x90E8;&#x95E8;&#x5899;&#x201D;&#xFF0C;&#x90A3;Shenandoah&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x6B3E;&#x4E0D;&#x7531;Oracle&#xFF08;&#x5305;&#x62EC;&#x4EE5;&#x524D;&#x7684;Sun&#xFF09;&#x516C;&#x53F8;&#x7684;&#x865A;&#x62DF;&#x673A;&#x56E2;&#x961F;&#x6240;&#x9886;&#x5BFC;&#x5F00;&#x53D1;&#x7684;HotSpot&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x4F1A;&#x53D7;&#x5230;&#x4E00;&#x4E9B;&#x6765;&#x81EA;&#x201C;&#x5B98;&#x65B9;&#x201D;&#x7684;&#x6392;&#x6324;&#x3002;&#x5728;&#x7B14;&#x8005;&#x64B0;&#x5199;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x65F6;[^1]&#xFF0C;Oracle&#x4ECD;&#x660E;&#x786E;&#x62D2;&#x7EDD;&#x5728;OracleJDK 12&#x4E2D;&#x652F;&#x6301;Shenandoah&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5E76;&#x6267;&#x610F;&#x5728;&#x6253;&#x5305;OracleJDK&#x65F6;&#x901A;&#x8FC7;&#x6761;&#x4EF6;&#x7F16;&#x8BD1;&#x5B8C;&#x5168;&#x6392;&#x9664;&#x6389;&#x4E86;Shenandoah&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;Shenandoah&#x662F;&#x4E00;&#x6B3E;&#x53EA;&#x6709;OpenJDK&#x624D;&#x4F1A;&#x5305;&#x542B;&#xFF0C;&#x800C;OracleJDK&#x91CC;&#x53CD;&#x800C;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x201C;&#x514D;&#x8D39;&#x5F00;&#x6E90;&#x7248;&#x201D;&#x6BD4;&#x201C;&#x6536;&#x8D39;&#x5546;&#x4E1A;&#x7248;&#x201D;&#x529F;&#x80FD;&#x66F4;&#x591A;&#xFF0C;&#x8FD9;&#x662F;&#x76F8;&#x5BF9;&#x7F55;&#x89C1;&#x7684;&#x72B6;&#x51B5;[^2]&#x3002;&#x5982;&#x679C;&#x8BFB;&#x8005;&#x7684;&#x9879;&#x76EE;&#x8981;&#x6C42;&#x7528;&#x5230;Oracle&#x5546;&#x4E1A;&#x652F;&#x6301;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x628A;Shenandoah&#x6392;&#x9664;&#x5728;&#x9009;&#x62E9;&#x8303;&#x56F4;&#x4E4B;&#x5916;&#x4E86;&#x3002;</p>
<p>&#x6700;&#x521D;Shenandoah&#x662F;&#x7531;RedHat&#x516C;&#x53F8;&#x72EC;&#x7ACB;&#x53D1;&#x5C55;&#x7684;&#x65B0;&#x578B;&#x6536;&#x96C6;&#x5668;&#x9879;&#x76EE;&#xFF0C;&#x5728;2014&#x5E74;RedHat&#x628A;Shenandoah&#x8D21;&#x732E;&#x7ED9;&#x4E86;OpenJDK&#xFF0C;&#x5E76;&#x63A8;&#x52A8;&#x5B83;&#x6210;&#x4E3A;OpenJDK 12&#x7684;&#x6B63;&#x5F0F;&#x7279;&#x6027;&#x4E4B;&#x4E00;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x540E;&#x6765;&#x7684;JEP 189&#x3002;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5B9E;&#x73B0;&#x4E00;&#x79CD;&#x80FD;&#x5728;&#x4EFB;&#x4F55;&#x5806;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x4E0B;&#x90FD;&#x53EF;&#x4EE5;&#x628A;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x9650;&#x5236;&#x5728;&#x5341;&#x6BEB;&#x79D2;&#x4EE5;&#x5185;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x8BE5;&#x76EE;&#x6807;&#x610F;&#x5473;&#x7740;&#x76F8;&#x6BD4;CMS&#x548C;G1&#xFF0C;Shenandoah&#x4E0D;&#x4EC5;&#x8981;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x7684;&#x5783;&#x573E;&#x6807;&#x8BB0;&#xFF0C;&#x8FD8;&#x8981;&#x5E76;&#x53D1;&#x5730;&#x8FDB;&#x884C;&#x5BF9;&#x8C61;&#x6E05;&#x7406;&#x540E;&#x7684;&#x6574;&#x7406;&#x52A8;&#x4F5C;&#x3002;</p>
<p>&#x4ECE;&#x4EE3;&#x7801;&#x5386;&#x53F2;&#x6E0A;&#x6E90;&#x4E0A;&#x8BB2;&#xFF0C;&#x6BD4;&#x8D77;&#x7A0D;&#x540E;&#x8981;&#x4ECB;&#x7ECD;&#x7684;&#x6709;&#x7740;Oracle&#x6B63;&#x6714;&#x8840;&#x7EDF;&#x7684;ZGC&#xFF0C;Shenandoah&#x53CD;&#x800C;&#x66F4;&#x50CF;&#x662F;G1 &#x7684;&#x4E0B;&#x4E00;&#x4EE3;&#x7EE7;&#x627F;&#x8005;&#xFF0C;&#x5B83;&#x4EEC;&#x4E24;&#x8005;&#x6709;&#x7740;&#x76F8;&#x4F3C;&#x7684;&#x5806;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#xFF0C;&#x5728;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x3001;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x7B49;&#x8BB8;&#x591A;&#x9636;&#x6BB5;&#x7684;&#x5904;&#x7406;&#x601D;&#x8DEF;&#x4E0A;&#x90FD;&#x9AD8;&#x5EA6;&#x4E00;&#x81F4;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x76F4;&#x63A5;&#x5171;&#x4EAB;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x90E8;&#x5206;&#x5BF9;G1&#x7684;&#x6253;&#x78E8;&#x6539;&#x8FDB;&#x548C;Bug&#x4FEE;&#x6539;&#x4F1A;&#x540C;&#x65F6;&#x53CD;&#x6620;&#x5728;Shenandoah&#x4E4B;&#x4E0A;&#xFF0C;&#x800C;&#x7531;&#x4E8E;Shenandoah&#x52A0;&#x5165;&#x6240;&#x5E26;&#x6765;&#x7684;&#x4E00;&#x4E9B;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x4E5F;&#x6709;&#x90E8;&#x5206;&#x4F1A;&#x51FA;&#x73B0;&#x5728;G1&#x6536;&#x96C6;&#x5668;&#x4E2D;&#xFF0C;&#x8B6C;&#x5982;&#x5728;&#x5E76;&#x53D1;&#x5931;&#x8D25;&#x540E;&#x4F5C;&#x4E3A;&#x201C;&#x9003;&#x751F;&#x95E8;&#x201D;&#x7684;Full GC[^3]&#xFF0C;G1&#x5C31;&#x662F;&#x7531;&#x4E8E;&#x5408;&#x5E76;&#x4E86;Shenandoah&#x7684;&#x4EE3;&#x7801;&#x624D;&#x83B7;&#x5F97;&#x591A;&#x7EBF;&#x7A0B;Full GC&#x7684;&#x652F;&#x6301;&#x3002;</p>
<p>&#x90A3;Shenandoah&#x76F8;&#x6BD4;&#x8D77;G1&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x6539;&#x8FDB;&#x5462;&#xFF1F;&#x867D;&#x7136;Shenandoah&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;Region&#x7684;&#x5806;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#xFF0C;&#x540C;&#x6837;&#x6709;&#x7740;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x5927;&#x5BF9;&#x8C61;&#x7684;Humongous Region&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x56DE;&#x6536;&#x7B56;&#x7565;&#x4E5F;&#x540C;&#x6837;&#x662F;&#x4F18;&#x5148;&#x5904;&#x7406;&#x56DE;&#x6536;&#x4EF7;&#x503C;&#x6700;&#x5927;&#x7684;Region&#x2026;&#x2026;&#x4F46;&#x5728;&#x7BA1;&#x7406;&#x5806;&#x5185;&#x5B58;&#x65B9;&#x9762;&#xFF0C;&#x5B83;&#x4E0E;G1&#x81F3;&#x5C11;&#x6709;&#x4E09;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5F53;&#x7136;&#x662F;&#x652F;&#x6301;&#x5E76;&#x53D1;&#x7684;&#x6574;&#x7406;&#x7B97;&#x6CD5;&#xFF0C;G1&#x7684;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x662F;&#x53EF;&#x4EE5;&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5374;&#x4E0D;&#x80FD;&#x4E0E;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#xFF0C;&#x8FD9;&#x70B9;&#x4F5C;&#x4E3A;Shenandoah&#x6700;&#x6838;&#x5FC3;&#x7684;&#x529F;&#x80FD;&#x7A0D;&#x540E;&#x7B14;&#x8005;&#x4F1A;&#x7740;&#x91CD;&#x8BB2;&#x89E3;&#x3002;&#x5176;&#x6B21;&#xFF0C;Shenandoah&#xFF08;&#x76EE;&#x524D;&#xFF09;&#x662F;&#x9ED8;&#x8BA4;&#x4E0D;&#x4F7F;&#x7528;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x7684;&#xFF0C;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x4E0D;&#x4F1A;&#x6709;&#x4E13;&#x95E8;&#x7684;&#x65B0;&#x751F;&#x4EE3;Region&#x6216;&#x8005;&#x8001;&#x5E74;&#x4EE3;Region&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x5206;&#x4EE3;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x5206;&#x4EE3;&#x5BF9;Shenandoah&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#xFF0C; &#x8FD9;&#x66F4;&#x591A;&#x662F;&#x51FA;&#x4E8E;&#x6027;&#x4EF7;&#x6BD4;&#x7684;&#x6743;&#x8861;&#xFF0C;&#x57FA;&#x4E8E;&#x5DE5;&#x4F5C;&#x91CF;&#x4E0A;&#x7684;&#x8003;&#x8651;&#x800C;&#x5C06;&#x5176;&#x653E;&#x5230;&#x4F18;&#x5148;&#x7EA7;&#x8F83;&#x4F4E;&#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x3002;&#x6700;&#x540E;&#xFF0C; Shenandoah&#x6452;&#x5F03;&#x4E86;&#x5728;G1&#x4E2D;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x548C;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x53BB;&#x7EF4;&#x62A4;&#x7684;&#x8BB0;&#x5FC6;&#x96C6;&#xFF0C;&#x6539;&#x7528;&#x540D;&#x4E3A;&#x201C;&#x8FDE;&#x63A5;&#x77E9;&#x9635;&#x201D;&#xFF08;Connection Matrix&#xFF09;&#x7684;&#x5168;&#x5C40;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x8BB0;&#x5F55;&#x8DE8;Region&#x7684;&#x5F15;&#x7528;&#x5173;&#x7CFB;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x5904;&#x7406;&#x8DE8;&#x4EE3;&#x6307;&#x9488;&#x65F6;&#x7684;&#x8BB0;&#x5FC6;&#x96C6;&#x7EF4;&#x62A4;&#x6D88;&#x8017;&#xFF0C;&#x4E5F;&#x964D;&#x4F4E;&#x4E86;&#x4F2A;&#x5171;&#x4EAB;&#x95EE;&#x9898;&#xFF08;&#x89C1;3.4.4&#x8282;&#xFF09;&#x7684;&#x53D1;&#x751F;&#x6982;&#x7387;&#x3002;&#x8FDE;&#x63A5;&#x77E9;&#x9635;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x5F20;&#x4E8C;&#x7EF4;&#x8868;&#x683C;&#xFF0C;&#x5982;&#x679C;Region N&#x6709;&#x5BF9;&#x8C61;&#x6307;&#x5411;Region M&#xFF0C;&#x5C31;&#x5728;&#x8868;&#x683C;&#x7684;N&#x884C;M&#x5217;&#x4E2D;&#x6253;&#x4E0A;&#x4E00;&#x4E2A;&#x6807;&#x8BB0;&#xFF0C;&#x5982;&#x56FE;3-15&#x6240;&#x793A;&#xFF0C;&#x5982;&#x679C;Region 5&#x4E2D;&#x7684;&#x5BF9;&#x8C61;Baz &#x5F15;&#x7528;&#x4E86;Region 3&#x7684;Foo&#xFF0C;Foo&#x53C8;&#x5F15;&#x7528;&#x4E86;Region 1&#x7684;Bar&#xFF0C;&#x90A3;&#x8FDE;&#x63A5;&#x77E9;&#x9635;&#x4E2D;&#x7684;5&#x884C;3&#x5217;&#x3001;3&#x884C;1&#x5217;&#x5C31;&#x5E94;&#x8BE5;&#x88AB;&#x6253;&#x4E0A;&#x6807;&#x8BB0;&#x3002;&#x5728;&#x56DE;&#x6536;&#x65F6;&#x901A;&#x8FC7;&#x8FD9;&#x5F20;&#x8868;&#x683C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x54EA;&#x4E9B;Region&#x4E4B;&#x95F4;&#x4EA7;&#x751F;&#x4E86;&#x8DE8;&#x4EE3;&#x5F15;&#x7528;&#x3002;</p>
<p>Shenandoah&#x6536;&#x96C6;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#x5927;&#x81F4;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x4E5D;&#x4E2A;&#x9636;&#x6BB5;&#xFF08;&#x6B64;&#x5904;&#x4EE5;Shenandoah&#x5728;2016&#x5E74;&#x53D1;&#x8868;&#x7684;&#x539F;&#x59CB;&#x8BBA;&#x6587;[^4]&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;&#x5728;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;Shenandoah 2.0&#x4E2D;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x5F3A;&#x5316;&#x4E86;&#x201C;&#x90E8;&#x5206;&#x6536;&#x96C6;&#x201D;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x4E4B;&#x524D;&#x8FD8;&#x6709;Initial Partial&#x3001;Concurrent Partial&#x548C;Final Partial&#x9636;&#x6BB5;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4E0D;&#x592A;&#x4E25;&#x8C28;&#x5730;&#x7406;&#x89E3;&#x4E3A;&#x5BF9;&#x5E94;&#x4E8E;&#x4EE5;&#x524D;&#x5206;&#x4EE3;&#x6536;&#x96C6;&#x4E2D;&#x7684;Minor GC&#x7684;&#x5DE5;&#x4F5C;&#xFF09;&#xFF1A;</p>
<p><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/4.008.GC-Shenadoah%E6%94%B6%E9%9B%86%E5%99%A8/1.png"></p>
<p>&#x56FE;3-15 Shenandoah&#x6536;&#x96C6;&#x5668;&#x7684;&#x8FDE;&#x63A5;&#x77E9;&#x9635;&#x793A;&#x610F;&#x56FE;</p>
<ul>
<li>&#x521D;&#x59CB;&#x6807;&#x8BB0;&#xFF08;Initial Marking&#xFF09;&#xFF1A;&#x4E0E;G1&#x4E00;&#x6837;&#xFF0C;&#x9996;&#x5148;&#x6807;&#x8BB0;&#x4E0E;GC Roots&#x76F4;&#x63A5;&#x5173;&#x8054;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4ECD;&#x662F;&#x201C;Stop The World&#x201D;&#x7684;&#xFF0C;&#x4F46;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x4E0E;&#x5806;&#x5927;&#x5C0F;&#x65E0;&#x5173;&#xFF0C;&#x53EA;&#x4E0E;GC Roots&#x7684;&#x6570;&#x91CF;&#x76F8;&#x5173;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#xFF08;Concurrent Marking&#xFF09;&#xFF1A;&#x4E0E;G1&#x4E00;&#x6837;&#xFF0C;&#x904D;&#x5386;&#x5BF9;&#x8C61;&#x56FE;&#xFF0C;&#x6807;&#x8BB0;&#x51FA;&#x5168;&#x90E8;&#x53EF;&#x8FBE;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x4E0E;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4E00;&#x8D77;&#x5E76;&#x53D1;&#x7684;&#xFF0C;&#x65F6;&#x95F4;&#x957F;&#x77ED;&#x53D6;&#x51B3;&#x4E8E;&#x5806;&#x4E2D;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x91CF;&#x4EE5;&#x53CA;&#x5BF9;&#x8C61;&#x56FE;&#x7684;&#x7ED3;&#x6784;&#x590D;&#x6742;&#x7A0B;&#x5EA6;&#x3002;</li>
<li>&#x6700;&#x7EC8;&#x6807;&#x8BB0;&#xFF08;Final Marking&#xFF09;&#xFF1A;&#x4E0E;G1&#x4E00;&#x6837;&#xFF0C;&#x5904;&#x7406;&#x5269;&#x4F59;&#x7684;SATB&#x626B;&#x63CF;&#xFF0C;&#x5E76;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7EDF;&#x8BA1;&#x51FA;&#x56DE;&#x6536;&#x4EF7;&#x503C;&#x6700;&#x9AD8;&#x7684;Region&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;Region&#x6784;&#x6210;&#x4E00;&#x7EC4;&#x56DE;&#x6536;&#x96C6;&#xFF08;Collection Set&#xFF09;&#x3002;&#x6700;&#x7EC8;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x5C0F;&#x6BB5;&#x77ED;&#x6682;&#x7684;&#x505C;&#x987F;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x6E05;&#x7406;&#xFF08;Concurrent Cleanup&#xFF09;&#xFF1A;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7528;&#x4E8E;&#x6E05;&#x7406;&#x90A3;&#x4E9B;&#x6574;&#x4E2A;&#x533A;&#x57DF;&#x5185;&#x8FDE;&#x4E00;&#x4E2A;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x90FD;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x7684;Region&#xFF08;&#x8FD9;&#x7C7B;Region&#x88AB;&#x79F0;&#x4E3A;Immediate Garbage Region&#xFF09;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x56DE;&#x6536;&#xFF08;Concurrent Evacuation&#xFF09;&#xFF1A;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x662F;Shenandoah&#x4E0E;&#x4E4B;&#x524D;HotSpot&#x4E2D;&#x5176;&#x4ED6;&#x6536;&#x96C6;&#x5668;&#x7684;&#x6838;&#x5FC3;&#x5DEE;&#x5F02;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;Shenandoah&#x8981;&#x628A;&#x56DE;&#x6536;&#x96C6;&#x91CC;&#x9762;&#x7684;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5148;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x5230;&#x5176;&#x4ED6;&#x672A;&#x88AB;&#x4F7F;&#x7528;&#x7684;Region&#x4E4B;&#x4E2D;&#x3002;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x5982;&#x679C;&#x5C06;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x51BB;&#x7ED3;&#x8D77;&#x6765;&#x518D;&#x505A;&#x90A3;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4E24;&#x8005;&#x5FC5;&#x987B;&#x8981;&#x540C;&#x65F6;&#x5E76;&#x53D1;&#x8FDB;&#x884C;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x5176;&#x56F0;&#x96BE;&#x70B9;&#x662F;&#x5728;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x4E0D;&#x505C;&#x5BF9;&#x88AB;&#x79FB;&#x52A8;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x8BBF;&#x95EE;&#xFF0C;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x79FB;&#x52A8;&#x4E4B;&#x540E;&#x6574;&#x4E2A;&#x5185;&#x5B58;&#x4E2D;&#x6240;&#x6709;&#x6307;&#x5411;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x90FD;&#x8FD8;&#x662F;&#x65E7;&#x5BF9;&#x8C61;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x96BE;&#x4E00;&#x77AC;&#x95F4;&#x5168;&#x90E8;&#x6539;&#x53D8;&#x8FC7;&#x6765;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x9047;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x56F0;&#x96BE;&#xFF0C;Shenandoah&#x5C06;&#x4F1A;&#x901A;&#x8FC7;&#x8BFB;&#x5C4F;&#x969C;&#x548C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;Brooks Pointers&#x201D;&#x7684;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x6765;&#x89E3;&#x51B3;&#xFF08;&#x8BB2;&#x89E3;&#x5B8C;Shenandoah&#x6574;&#x4E2A;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E4B;&#x540E;&#x7B14;&#x8005;&#x8FD8;&#x8981;&#x518D;&#x56DE;&#x5934;&#x4ECB;&#x7ECD;&#x5B83;&#xFF09;&#x3002;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x77ED;&#x53D6;&#x51B3;&#x4E8E;&#x56DE;&#x6536;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#x3002;</li>
<li>&#x521D;&#x59CB;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#xFF08;Initial Update Reference&#xFF09;&#xFF1A;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x628A;&#x5806;&#x4E2D;&#x6240;&#x6709;&#x6307;&#x5411;&#x65E7;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x4FEE;&#x6B63;&#x5230;&#x590D;&#x5236;&#x540E;&#x7684;&#x65B0;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x79F0;&#x4E3A;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x3002;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x7684;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x672A;&#x505A;&#x4EC0;&#x4E48;&#x5177;&#x4F53;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x8BBE;&#x7ACB;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x96C6;&#x5408;&#x70B9;&#xFF0C;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#x6536;&#x96C6;&#x5668;&#x7EBF;&#x7A0B;&#x90FD;&#x5DF2;&#x5B8C;&#x6210;&#x5206;&#x914D;&#x7ED9;&#x5B83;&#x4EEC;&#x7684;&#x5BF9;&#x8C61;&#x79FB;&#x52A8;&#x4EFB;&#x52A1;&#x800C;&#x5DF2;&#x3002;&#x521D;&#x59CB;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x65F6;&#x95F4;&#x5F88;&#x77ED;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x77ED;&#x6682;&#x7684;&#x505C;&#x987F;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#xFF08;Concurrent Update Reference&#xFF09;&#xFF1A;&#x771F;&#x6B63;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x662F;&#x4E0E;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x4E00;&#x8D77;&#x5E76;&#x53D1;&#x7684;&#xFF0C;&#x65F6;&#x95F4;&#x957F;&#x77ED;&#x53D6;&#x51B3;&#x4E8E;&#x5185;&#x5B58;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x5F15;&#x7528;&#x6570;&#x91CF;&#x7684;&#x591A;&#x5C11;&#x3002;&#x5E76;&#x53D1;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x4E0E;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x6CBF;&#x7740;&#x5BF9;&#x8C61;&#x56FE;&#x6765;&#x641C;&#x7D22;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x6309;&#x7167;&#x5185;&#x5B58;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x7EBF;&#x6027;&#x5730;&#x641C;&#x7D22;&#x51FA;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x628A;&#x65E7;&#x503C;&#x6539;&#x4E3A;&#x65B0;&#x503C;&#x5373;&#x53EF;&#x3002;</li>
<li>&#x6700;&#x7EC8;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#xFF08;Final Update Reference&#xFF09;&#xFF1A;&#x89E3;&#x51B3;&#x4E86;&#x5806;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x540E;&#xFF0C;&#x8FD8;&#x8981;&#x4FEE;&#x6B63;&#x5B58;&#x5728;&#x4E8E;GC Roots &#x4E2D;&#x7684;&#x5F15;&#x7528;&#x3002;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x662F;Shenandoah&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x505C;&#x987F;&#xFF0C;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x53EA;&#x4E0E;GC Roots&#x7684;&#x6570;&#x91CF;&#x76F8;&#x5173;&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x6E05;&#x7406;&#xFF08;Concurrent Cleanup&#xFF09;&#xFF1A;&#x7ECF;&#x8FC7;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x548C;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x4E4B;&#x540E;&#xFF0C;&#x6574;&#x4E2A;&#x56DE;&#x6536;&#x96C6;&#x4E2D;&#x6240;&#x6709;&#x7684;Region&#x5DF2;&#x518D;&#x65E0;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E9B;Region&#x90FD;&#x53D8;&#x6210;Immediate Garbage Regions&#x4E86;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#x5E76;&#x53D1;&#x6E05;&#x7406;&#x8FC7;&#x7A0B;&#x6765;&#x56DE;&#x6536;&#x8FD9;&#x4E9B;Region&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4F9B;&#x4EE5;&#x540E;&#x65B0;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x4F7F;&#x7528;&#x3002;</li>
</ul>
<p>&#x4EE5;&#x4E0A;&#x5BF9;Shenandoah&#x6536;&#x96C6;&#x5668;&#x8FD9;&#x4E5D;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#x7684;&#x63CF;&#x8FF0;&#x53EF;&#x80FD;&#x62C6;&#x5206;&#x5F97;&#x7565;&#x4E3A;&#x7410;&#x788E;&#xFF0C;&#x8BFB;&#x8005;&#x53EA;&#x8981;&#x6293;&#x4F4F;&#x5176;&#x4E2D;&#x4E09;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5E76;&#x53D1;&#x9636;&#x6BB5;&#xFF08;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x3001;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x3001;&#x5E76;&#x53D1;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#xFF09;&#xFF0C;&#x5C31;&#x80FD;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7406;&#x6E05;Shenandoah&#x662F;&#x5982;&#x4F55;&#x8FD0;&#x4F5C;&#x7684;&#x4E86;&#x3002;&#x56FE;3-16[^5]&#x4E2D;&#x9EC4;&#x8272;&#x7684;&#x533A;&#x57DF;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x88AB;&#x9009;&#x5165;&#x56DE;&#x6536;&#x96C6;&#x7684;Region&#xFF0C;&#x7EFF;&#x8272;&#x90E8;&#x5206;&#x5C31;&#x4EE3;&#x8868;&#x8FD8;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x84DD;&#x8272;&#x5C31;&#x662F;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;Region&#x4E86;&#x3002;&#x56FE;3-16&#x4E2D;&#x4E0D;&#x4EC5;&#x5C55;&#x793A;&#x4E86;Shenandoah&#x4E09;&#x4E2A;&#x5E76;&#x53D1;&#x9636;&#x6BB5;&#x7684;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD8;&#x80FD;&#x5F62;&#x8C61;&#x5730;&#x8868;&#x793A;&#x51FA;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x5982;&#x4F55;&#x627E;&#x51FA;&#x56DE;&#x6536;&#x5BF9;&#x8C61;&#x786E;&#x5B9A;&#x56DE;&#x6536;&#x96C6;&#xFF0C;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x9636;&#x6BB5;&#x5982;&#x4F55;&#x79FB;&#x52A8;&#x56DE;&#x6536;&#x96C6;&#x4E2D;&#x7684;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x53D1;&#x5F15;&#x7528;&#x66F4;&#x65B0;&#x9636;&#x6BB5;&#x5982;&#x4F55;&#x5C06;&#x6307;&#x5411;&#x56DE;&#x6536;&#x96C6;&#x4E2D;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x6240;&#x6709;&#x5F15;&#x7528;&#x5168;&#x90E8;&#x4FEE;&#x6B63;&#xFF0C;&#x6B64;&#x540E;&#x56DE;&#x6536;&#x96C6;&#x4FBF;&#x4E0D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x5F15;&#x7528;&#x53EF;&#x8FBE;&#x7684;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x4E86;&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/4.008.GC-Shenadoah%E6%94%B6%E9%9B%86%E5%99%A8/2.png"></p>
<p>&#x56FE;3-16 Shenandoah&#x6536;&#x96C6;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;</p>
<p>&#x5B66;&#x4E60;&#x4E86;Shenandoah&#x6536;&#x96C6;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x804A;&#x4E00;&#x4E0B;Shenandoah&#x7528;&#x4EE5;&#x652F;&#x6301;&#x5E76;&#x884C;&#x6574;&#x7406;&#x7684;&#x6838;&#x5FC3;&#x6982;&#x5FF5;&#x2014;&#x2014;Brooks Pointer&#x3002;&#x201C;Brooks&#x201D;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#x3002;1984&#x5E74;&#xFF0C;Rodney A.Brooks&#x5728;&#x8BBA;&#x6587;&#x300A;Trading Data Space for Reduced Time and Code Space in Real-Time Garbage Collection on Stock Hardware&#x300B;&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x4F7F;&#x7528;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#xFF08;Forwarding Pointer&#xFF0C;&#x4E5F;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;Indirection Pointer&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x5BF9;&#x8C61;&#x79FB;&#x52A8;&#x4E0E;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x7684;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x6B64;&#x524D;&#xFF0C;&#x8981;&#x505A;&#x7C7B;&#x4F3C;&#x7684;&#x5E76;&#x53D1;&#x64CD;&#x4F5C;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5728;&#x88AB;&#x79FB;&#x52A8;&#x5BF9;&#x8C61;&#x539F;&#x6709;&#x7684;&#x5185;&#x5B58;&#x4E0A;&#x8BBE;&#x7F6E;&#x4FDD;&#x62A4;&#x9677;&#x9631;&#xFF08;Memory Protection Trap&#xFF09;&#xFF0C;&#x4E00;&#x65E6;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x5230;&#x5F52;&#x5C5E;&#x4E8E;&#x65E7;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x81EA;&#x9677;&#x4E2D;&#x6BB5;&#xFF0C;&#x8FDB;&#x5165;&#x9884;&#x8BBE;&#x597D;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5668;&#x4E2D;&#xFF0C;&#x518D;&#x7531;&#x5176;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x628A;&#x8BBF;&#x95EE;&#x8F6C;&#x53D1;&#x5230;&#x590D;&#x5236;&#x540E;&#x7684;&#x65B0;&#x5BF9;&#x8C61;&#x4E0A;&#x3002;&#x867D;&#x7136;&#x786E;&#x5B9E;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x5BF9;&#x8C61;&#x79FB;&#x52A8;&#x4E0E;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C42;&#x9762;&#x7684;&#x76F4;&#x63A5;&#x652F;&#x6301;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x5C06;&#x5BFC;&#x81F4;&#x7528;&#x6237;&#x6001;&#x9891;&#x7E41;&#x5207;&#x6362;&#x5230;&#x6838;&#x5FC3;&#x6001;[^6]&#xFF0C; &#x4EE3;&#x4EF7;&#x662F;&#x975E;&#x5E38;&#x5927;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x9891;&#x7E41;&#x4F7F;&#x7528;[^7]&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/4.008.GC-Shenadoah%E6%94%B6%E9%9B%86%E5%99%A8/3.png"></p>
<p>&#x56FE;3-17 Brooks Pointers&#x793A;&#x610F;&#x56FE;&#xFF08;&#x4E00;&#xFF09;</p>
<p>Brooks&#x63D0;&#x51FA;&#x7684;&#x65B0;&#x65B9;&#x6848;&#x4E0D;&#x9700;&#x8981;&#x7528;&#x5230;&#x5185;&#x5B58;&#x4FDD;&#x62A4;&#x9677;&#x9631;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x539F;&#x6709;&#x5BF9;&#x8C61;&#x5E03;&#x5C40;&#x7ED3;&#x6784;&#x7684;&#x6700;&#x524D;&#x9762;&#x7EDF;&#x4E00;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F15;&#x7528;&#x5B57;&#x6BB5;&#xFF0C;&#x5728;&#x6B63;&#x5E38;&#x4E0D;&#x5904;&#x4E8E;&#x5E76;&#x53D1;&#x79FB;&#x52A8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BE5;&#x5F15;&#x7528;&#x6307;&#x5411;&#x5BF9;&#x8C61;&#x81EA;&#x5DF1;&#xFF0C;&#x5982;&#x56FE;3-17&#x6240;&#x793A;&#x3002;</p>
<p>&#x4ECE;&#x7ED3;&#x6784;&#x4E0A;&#x6765;&#x770B;&#xFF0C;Brooks&#x63D0;&#x51FA;&#x7684;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x4E0E;&#x67D0;&#x4E9B;&#x65E9;&#x671F;Java&#x865A;&#x62DF;&#x673A;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x53E5;&#x67C4;&#x5B9A;&#x4F4D;&#xFF08;&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#x8BE6;&#x89C1;&#x7B2C;2&#x7AE0;&#xFF09;&#x6709;&#x4E00;&#x4E9B;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x4E00;&#x79CD;&#x95F4;&#x63A5;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x65B9;&#x5F0F;&#xFF0C;&#x5DEE;&#x522B;&#x662F;&#x53E5;&#x67C4;&#x901A;&#x5E38;&#x4F1A;&#x7EDF;&#x4E00;&#x5B58;&#x50A8;&#x5728;&#x4E13;&#x95E8;&#x7684;&#x53E5;&#x67C4;&#x6C60;&#x4E2D;&#xFF0C;&#x800C;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x662F;&#x5206;&#x6563;&#x5B58;&#x653E;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5934;&#x524D;&#x9762;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x4E4B;&#x540E;&#xFF0C;&#x6709;&#x4F55;&#x6536;&#x76CA;&#x6682;&#x4E14;&#x4E0D;&#x8BBA;&#xFF0C;&#x6240;&#x6709;&#x95F4;&#x63A5;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x6280;&#x672F;&#x7684;&#x7F3A;&#x70B9;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x663E;&#x8457;&#x7684;&#x2014;&#x2014;&#x6BCF;&#x6B21;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x6B21;&#x989D;&#x5916;&#x7684;&#x8F6C;&#x5411;&#x5F00;&#x9500;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E2A;&#x5F00;&#x9500;&#x5DF2;&#x7ECF;&#x88AB;&#x4F18;&#x5316;&#x5230;&#x53EA;&#x6709;&#x4E00;&#x884C;&#x6C47;&#x7F16;&#x6307;&#x4EE4;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x8B6C;&#x5982;&#x4EE5;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>mov r13,QWORD PTR [r12+r14*8-0x8]<br>&#x4E0D;&#x8FC7;&#xFF0C;&#x6BD5;&#x7ADF;&#x5BF9;&#x8C61;&#x5B9A;&#x4F4D;&#x4F1A;&#x88AB;&#x9891;&#x7E41;&#x4F7F;&#x7528;&#x5230;&#xFF0C;&#x8FD9;&#x4ECD;&#x662F;&#x4E00;&#x7B14;&#x4E0D;&#x53EF;&#x5FFD;&#x89C6;&#x7684;&#x6267;&#x884C;&#x6210;&#x672C;&#xFF0C;&#x53EA;&#x662F;&#x5B83;&#x6BD4;&#x8D77;&#x5185;&#x5B58;&#x4FDD;&#x62A4;&#x9677;&#x9631;&#x7684;&#x65B9;&#x6848;&#x5DF2;&#x7ECF;&#x597D;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x52A0;&#x5165;&#x540E;&#x5E26;&#x6765;&#x7684;&#x6536;&#x76CA;&#x81EA;&#x7136;&#x662F;&#x5F53;&#x5BF9;&#x8C61;&#x62E5;&#x6709;&#x4E86;&#x4E00;&#x4EFD;&#x65B0;&#x7684;&#x526F;&#x672C;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x4E00;&#x5904;&#x6307;&#x9488;&#x7684;&#x503C;&#xFF0C;&#x5373;&#x65E7;&#x5BF9;&#x8C61;&#x4E0A;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x7684;&#x5F15;&#x7528;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F7F;&#x5176;&#x6307;&#x5411;&#x65B0;&#x5BF9;&#x8C61;&#xFF0C;&#x4FBF;&#x53EF;&#x5C06;&#x6240;&#x6709;&#x5BF9;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x8BBF;&#x95EE;&#x8F6C;&#x53D1;&#x5230;&#x65B0;&#x7684;&#x526F;&#x672C;&#x4E0A;&#x3002;&#x8FD9;&#x6837;&#x53EA;&#x8981;&#x65E7;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x672A;&#x88AB;&#x6E05;&#x7406;&#x6389;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x5185;&#x5B58;&#x4E2D;&#x6240;&#x6709;&#x901A;&#x8FC7;&#x65E7;&#x5F15;&#x7528;&#x5730;&#x5740;&#x8BBF;&#x95EE;&#x7684;&#x4EE3;&#x7801;&#x4FBF;&#x4ECD;&#x7136;&#x53EF;&#x7528;&#xFF0C;&#x90FD;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x8F6C;&#x53D1;&#x5230;&#x65B0;&#x5BF9;&#x8C61;&#x4E0A;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x56FE;3-18&#x6240;&#x793A;&#x3002;</p>
<p>1&#xFF09;&#x6536;&#x96C6;&#x5668;&#x7EBF;&#x7A0B;&#x590D;&#x5236;&#x4E86;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x526F;&#x672C;&#xFF1B;<br>2&#xFF09;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x66F4;&#x65B0;&#x5BF9;&#x8C61;&#x7684;&#x67D0;&#x4E2A;&#x5B57;&#x6BB5;&#xFF1B;<br>3&#xFF09;&#x6536;&#x96C6;&#x5668;&#x7EBF;&#x7A0B;&#x66F4;&#x65B0;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x7684;&#x5F15;&#x7528;&#x503C;&#x4E3A;&#x65B0;&#x526F;&#x672C;&#x5730;&#x5740;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x4FDD;&#x62A4;&#x63AA;&#x65BD;&#xFF0C;&#x8BA9;&#x4E8B;&#x4EF6;2&#x5728;&#x4E8B;&#x4EF6;1&#x3001;&#x4E8B;&#x4EF6;3&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x8BDD;&#xFF0C;&#x5C06;&#x5BFC;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x53D8;&#x66F4;&#x53D1;&#x751F;&#x5728;&#x65E7;&#x5BF9;&#x8C61;&#x4E0A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x5FC5;&#x987B;&#x9488;&#x5BF9;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x7684;&#x8BBF;&#x95EE;&#x64CD;&#x4F5C;&#x91C7;&#x53D6;&#x540C;&#x6B65;&#x63AA;&#x65BD;&#xFF0C;&#x8BA9;&#x6536;&#x96C6;&#x5668;&#x7EBF;&#x7A0B;&#x6216;&#x8005;<br>&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x5BF9;&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x7684;&#x8BBF;&#x95EE;&#x53EA;&#x6709;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x80FD;&#x591F;&#x6210;&#x529F;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#xFF0C;&#x907F;&#x514D;&#x4E24;&#x8005;&#x4EA4;&#x66FF;&#x8FDB;&#x884C;&#x3002;&#x5B9E;&#x9645;&#x4E0A;Shenandoah&#x6536;&#x96C6;&#x5668;&#x662F;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#x5E76;&#x4EA4;&#x6362;&#xFF08;Compare And Swap&#xFF0C;CAS&#xFF09;&#x64CD;&#x4F5C;[^8]&#x6765;&#x4FDD;&#x8BC1;&#x5E76;&#x53D1;&#x65F6;&#x5BF9;&#x8C61;&#x7684;&#x8BBF;&#x95EE;&#x6B63;&#x786E;&#x6027;&#x7684;&#x3002;</p>
<p>&#x8F6C;&#x53D1;&#x6307;&#x9488;&#x53E6;&#x4E00;&#x70B9;&#x5FC5;&#x987B;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x6267;&#x884C;&#x9891;&#x7387;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C3D;&#x7BA1;&#x901A;&#x8FC7;&#x5BF9;&#x8C61;&#x5934;&#x4E0A;&#x7684;Brooks Pointer&#x6765;&#x4FDD;&#x8BC1;&#x5E76;&#x53D1;&#x65F6;&#x539F;&#x5BF9;&#x8C61;&#x4E0E;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x7684;&#x8BBF;&#x95EE;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x53EA;&#x4ECE;&#x539F;&#x7406;&#x4E0A;&#x770B;&#x662F;&#x4E0D;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x201C;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x201D;&#x8FD9;&#x56DB;&#x4E2A;&#x5B57;&#x7684;&#x5206;&#x91CF;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x95E8;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x8BFB;&#x53D6;&#x3001;&#x5199;&#x5165;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x6BD4;&#x8F83;&#xFF0C;&#x4E3A;&#x5BF9;&#x8C61;&#x54C8;&#x5E0C;&#x503C;&#x8BA1;&#x7B97;&#xFF0C;&#x7528;&#x5BF9;&#x8C61;&#x52A0;&#x9501;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x90FD;&#x5C5E;&#x4E8E;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x7684;&#x8303;&#x7574;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x6BD4;&#x6BD4;&#x7686;&#x662F;&#xFF0C;&#x8981;&#x8986;&#x76D6;&#x5168;&#x90E8;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x64CD;&#x4F5C;&#xFF0C;Shenandoah&#x4E0D;&#x5F97;&#x4E0D;&#x540C;&#x65F6;&#x8BBE;&#x7F6E;&#x8BFB;&#x3001;&#x5199;&#x5C4F;&#x969C;&#x53BB;&#x62E6;&#x622A;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x4ECB;&#x7ECD;&#x5176;&#x4ED6;&#x6536;&#x96C6;&#x5668;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x7528;&#x4E8E;&#x7EF4;&#x62A4;&#x5361;&#x8868;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x5E76;&#x53D1;&#x6807;&#x8BB0;&#xFF0C;&#x5199;&#x5C4F;&#x969C;&#x5DF2;&#x88AB;&#x4F7F;&#x7528;&#x591A;&#x6B21;&#xFF0C;&#x7D2F;&#x79EF;&#x4E86;&#x4E0D;&#x5C11;&#x7684;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x5199;&#x5C4F;&#x969C;&#x6709;&#x76F8;&#x5F53;&#x4E00;&#x90E8;&#x5206;&#x5728;Shenandoah&#x6536;&#x96C6;&#x5668;&#x4E2D;&#x4F9D;&#x7136;&#x8981;&#x88AB;&#x4F7F;&#x7528;&#x5230;&#x3002;&#x9664;&#x6B64;&#x4EE5;&#x5916;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;Brooks Pointer&#xFF0C;Shenandoah&#x5728;&#x8BFB;&#x3001;&#x5199;&#x5C4F;&#x969C;&#x4E2D;&#x90FD;&#x52A0;&#x5165;&#x4E86;&#x989D;&#x5916;&#x7684;&#x8F6C;&#x53D1;&#x5904;&#x7406;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4F7F;&#x7528;&#x8BFB;&#x5C4F;&#x969C;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x8FD9;&#x662F;&#x6BD4;&#x5199;&#x5C4F;&#x969C;&#x66F4;&#x5927;&#x7684;&#x3002;&#x4EE3;&#x7801;&#x91CC;&#x5BF9;&#x8C61;&#x8BFB;&#x53D6;&#x7684;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x8981;&#x6BD4;&#x5BF9;&#x8C61;&#x5199;&#x5165;&#x7684;&#x9891;&#x7387;&#x9AD8;&#x51FA;&#x5F88;&#x591A;&#xFF0C;&#x8BFB;&#x5C4F;&#x969C;&#x6570;&#x91CF;&#x81EA;&#x7136;&#x4E5F;&#x8981;&#x6BD4;&#x5199;&#x5C4F;&#x969C;&#x591A;&#x5F97;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x8BFB;&#x5C4F;&#x969C;&#x7684;&#x4F7F;&#x7528;&#x5FC5;&#x987B;&#x66F4;&#x52A0;&#x8C28;&#x614E;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x4EFB;&#x4F55;&#x7684;&#x91CD;&#x91CF;&#x7EA7;&#x64CD;&#x4F5C;&#x3002; Shenandoah&#x662F;&#x672C;&#x4E66;&#x4E2D;&#x7B2C;&#x4E00;&#x6B3E;&#x4F7F;&#x7528;&#x5230;&#x8BFB;&#x5C4F;&#x969C;&#x7684;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5B83;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4E5F;&#x610F;&#x8BC6;&#x5230;&#x6570;&#x91CF;&#x5E9E;&#x5927;&#x7684;&#x8BFB;&#x5C4F;&#x969C;&#x5E26;&#x6765;&#x7684;&#x6027;&#x80FD;&#x5F00;&#x9500;&#x4F1A;&#x662F;Shenandoah&#x88AB;&#x8BDF;&#x75C5;&#x7684;&#x5173;&#x952E;&#x70B9;&#x4E4B;&#x4E00;[^9]&#xFF0C;&#x6240;&#x4EE5;&#x8BA1;&#x5212;&#x5728;JDK 13&#x4E2D;&#x5C06;Shenandoah&#x7684;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6A21;&#x578B;&#x6539;&#x8FDB;&#x4E3A;&#x57FA;&#x4E8E;&#x5F15;&#x7528;&#x8BBF;&#x95EE;&#x5C4F;&#x969C;&#xFF08;Load Reference Barrier&#xFF09;[^10]&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x8C13;&#x201C;&#x5F15;&#x7528;&#x8BBF;&#x95EE;&#x5C4F;&#x969C;&#x201D;&#x662F;&#x6307;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x53EA;&#x62E6;&#x622A;&#x5BF9;&#x8C61;&#x4E2D;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E3A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x53BB;&#x7BA1;&#x539F;&#x751F;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7B49;&#x5176;&#x4ED6;&#x975E;&#x5F15;&#x7528;&#x5B57;&#x6BB5;&#x7684;&#x8BFB;&#x5199;&#xFF0C;&#x8FD9;&#x80FD;&#x591F;&#x7701;&#x53BB;&#x5927;&#x91CF;&#x5BF9;&#x539F;&#x751F;&#x7C7B;&#x578B;&#x3001;&#x5BF9;&#x8C61;&#x6BD4;&#x8F83;&#x3001;&#x5BF9;&#x8C61;&#x52A0;&#x9501;&#x7B49;&#x573A;&#x666F;&#x4E2D;&#x8BBE;&#x7F6E;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6240;&#x5E26;&#x6765;&#x7684;&#x6D88;&#x8017;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6765;&#x8C08;&#x8C08;Shenandoah&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x6027;&#x80FD;&#x8868;&#x73B0;&#xFF0C;Shenandoah&#x7684;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7B2C;&#x4E09;&#x65B9;&#x6D4B;&#x8BD5;&#x8005;&#x5728;&#x7F51;&#x4E0A;&#x90FD;&#x516C;&#x5E03;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x6D4B;&#x8BD5;&#xFF0C;&#x7ED3;&#x679C;&#x5404;&#x6709;&#x5DEE;&#x5F02;&#x3002;&#x7B14;&#x8005;&#x5728;&#x6B64;&#x9009;&#x62E9;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4EFD;RedHat&#x5B98;&#x65B9;&#x5728;2016&#x5E74;&#x6240;&#x53D1;&#x8868;&#x7684;Shenandoah&#x5B9E;&#x73B0;&#x8BBA;&#x6587;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x5E94;&#x7528;&#x5B9E;&#x6D4B;&#x6570;&#x636E;&#xFF0C;&#x6D4B;&#x8BD5;&#x5185;&#x5BB9;&#x662F;&#x4F7F;&#x7528;ElasticSearch&#x5BF9;200GB&#x7684;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7D22;&#x5F15;[^11]&#xFF0C;&#x5982;&#x8868;3-2&#x6240;&#x793A;&#x3002;&#x4ECE;&#x7ED3;&#x679C;&#x6765;&#x770B;&#xFF0C;&#x5E94;&#x8BE5;&#x8BF4;2016&#x5E74;&#x505A;&#x8BE5;&#x6D4B;&#x8BD5;&#x65F6;&#x7684;Shenandoah&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x8FBE;&#x6210;&#x9884;&#x5B9A;&#x76EE;&#x6807;&#xFF0C;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x6BD4;&#x5176;&#x4ED6;&#x51E0;&#x6B3E;&#x6536;&#x96C6;&#x5668;&#x786E;&#x5B9E;&#x6709;&#x4E86;&#x8D28;&#x7684;&#x98DE;&#x8DC3;&#xFF0C;&#x4F46;&#x4E5F;&#x5E76;&#x672A;&#x5B9E;&#x73B0;&#x6700;&#x5927;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x63A7;&#x5236;&#x5728;&#x5341;&#x6BEB;&#x79D2;&#x4EE5;&#x5185;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x800C;&#x541E;&#x5410;&#x91CF;&#x65B9;&#x9762;&#x5219;&#x51FA;&#x73B0;&#x4E86;&#x5F88;&#x660E;&#x663E;&#x7684;&#x4E0B;&#x964D;&#xFF0C;&#x5176;&#x603B;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x662F;&#x6240;&#x6709;&#x6D4B;&#x8BD5;&#x6536;&#x96C6;&#x5668;&#x4E2D;&#x6700;&#x957F;&#x7684;&#x3002;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E2A;&#x5B98;&#x65B9;&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x6765;&#x5BF9;Shenandoah&#x7684;&#x5F31;&#x9879;&#xFF08;&#x9AD8;&#x8FD0;&#x884C;&#x8D1F;&#x62C5;&#x4F7F;&#x5F97;&#x541E;&#x5410;&#x91CF;&#x4E0B;&#x964D;&#xFF09;&#x548C;&#x5F3A;&#x9879;&#xFF08;&#x4F4E;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#xFF09; &#x5EFA;&#x7ACB;&#x91CF;&#x5316;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x5BF9;&#x6BD4;&#x4E00;&#x4E0B;&#x7A0D;&#x540E;&#x4ECB;&#x7ECD;&#x7684;ZGC&#x7684;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x3002;</p>
 
      <!-- reward -->
      
    </div>
    

    <!-- copyright -->
    
    <footer class="article-footer">
       
<div class="share-btn">
      <span class="share-sns share-outer">
        <i class="ri-share-forward-line"></i>
        分享
      </span>
      <div class="share-wrap">
        <i class="arrow"></i>
        <div class="share-icons">
          
          <a class="weibo share-sns" href="javascript:;" data-type="weibo">
            <i class="ri-weibo-fill"></i>
          </a>
          <a class="weixin share-sns wxFab" href="javascript:;" data-type="weixin">
            <i class="ri-wechat-fill"></i>
          </a>
          <a class="qq share-sns" href="javascript:;" data-type="qq">
            <i class="ri-qq-fill"></i>
          </a>
          <a class="douban share-sns" href="javascript:;" data-type="douban">
            <i class="ri-douban-line"></i>
          </a>
          <!-- <a class="qzone share-sns" href="javascript:;" data-type="qzone">
            <i class="icon icon-qzone"></i>
          </a> -->
          
          <a class="facebook share-sns" href="javascript:;" data-type="facebook">
            <i class="ri-facebook-circle-fill"></i>
          </a>
          <a class="twitter share-sns" href="javascript:;" data-type="twitter">
            <i class="ri-twitter-fill"></i>
          </a>
          <a class="google share-sns" href="javascript:;" data-type="google">
            <i class="ri-google-fill"></i>
          </a>
        </div>
      </div>
</div>

<div class="wx-share-modal">
    <a class="modal-close" href="javascript:;"><i class="ri-close-circle-line"></i></a>
    <p>扫一扫，分享到微信</p>
    <div class="wx-qrcode">
      <img src="//api.qrserver.com/v1/create-qr-code/?size=150x150&data=http://example.com/2022/05/12/4.008.GC-Shenadoah%E6%94%B6%E9%9B%86%E5%99%A8/" alt="微信分享二维码">
    </div>
</div>

<div id="share-mask"></div>  
  <ul class="article-tag-list" itemprop="keywords"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/G1/" rel="tag">G1</a></li></ul>

    </footer>
  </div>

   
  <nav class="article-nav">
    
      <a href="/2022/05/12/4.009.GC-%E4%B8%89%E8%89%B2%E6%A0%87%E8%AE%B0%E6%B3%95/" class="article-nav-link">
        <strong class="article-nav-caption">上一篇</strong>
        <div class="article-nav-title">
          
            GC-三色标记法
          
        </div>
      </a>
    
    
      <a href="/2022/05/12/4.101.GC-G1%E6%94%B6%E9%9B%86%E5%99%A8%E5%8E%9F%E7%90%86%E4%B8%80/" class="article-nav-link">
        <strong class="article-nav-caption">下一篇</strong>
        <div class="article-nav-title">GC-G1收集器原理原理一</div>
      </a>
    
  </nav>

  
   
    
    <script src="https://cdn.staticfile.org/twikoo/1.4.18/twikoo.all.min.js"></script>
    <div id="twikoo" class="twikoo"></div>
    <script>
        twikoo.init({
            envId: ""
        })
    </script>
 
</article>

</section>
      <footer class="footer">
  <div class="outer">
    <ul>
      <li>
        Copyrights &copy;
        2017-2025
        <i class="ri-heart-fill heart_icon"></i> xugang.xie
      </li>
    </ul>
    <ul>
      <li>
        
      </li>
    </ul>
    <ul>
      <li>
        
        
        <span>
  <span><i class="ri-user-3-fill"></i>访问人数:<span id="busuanzi_value_site_uv"></span></span>
  <span class="division">|</span>
  <span><i class="ri-eye-fill"></i>浏览次数:<span id="busuanzi_value_page_pv"></span></span>
</span>
        
      </li>
    </ul>
    <ul>
      
    </ul>
    <ul>
      
    </ul>
    <ul>
      <li>
        <!-- cnzz统计 -->
        
        <script type="text/javascript" src='https://s9.cnzz.com/z_stat.php?id=1278069914&amp;web_id=1278069914'></script>
        
      </li>
    </ul>
  </div>
</footer>    
    </main>
    <div class="float_btns">
      <div class="totop" id="totop">
  <i class="ri-arrow-up-line"></i>
</div>

<div class="todark" id="todark">
  <i class="ri-moon-line"></i>
</div>

    </div>
    <aside class="sidebar on">
      <button class="navbar-toggle"></button>
<nav class="navbar">
  
  <div class="logo">
    <a href="/"><img src="/images/ayer-side.svg" alt="xugang.xie&#39;s blog"></a>
  </div>
  
  <ul class="nav nav-main">
    
    <li class="nav-item">
      <a class="nav-item-link" href="/">主页</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/archives">归档</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/categories">分类</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/tags">标签</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" target="_blank" rel="noopener" href="https://xiexugang.lofter.com">拍照</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/friends">友链</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/about">关于我</a>
    </li>
    
  </ul>
</nav>
<nav class="navbar navbar-bottom">
  <ul class="nav">
    <li class="nav-item">
      
      <a class="nav-item-link nav-item-search"  title="搜索">
        <i class="ri-search-line"></i>
      </a>
      
      
      <a class="nav-item-link" target="_blank" href="/atom.xml" title="RSS Feed">
        <i class="ri-rss-line"></i>
      </a>
      
    </li>
  </ul>
</nav>
<div class="search-form-wrap">
  <div class="local-search local-search-plugin">
  <input type="search" id="local-search-input" class="local-search-input" placeholder="Search...">
  <div id="local-search-result" class="local-search-result"></div>
</div>
</div>
    </aside>
    <div id="mask"></div>

<!-- #reward -->
<div id="reward">
  <span class="close"><i class="ri-close-line"></i></span>
  <p class="reward-p"><i class="ri-cup-line"></i>请我喝杯咖啡吧~</p>
  <div class="reward-box">
    
    <div class="reward-item">
      <img class="reward-img" src="/images/alipay.jpg">
      <span class="reward-type">支付宝</span>
    </div>
    
    
    <div class="reward-item">
      <img class="reward-img" src="/images/wechat.jpg">
      <span class="reward-type">微信</span>
    </div>
    
  </div>
</div>
    
<script src="/js/jquery-3.6.0.min.js"></script>
 
<script src="/js/lazyload.min.js"></script>

<!-- Tocbot -->
 
<script src="/js/tocbot.min.js"></script>

<script>
  tocbot.init({
    tocSelector: ".tocbot",
    contentSelector: ".article-entry",
    headingSelector: "h1, h2, h3, h4, h5, h6",
    hasInnerContainers: true,
    scrollSmooth: true,
    scrollContainer: "main",
    positionFixedSelector: ".tocbot",
    positionFixedClass: "is-position-fixed",
    fixedSidebarOffset: "auto",
  });
</script>

<script src="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.js"></script>
<link
  rel="stylesheet"
  href="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.css"
/>
<script src="https://cdn.staticfile.org/justifiedGallery/3.8.1/js/jquery.justifiedGallery.min.js"></script>

<script src="/dist/main.js"></script>

<!-- ImageViewer -->
 <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                        <div class="pswp__preloader__cut">
                            <div class="pswp__preloader__donut"></div>
                        </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div>
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>

<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.css">
<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/default-skin/default-skin.min.css">
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.js"></script>
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe-ui-default.min.js"></script>

<script>
    function viewer_init() {
        let pswpElement = document.querySelectorAll('.pswp')[0];
        let $imgArr = document.querySelectorAll(('.article-entry img:not(.reward-img)'))

        $imgArr.forEach(($em, i) => {
            $em.onclick = () => {
                // slider展开状态
                // todo: 这样不好，后面改成状态
                if (document.querySelector('.left-col.show')) return
                let items = []
                $imgArr.forEach(($em2, i2) => {
                    let img = $em2.getAttribute('data-idx', i2)
                    let src = $em2.getAttribute('data-target') || $em2.getAttribute('src')
                    let title = $em2.getAttribute('alt')
                    // 获得原图尺寸
                    const image = new Image()
                    image.src = src
                    items.push({
                        src: src,
                        w: image.width || $em2.width,
                        h: image.height || $em2.height,
                        title: title
                    })
                })
                var gallery = new PhotoSwipe(pswpElement, PhotoSwipeUI_Default, items, {
                    index: parseInt(i)
                });
                gallery.init()
            }
        })
    }
    viewer_init()
</script> 
<!-- MathJax -->

<!-- Katex -->

<!-- busuanzi  -->
 
<script src="/js/busuanzi-2.3.pure.min.js"></script>
 
<!-- ClickLove -->

<!-- ClickBoom1 -->

<!-- ClickBoom2 -->

<!-- CodeCopy -->
 
<link rel="stylesheet" href="/css/clipboard.css">
 <script src="https://cdn.staticfile.org/clipboard.js/2.0.10/clipboard.min.js"></script>
<script>
  function wait(callback, seconds) {
    var timelag = null;
    timelag = window.setTimeout(callback, seconds);
  }
  !function (e, t, a) {
    var initCopyCode = function(){
      var copyHtml = '';
      copyHtml += '<button class="btn-copy" data-clipboard-snippet="">';
      copyHtml += '<i class="ri-file-copy-2-line"></i><span>COPY</span>';
      copyHtml += '</button>';
      $(".highlight .code pre").before(copyHtml);
      $(".article pre code").before(copyHtml);
      var clipboard = new ClipboardJS('.btn-copy', {
        target: function(trigger) {
          return trigger.nextElementSibling;
        }
      });
      clipboard.on('success', function(e) {
        let $btn = $(e.trigger);
        $btn.addClass('copied');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-checkbox-circle-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPIED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-checkbox-circle-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
      clipboard.on('error', function(e) {
        e.clearSelection();
        let $btn = $(e.trigger);
        $btn.addClass('copy-failed');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-time-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPY FAILED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-time-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
    }
    initCopyCode();
  }(window, document);
</script>
 
<!-- CanvasBackground -->

<script>
  if (window.mermaid) {
    mermaid.initialize({ theme: "forest" });
  }
</script>


    
    

  </div>
</body>

</html>