<!DOCTYPE html>


<html lang="zh-CN">
  

    <head>
      <meta charset="utf-8" />
        
      <meta
        name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1"
      />
      <title>10C107.设计模式系列-结构型-桥梁模式 |  xugang.xie&#39;s blog</title>
  <meta name="generator" content="hexo-theme-ayer">
      
      <link rel="shortcut icon" href="/favicon.ico" />
       
<link rel="stylesheet" href="/dist/main.css">

      
<link rel="stylesheet" href="/css/fonts/remixicon.css">

      
<link rel="stylesheet" href="/css/custom.css">
 
      <script src="https://cdn.staticfile.org/pace/1.2.4/pace.min.js"></script>
       
 

      <link
        rel="stylesheet"
        href="https://cdn.jsdelivr.net/npm/@sweetalert2/theme-bulma@5.0.1/bulma.min.css"
      />
      <script src="https://cdn.jsdelivr.net/npm/sweetalert2@11.0.19/dist/sweetalert2.min.js"></script>

      <!-- mermaid -->
      
      <style>
        .swal2-styled.swal2-confirm {
          font-size: 1.6rem;
        }
      </style>
    <link rel="alternate" href="/atom.xml" title="xugang.xie's blog" type="application/atom+xml">
</head>
  </html>
</html>


<body>
  <div id="app">
    
      
    <main class="content on">
      <section class="outer">
  <article
  id="post-10C107.设计模式系列-结构型-桥梁模式"
  class="article article-type-post"
  itemscope
  itemprop="blogPost"
  data-scroll-reveal
>
  <div class="article-inner">
    
    <header class="article-header">
       
<h1 class="article-title sea-center" style="border-left:0" itemprop="name">
  10C107.设计模式系列-结构型-桥梁模式
</h1>
 

      
    </header>
     
    <div class="article-meta">
      <a href="/2021/10/01/10C107.%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F%E7%B3%BB%E5%88%97-%E7%BB%93%E6%9E%84%E5%9E%8B-%E6%A1%A5%E6%A2%81%E6%A8%A1%E5%BC%8F/" class="article-date">
  <time datetime="2021-09-30T16:00:00.000Z" itemprop="datePublished">2021-10-01</time>
</a> 
  <div class="article-category">
    <a class="article-category-link" href="/categories/%E6%9E%B6%E6%9E%84/">架构</a>
  </div>
  
<div class="word_count">
    <span class="post-time">
        <span class="post-meta-item-icon">
            <i class="ri-quill-pen-line"></i>
            <span class="post-meta-item-text"> 字数统计:</span>
            <span class="post-count">2.2k</span>
        </span>
    </span>

    <span class="post-time">
        &nbsp; | &nbsp;
        <span class="post-meta-item-icon">
            <i class="ri-book-open-line"></i>
            <span class="post-meta-item-text"> 阅读时长≈</span>
            <span class="post-count">13 分钟</span>
        </span>
    </span>
</div>
 
    </div>
      
    <div class="tocbot"></div>




  
    <div class="article-entry" itemprop="articleBody">
       
  <p>&#x5728;&#x960E;&#x5B8F;&#x535A;&#x58EB;&#x7684;&#x300A;JAVA&#x4E0E;&#x6A21;&#x5F0F;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x5F00;&#x5934;&#x662F;&#x8FD9;&#x6837;&#x63CF;&#x8FF0;&#x6865;&#x6881;&#xFF08;Bridge&#xFF09;&#x6A21;&#x5F0F;&#x7684;&#xFF1A;</p>
<blockquote>
<p>&#x3000;&#x3000;<strong>&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x662F;&#x5BF9;&#x8C61;&#x7684;&#x7ED3;&#x6784;&#x6A21;&#x5F0F;&#x3002;&#x53C8;&#x79F0;&#x4E3A;&#x67C4;&#x4F53;(Handle and Body)&#x6A21;&#x5F0F;&#x6216;&#x63A5;&#x53E3;(Interface)&#x6A21;&#x5F0F;&#x3002;&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x610F;&#x662F;&#x201C;&#x5C06;&#x62BD;&#x8C61;&#x5316;(Abstraction)&#x4E0E;&#x5B9E;&#x73B0;&#x5316;(Implementation)&#x8131;&#x8026;&#xFF0C;&#x4F7F;&#x5F97;&#x4E8C;&#x8005;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x53D8;&#x5316;&#x201D;&#x3002;</strong></p>
</blockquote>
<span id="more"></span>
<h2 id="&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x610F;"><a href="#&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x610F;" class="headerlink" title="&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x610F;"></a>&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x610F;</h2><p>&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x867D;&#x7136;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x9891;&#x7387;&#x5F88;&#x9AD8;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x719F;&#x6089;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x5BF9;&#x4E8E;&#x7406;&#x89E3;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x5305;&#x62EC;&#x201C;&#x5F00;-&#x95ED;&#x201D;&#x539F;&#x5219;&#x4EE5;&#x53CA;&#x7EC4;&#x5408;/&#x805A;&#x5408;&#x590D;&#x7528;&#x539F;&#x5219;&#x90FD;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x7406;&#x89E3;&#x597D;&#x8FD9;&#x4E24;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x5F62;&#x6210;&#x6B63;&#x786E;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x548C;&#x57F9;&#x517B;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x610F;&#x662F;&#x201C;&#x5C06;&#x62BD;&#x8C61;&#x5316;(Abstraction)&#x4E0E;&#x5B9E;&#x73B0;&#x5316;(Implementation)&#x8131;&#x8026;&#xFF0C;&#x4F7F;&#x5F97;&#x4E8C;&#x8005;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x53D8;&#x5316;&#x201D;&#x3002;&#x8FD9;&#x53E5;&#x8BDD;&#x5F88;&#x77ED;&#xFF0C;&#x4F46;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x8BFB;&#x5230;&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x4EBA;&#x5F88;&#x53EF;&#x80FD;&#x90FD;&#x4F1A;&#x601D;&#x8003;&#x826F;&#x4E45;&#x800C;&#x4E0D;&#x89E3;&#x5176;&#x610F;&#x3002;</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x53E5;&#x8BDD;&#x6709;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x62BD;&#x8C61;&#x5316;&#x3001;&#x5B9E;&#x73B0;&#x5316;&#x548C;&#x8131;&#x8026;&#x3002;&#x7406;&#x89E3;&#x8FD9;&#x4E09;&#x4E2A;&#x8BCD;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x6982;&#x5FF5;&#x662F;&#x7406;&#x89E3;&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7528;&#x610F;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<h3 id="&#x62BD;&#x8C61;&#x5316;"><a href="#&#x62BD;&#x8C61;&#x5316;" class="headerlink" title="&#x62BD;&#x8C61;&#x5316;"></a>&#x62BD;&#x8C61;&#x5316;</h3><p>&#x4ECE;&#x4F17;&#x591A;&#x7684;&#x4E8B;&#x7269;&#x4E2D;&#x62BD;&#x53D6;&#x51FA;&#x5171;&#x540C;&#x7684;&#x3001;&#x672C;&#x8D28;&#x6027;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x820D;&#x5F03;&#x5176;&#x975E;&#x672C;&#x8D28;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5C31;&#x662F;&#x62BD;&#x8C61;&#x5316;&#x3002;&#x4F8B;&#x5982;&#x82F9;&#x679C;&#x3001;&#x9999;&#x8549;&#x3001;&#x751F;&#x68A8;&#x3001; &#x6843;&#x5B50;&#x7B49;&#xFF0C;&#x5B83;&#x4EEC;&#x5171;&#x540C;&#x7684;&#x7279;&#x6027;&#x5C31;&#x662F;&#x6C34;&#x679C;&#x3002;&#x5F97;&#x51FA;&#x6C34;&#x679C;&#x6982;&#x5FF5;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8981;&#x62BD;&#x8C61;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x6CA1;&#x6709;&#x6BD4;&#x8F83;&#x5C31;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x5728;&#x672C;&#x8D28;&#x4E0A;&#x5171;&#x540C;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5171;&#x540C;&#x7279;&#x5F81;&#x662F;&#x6307;&#x90A3;&#x4E9B;&#x80FD;&#x628A;&#x4E00;&#x7C7B;&#x4E8B;&#x7269;&#x4E0E;&#x4ED6;&#x7C7B;&#x4E8B;&#x7269;&#x533A;&#x5206;&#x5F00;&#x6765;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x4E9B;&#x5177;&#x6709;&#x533A;&#x5206;&#x4F5C;&#x7528;&#x7684;&#x7279;&#x5F81;&#x53C8;&#x79F0;&#x672C;&#x8D28;&#x7279;&#x5F81;&#x3002;&#x56E0;&#x6B64;&#x62BD;&#x53D6;&#x4E8B;&#x7269;&#x7684;&#x5171;&#x540C;&#x7279;&#x5F81;&#x5C31;&#x662F;&#x62BD;&#x53D6;&#x4E8B;&#x7269;&#x7684;&#x672C;&#x8D28;&#x7279;&#x5F81;&#xFF0C;&#x820D;&#x5F03;&#x975E;&#x672C;&#x8D28;&#x7684;&#x7279;&#x5F81;&#x3002; &#x6240;&#x4EE5;&#x62BD;&#x8C61;&#x5316;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x88C1;&#x526A;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x62BD;&#x8C61;&#x65F6;&#xFF0C;&#x540C;&#x4E0E;&#x4E0D;&#x540C;&#xFF0C;&#x51B3;&#x5B9A;&#x4E8E;&#x4ECE;&#x4EC0;&#x4E48;&#x89D2;&#x5EA6;&#x4E0A;&#x6765;&#x62BD;&#x8C61;&#x3002;&#x62BD;&#x8C61;&#x7684;&#x89D2;&#x5EA6;&#x53D6;&#x51B3;&#x4E8E;&#x5206;&#x6790;&#x95EE;&#x9898;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x3000;&#x3000;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x7EC4;&#x5BF9;&#x8C61;&#x5982;&#x679C;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x7C7B;&#x6765;&#x63CF;&#x8FF0;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x7C7B;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5F80;&#x5F80;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x62BD;&#x8C61;&#x7C7B;&#x6765;&#x63CF;&#x8FF0;&#x3002;</p>
<h3 id="&#x5B9E;&#x73B0;&#x5316;"><a href="#&#x5B9E;&#x73B0;&#x5316;" class="headerlink" title="&#x5B9E;&#x73B0;&#x5316;"></a>&#x5B9E;&#x73B0;&#x5316;</h3><p>&#x62BD;&#x8C61;&#x5316;&#x7ED9;&#x51FA;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#xFF0C;&#x5C31;&#x662F;&#x5B9E;&#x73B0;&#x5316;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x5B50;&#x7C7B;&#x662F;&#x5B83;&#x7684;&#x62BD;&#x8C61;&#x8D85;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x5316;&#x3002;</p>
<h3 id="&#x8131;&#x8026;"><a href="#&#x8131;&#x8026;" class="headerlink" title="&#x8131;&#x8026;"></a>&#x8131;&#x8026;</h3><p>&#x6240;&#x8C13;&#x8026;&#x5408;&#xFF0C;&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x5B9E;&#x4F53;&#x7684;&#x884C;&#x4E3A;&#x7684;&#x67D0;&#x79CD;&#x5F3A;&#x5173;&#x8054;&#x3002;&#x800C;&#x5C06;&#x5B83;&#x4EEC;&#x7684;&#x5F3A;&#x5173;&#x8054;&#x53BB;&#x6389;&#xFF0C;&#x5C31;&#x662F;&#x8026;&#x5408;&#x7684;&#x89E3;&#x8131;&#xFF0C;&#x6216;&#x79F0;&#x8131;&#x8026;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8131;&#x8026;&#x662F;&#x6307;&#x5C06;&#x62BD;&#x8C61;&#x5316;&#x548C;&#x5B9E;&#x73B0;&#x5316;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x89E3;&#x8131;&#x5F00;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x5C06;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5F3A;&#x5173;&#x8054;&#x6539;&#x6362;&#x6210;&#x5F31;&#x5173;&#x8054;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6240;&#x8C13;&#x5F3A;&#x5173;&#x8054;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x671F;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x65E0;&#x6CD5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x671F;&#x52A8;&#x6001;&#x6539;&#x53D8;&#x7684;&#x5173;&#x8054;&#xFF1B;&#x6240;&#x8C13;&#x5F31;&#x5173;&#x8054;&#xFF0C;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x5730;&#x786E;&#x5B9A;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x671F;&#x52A8;&#x6001;&#x5730;&#x6539;&#x53D8;&#x7684;&#x5173;&#x8054;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x5728;Java&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x662F;&#x5F3A;&#x5173;&#x8054;&#xFF0C;&#x800C;&#x805A;&#x5408;&#x5173;&#x7CFB;&#x662F;&#x5F31;&#x5173;&#x8054;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5C06;&#x4E24;&#x4E2A;&#x89D2;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x6539;&#x4E3A;&#x805A;&#x5408;&#x5173;&#x7CFB;&#xFF0C;&#x5C31;&#x662F;&#x5C06;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5F3A;&#x5173;&#x8054;&#x6539;&#x6362;&#x6210;&#x4E3A;&#x5F31;&#x5173;&#x8054;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x6240;&#x8C13;&#x8131;&#x8026;&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x5728;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x62BD;&#x8C61;&#x5316;&#x548C;&#x5B9E;&#x73B0;&#x5316;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x805A;&#x5408;&#x5173;&#x7CFB;&#x800C;&#x4E0D;&#x662F;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x4E24;&#x8005;&#x53EF;&#x4EE5;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x5730;&#x53D8;&#x5316;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7528;&#x610F;&#x3002;</p>
<h2 id="&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7ED3;&#x6784;"><a href="#&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7ED3;&#x6784;" class="headerlink" title="&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7ED3;&#x6784;"></a>&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x7ED3;&#x6784;</h2><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br></pre></td><td class="code"><pre><span class="line">@startuml</span><br><span class="line">abstract class Implementor {</span><br><span class="line">  void operationImpl();</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">class ConcreteImplementorA {</span><br><span class="line">  void operationImpl();</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">class ConcreteImplementorB {</span><br><span class="line">  void operationImpl();</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">abstract class Abstraction {</span><br><span class="line">  Implementor impl;</span><br><span class="line">  Abstraction(Implementor impl);</span><br><span class="line">  void operation();</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">abstract class RefinedAbstraction {</span><br><span class="line">  void concreteOperation();</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">class ConcreteARefinedAbstraction {</span><br><span class="line">  void concreteOperation();</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">class ConcreteBRefinedAbstraction {</span><br><span class="line">  void concreteOperation();</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">Abstraction &lt;|-- RefinedAbstraction</span><br><span class="line">RefinedAbstraction &lt;|-- ConcreteARefinedAbstraction</span><br><span class="line">RefinedAbstraction &lt;|-- ConcreteBRefinedAbstraction</span><br><span class="line">Abstraction o-- Implementor</span><br><span class="line">Implementor &lt;|.. ConcreteImplementorA</span><br><span class="line">Implementor &lt;|.. ConcreteImplementorB</span><br><span class="line"></span><br><span class="line">@enduml</span><br></pre></td></tr></table></figure>

<p>&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x89D2;&#x8272;&#x6709;&#xFF1A;</p>
<ul>
<li><p><strong>&#x62BD;&#x8C61;&#x5316;(Abstraction)&#x89D2;&#x8272;</strong>&#xFF1A;&#x62BD;&#x8C61;&#x5316;&#x7ED9;&#x51FA;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5E76;&#x4FDD;&#x5B58;&#x4E00;&#x4E2A;&#x5BF9;&#x5B9E;&#x73B0;&#x5316;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x3002;</p>
</li>
<li><p><strong>&#x4FEE;&#x6B63;&#x62BD;&#x8C61;&#x5316;(RefinedAbstraction)&#x89D2;&#x8272;</strong>&#xFF1A;&#x6269;&#x5C55;&#x62BD;&#x8C61;&#x5316;&#x89D2;&#x8272;&#xFF0C;&#x6539;&#x53D8;&#x548C;&#x4FEE;&#x6B63;&#x7236;&#x7C7B;&#x5BF9;&#x62BD;&#x8C61;&#x5316;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
</li>
<li><p><strong>&#x5B9E;&#x73B0;&#x5316;(Implementor)&#x89D2;&#x8272;</strong>&#xFF1A;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x7ED9;&#x51FA;&#x5B9E;&#x73B0;&#x5316;&#x89D2;&#x8272;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x4E0D;&#x7ED9;&#x51FA;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x5FC5;&#x987B;&#x6307;&#x51FA;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x4E0D;&#x4E00;&#x5B9A;&#x548C;&#x62BD;&#x8C61;&#x5316;&#x89D2;&#x8272;&#x7684;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x76F8;&#x540C;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x63A5;&#x53E3;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x5B9E;&#x73B0;&#x5316;&#x89D2;&#x8272;&#x5E94;&#x5F53;&#x53EA;&#x7ED9;&#x51FA;&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x62BD;&#x8C61;&#x5316;&#x89D2;&#x8272;&#x5E94;&#x5F53;&#x53EA;&#x7ED9;&#x51FA;&#x57FA;&#x4E8E;&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#x7684;&#x66F4;&#x9AD8;&#x4E00;&#x5C42;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
</li>
<li><p><strong>&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5316;(ConcreteImplementor)&#x89D2;&#x8272;</strong>&#xFF1A;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x7ED9;&#x51FA;&#x5B9E;&#x73B0;&#x5316;&#x89D2;&#x8272;&#x63A5;&#x53E3;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x3002;</p>
</li>
</ul>
<p>&#x62BD;&#x8C61;&#x5316;&#x89D2;&#x8272;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x6C34;&#x676F;&#x7684;&#x624B;&#x67C4;&#xFF0C;&#x800C;&#x5B9E;&#x73B0;&#x5316;&#x89D2;&#x8272;&#x548C;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5316;&#x89D2;&#x8272;&#x5C31;&#x50CF;&#x662F;&#x6C34;&#x676F;&#x7684;&#x676F;&#x8EAB;&#x3002;&#x624B;&#x67C4;&#x63A7;&#x5236;&#x676F;&#x8EAB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6B64;&#x6A21;&#x5F0F;&#x522B;&#x540D;&#x201C;&#x67C4;&#x4F53;&#x201D;&#x7684;&#x6765;&#x6E90;&#x3002;</p>
<p>&#x3000;&#x3000;<strong>&#x5BF9;&#x8C61;&#x662F;&#x5BF9;&#x884C;&#x4E3A;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x800C;&#x884C;&#x4E3A;&#x662F;&#x7531;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x610F;&#x6027;&#x7CFB;&#x7EDF;&#x91CC;&#xFF0C;&#x62BD;&#x8C61;&#x5316;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x7C7B;&#x5C01;&#x88C5;&#x4E86;operation()&#x65B9;&#x6CD5;&#xFF1B;&#x800C;&#x5B9E;&#x73B0;&#x5316;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x7C7B;&#x5C01;&#x88C5;&#x7684;&#x662F;operationImpl()&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F80;&#x5F80;&#x4F1A;&#x6709;&#x591A;&#x4E8E;&#x4E00;&#x4E2A;&#x7684;&#x65B9;&#x6CD5;&#x3002;</strong></p>
<p>&#x3000;&#x3000;<strong>&#x62BD;&#x8C61;&#x5316;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x901A;&#x8FC7;&#x5411;&#x5BF9;&#x5E94;&#x7684;&#x5B9E;&#x73B0;&#x5316;&#x5BF9;&#x8C61;&#x7684;&#x59D4;&#x6D3E;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x62BD;&#x8C61;&#x5316;&#x89D2;&#x8272;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5411;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x5316;&#x5BF9;&#x8C61;&#x59D4;&#x6D3E;&#xFF0C;&#x6765;&#x8FBE;&#x5230;&#x52A8;&#x6001;&#x5730;&#x8F6C;&#x6362;&#x81EA;&#x5DF1;&#x7684;&#x529F;&#x80FD;&#x7684;&#x76EE;&#x7684;&#x3002;</strong></p>
<h2 id="&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;"><a href="#&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;" class="headerlink" title="&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;"></a>&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;</h2><h3 id="&#x5206;&#x79BB;&#x62BD;&#x8C61;&#x548C;&#x5B9E;&#x73B0;&#x90E8;&#x5206;"><a href="#&#x5206;&#x79BB;&#x62BD;&#x8C61;&#x548C;&#x5B9E;&#x73B0;&#x90E8;&#x5206;" class="headerlink" title="&#x5206;&#x79BB;&#x62BD;&#x8C61;&#x548C;&#x5B9E;&#x73B0;&#x90E8;&#x5206;"></a>&#x5206;&#x79BB;&#x62BD;&#x8C61;&#x548C;&#x5B9E;&#x73B0;&#x90E8;&#x5206;</h3><p>&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x5206;&#x79BB;&#x4E86;&#x62BD;&#x8C61;&#x90E8;&#x5206;&#x548C;&#x5B9E;&#x73B0;&#x90E8;&#x5206;&#xFF0C;&#x4ECE;&#x800C;&#x6781;&#x5927;&#x5730;&#x63D0;&#x4F9B;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x8BA9;&#x62BD;&#x8C61;&#x90E8;&#x5206;&#x548C;&#x5B9E;&#x73B0;&#x90E8;&#x5206;&#x72EC;&#x7ACB;&#x51FA;&#x6765;&#xFF0C;&#x5206;&#x522B;&#x5B9A;&#x4E49;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5206;&#x5C42;&#xFF0C;&#x4ECE;&#x800C;&#x4EA7;&#x751F;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="&#x66F4;&#x597D;&#x7684;&#x6269;&#x5C55;&#x6027;"><a href="#&#x66F4;&#x597D;&#x7684;&#x6269;&#x5C55;&#x6027;" class="headerlink" title="&#x66F4;&#x597D;&#x7684;&#x6269;&#x5C55;&#x6027;"></a>&#x66F4;&#x597D;&#x7684;&#x6269;&#x5C55;&#x6027;</h3><p>&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x4F7F;&#x5F97;&#x62BD;&#x8C61;&#x90E8;&#x5206;&#x548C;&#x5B9E;&#x73B0;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x72EC;&#x7ACB;&#x5730;&#x6269;&#x5C55;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#xFF0C;&#x4ECE;&#x800C;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;</p>
<h2 id="&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x5728;JDK-x2F-&#x6846;&#x67B6;&#x4E2D;&#x7684;&#x4F7F;&#x7528;&#xFF1A;"><a href="#&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x5728;JDK-x2F-&#x6846;&#x67B6;&#x4E2D;&#x7684;&#x4F7F;&#x7528;&#xFF1A;" class="headerlink" title="&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x5728;JDK/&#x6846;&#x67B6;&#x4E2D;&#x7684;&#x4F7F;&#x7528;&#xFF1A;"></a>&#x6865;&#x63A5;&#x6A21;&#x5F0F;&#x5728;JDK/&#x6846;&#x67B6;&#x4E2D;&#x7684;&#x4F7F;&#x7528;&#xFF1A;</h2><p>&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x5728;Java&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;JDBC&#x9A71;&#x52A8;&#x5668;&#x3002;JDBC&#x4E3A;&#x6240;&#x6709;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x754C;&#x9762;&#x3002;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x52A8;&#x6001;&#x5730;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x9A71;&#x52A8;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x9A71;&#x52A8;&#x5668;&#x5411;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x53D1;&#x51FA;&#x6307;&#x4EE4;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x5C06;&#x62BD;&#x8C61;&#x89D2;&#x8272;&#x7684;&#x884C;&#x4E3A;&#x59D4;&#x6D3E;&#x7ED9;&#x5B9E;&#x73B0;&#x89D2;&#x8272;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x3000;&#x3000;&#x62BD;&#x8C61;&#x89D2;&#x8272;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x53D1;&#x51FA;&#x67E5;&#x8BE2;&#x6307;&#x4EE4;&#xFF0C;&#x56E0;&#x4E3A;&#x62BD;&#x8C61;&#x89D2;&#x8272;&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x6253;&#x4EA4;&#x9053;&#xFF0C;JDBC&#x9A71;&#x52A8;&#x5668;&#x8D1F;&#x8D23;&#x8FD9;&#x4E2A;&#x5E95;&#x5C42;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x7531;&#x4E8E;JDBC&#x9A71;&#x52A8;&#x5668;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x7684;&#x7EC6;&#x8282;&#x800C;&#x72EC;&#x7ACB;&#x5730;&#x6F14;&#x5316;&#xFF1B;&#x540C;&#x65F6;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x4E5F;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4E8E;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x7EC6;&#x8282;&#x800C;&#x72EC;&#x7ACB;&#x7684;&#x6F14;&#x5316;&#x3002;&#x4E24;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5DE6;&#x8FB9;&#x662F;JDBC API&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#xFF0C;&#x53F3;&#x8FB9;&#x662F;JDBC&#x9A71;&#x52A8;&#x5668;&#x7684;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x5EFA;&#x7ACB;&#x5728;JDBC API&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x7684;&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/10C107.%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F%E7%B3%BB%E5%88%97-%E7%BB%93%E6%9E%84%E5%9E%8B-%E6%A1%A5%E6%A2%81%E6%A8%A1%E5%BC%8F/1.png"></p>
<p>&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#xFF0C;&#x4E0E;JDBC&#x9A71;&#x52A8;&#x5668;&#x8FD9;&#x4E2A;&#x7B49;&#x7EA7;&#x7ED3;&#x6784;&#x662F;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x9759;&#x6001;&#x7684;&#x5F3A;&#x5173;&#x8054;&#x3002;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x901A;&#x8FC7;&#x59D4;&#x6D3E;&#x4E0E;JDBC&#x9A71;&#x52A8;&#x5668;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6865;&#x6881;&#x6A21;&#x5F0F;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>JDBC&#x7684;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#xFF0C;&#x628A;&#x62BD;&#x8C61;&#x90E8;&#x5206;&#x548C;&#x5177;&#x4F53;&#x90E8;&#x5206;&#x5206;&#x79BB;&#x5F00;&#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97;&#x62BD;&#x8C61;&#x90E8;&#x5206;&#x548C;&#x5177;&#x4F53;&#x90E8;&#x5206;&#x90FD;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x6269;&#x5C55;&#x3002;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x800C;&#x8A00;&#xFF0C;&#x53EA;&#x8981;&#x9009;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x9A71;&#x52A8;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x7A0B;&#x5E8F;&#x64CD;&#x4F5C;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x66F4;&#x6539;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x79FB;&#x690D;&#xFF1B;&#x5BF9;&#x4E8E;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x800C;&#x8A00;&#xFF0C;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#xFF1A;"><a href="#&#x53C2;&#x8003;&#xFF1A;" class="headerlink" title="&#x53C2;&#x8003;&#xFF1A;"></a>&#x53C2;&#x8003;&#xFF1A;</h2><ul>
<li><a target="_blank" rel="noopener" href="https://www.cnblogs.com/java-my-life/archive/2012/05/07/2480938.html">https://www.cnblogs.com/java-my-life/archive/2012/05/07/2480938.html</a></li>
</ul>
 
      <!-- reward -->
      
    </div>
    

    <!-- copyright -->
    
    <footer class="article-footer">
       
<div class="share-btn">
      <span class="share-sns share-outer">
        <i class="ri-share-forward-line"></i>
        分享
      </span>
      <div class="share-wrap">
        <i class="arrow"></i>
        <div class="share-icons">
          
          <a class="weibo share-sns" href="javascript:;" data-type="weibo">
            <i class="ri-weibo-fill"></i>
          </a>
          <a class="weixin share-sns wxFab" href="javascript:;" data-type="weixin">
            <i class="ri-wechat-fill"></i>
          </a>
          <a class="qq share-sns" href="javascript:;" data-type="qq">
            <i class="ri-qq-fill"></i>
          </a>
          <a class="douban share-sns" href="javascript:;" data-type="douban">
            <i class="ri-douban-line"></i>
          </a>
          <!-- <a class="qzone share-sns" href="javascript:;" data-type="qzone">
            <i class="icon icon-qzone"></i>
          </a> -->
          
          <a class="facebook share-sns" href="javascript:;" data-type="facebook">
            <i class="ri-facebook-circle-fill"></i>
          </a>
          <a class="twitter share-sns" href="javascript:;" data-type="twitter">
            <i class="ri-twitter-fill"></i>
          </a>
          <a class="google share-sns" href="javascript:;" data-type="google">
            <i class="ri-google-fill"></i>
          </a>
        </div>
      </div>
</div>

<div class="wx-share-modal">
    <a class="modal-close" href="javascript:;"><i class="ri-close-circle-line"></i></a>
    <p>扫一扫，分享到微信</p>
    <div class="wx-qrcode">
      <img src="//api.qrserver.com/v1/create-qr-code/?size=150x150&data=http://example.com/2021/10/01/10C107.%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F%E7%B3%BB%E5%88%97-%E7%BB%93%E6%9E%84%E5%9E%8B-%E6%A1%A5%E6%A2%81%E6%A8%A1%E5%BC%8F/" alt="微信分享二维码">
    </div>
</div>

<div id="share-mask"></div>  
  <ul class="article-tag-list" itemprop="keywords"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F-%E7%BB%93%E6%9E%84%E5%9E%8B/" rel="tag">设计模式-结构型</a></li></ul>

    </footer>
  </div>

   
  <nav class="article-nav">
    
      <a href="/2021/10/01/10C106.%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F%E7%B3%BB%E5%88%97-%E5%88%9B%E5%BB%BA%E5%9E%8B-%E5%8E%9F%E5%9E%8B%E6%A8%A1%E5%BC%8F/" class="article-nav-link">
        <strong class="article-nav-caption">上一篇</strong>
        <div class="article-nav-title">
          
            10C106.设计模式系列-创建型-原型模式
          
        </div>
      </a>
    
    
      <a href="/2021/10/01/10C201.%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F%E7%B3%BB%E5%88%97-%E7%BB%93%E6%9E%84%E5%9E%8B-%E4%BB%A3%E7%90%86%E6%A8%A1%E5%BC%8F/" class="article-nav-link">
        <strong class="article-nav-caption">下一篇</strong>
        <div class="article-nav-title">10C201.设计模式系列-结构型-代理模式</div>
      </a>
    
  </nav>

  
   
    
    <script src="https://cdn.staticfile.org/twikoo/1.4.18/twikoo.all.min.js"></script>
    <div id="twikoo" class="twikoo"></div>
    <script>
        twikoo.init({
            envId: ""
        })
    </script>
 
</article>

</section>
      <footer class="footer">
  <div class="outer">
    <ul>
      <li>
        Copyrights &copy;
        2017-2024
        <i class="ri-heart-fill heart_icon"></i> xugang.xie
      </li>
    </ul>
    <ul>
      <li>
        
      </li>
    </ul>
    <ul>
      <li>
        
        
        <span>
  <span><i class="ri-user-3-fill"></i>访问人数:<span id="busuanzi_value_site_uv"></span></span>
  <span class="division">|</span>
  <span><i class="ri-eye-fill"></i>浏览次数:<span id="busuanzi_value_page_pv"></span></span>
</span>
        
      </li>
    </ul>
    <ul>
      
    </ul>
    <ul>
      
    </ul>
    <ul>
      <li>
        <!-- cnzz统计 -->
        
        <script type="text/javascript" src='https://s9.cnzz.com/z_stat.php?id=1278069914&amp;web_id=1278069914'></script>
        
      </li>
    </ul>
  </div>
</footer>    
    </main>
    <div class="float_btns">
      <div class="totop" id="totop">
  <i class="ri-arrow-up-line"></i>
</div>

<div class="todark" id="todark">
  <i class="ri-moon-line"></i>
</div>

    </div>
    <aside class="sidebar on">
      <button class="navbar-toggle"></button>
<nav class="navbar">
  
  <div class="logo">
    <a href="/"><img src="/images/ayer-side.svg" alt="xugang.xie&#39;s blog"></a>
  </div>
  
  <ul class="nav nav-main">
    
    <li class="nav-item">
      <a class="nav-item-link" href="/">主页</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/archives">归档</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/categories">分类</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/tags">标签</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/friends">友链</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/about">关于我</a>
    </li>
    
  </ul>
</nav>
<nav class="navbar navbar-bottom">
  <ul class="nav">
    <li class="nav-item">
      
      <a class="nav-item-link nav-item-search"  title="搜索">
        <i class="ri-search-line"></i>
      </a>
      
      
      <a class="nav-item-link" target="_blank" href="/atom.xml" title="RSS Feed">
        <i class="ri-rss-line"></i>
      </a>
      
    </li>
  </ul>
</nav>
<div class="search-form-wrap">
  <div class="local-search local-search-plugin">
  <input type="search" id="local-search-input" class="local-search-input" placeholder="Search...">
  <div id="local-search-result" class="local-search-result"></div>
</div>
</div>
    </aside>
    <div id="mask"></div>

<!-- #reward -->
<div id="reward">
  <span class="close"><i class="ri-close-line"></i></span>
  <p class="reward-p"><i class="ri-cup-line"></i>请我喝杯咖啡吧~</p>
  <div class="reward-box">
    
    <div class="reward-item">
      <img class="reward-img" src="/images/alipay.jpg">
      <span class="reward-type">支付宝</span>
    </div>
    
    
    <div class="reward-item">
      <img class="reward-img" src="/images/wechat.jpg">
      <span class="reward-type">微信</span>
    </div>
    
  </div>
</div>
    
<script src="/js/jquery-3.6.0.min.js"></script>
 
<script src="/js/lazyload.min.js"></script>

<!-- Tocbot -->
 
<script src="/js/tocbot.min.js"></script>

<script>
  tocbot.init({
    tocSelector: ".tocbot",
    contentSelector: ".article-entry",
    headingSelector: "h1, h2, h3, h4, h5, h6",
    hasInnerContainers: true,
    scrollSmooth: true,
    scrollContainer: "main",
    positionFixedSelector: ".tocbot",
    positionFixedClass: "is-position-fixed",
    fixedSidebarOffset: "auto",
  });
</script>

<script src="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.js"></script>
<link
  rel="stylesheet"
  href="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.css"
/>
<script src="https://cdn.staticfile.org/justifiedGallery/3.8.1/js/jquery.justifiedGallery.min.js"></script>

<script src="/dist/main.js"></script>

<!-- ImageViewer -->
 <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                        <div class="pswp__preloader__cut">
                            <div class="pswp__preloader__donut"></div>
                        </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div>
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>

<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.css">
<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/default-skin/default-skin.min.css">
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.js"></script>
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe-ui-default.min.js"></script>

<script>
    function viewer_init() {
        let pswpElement = document.querySelectorAll('.pswp')[0];
        let $imgArr = document.querySelectorAll(('.article-entry img:not(.reward-img)'))

        $imgArr.forEach(($em, i) => {
            $em.onclick = () => {
                // slider展开状态
                // todo: 这样不好，后面改成状态
                if (document.querySelector('.left-col.show')) return
                let items = []
                $imgArr.forEach(($em2, i2) => {
                    let img = $em2.getAttribute('data-idx', i2)
                    let src = $em2.getAttribute('data-target') || $em2.getAttribute('src')
                    let title = $em2.getAttribute('alt')
                    // 获得原图尺寸
                    const image = new Image()
                    image.src = src
                    items.push({
                        src: src,
                        w: image.width || $em2.width,
                        h: image.height || $em2.height,
                        title: title
                    })
                })
                var gallery = new PhotoSwipe(pswpElement, PhotoSwipeUI_Default, items, {
                    index: parseInt(i)
                });
                gallery.init()
            }
        })
    }
    viewer_init()
</script> 
<!-- MathJax -->

<!-- Katex -->

<!-- busuanzi  -->
 
<script src="/js/busuanzi-2.3.pure.min.js"></script>
 
<!-- ClickLove -->

<!-- ClickBoom1 -->

<!-- ClickBoom2 -->

<!-- CodeCopy -->
 
<link rel="stylesheet" href="/css/clipboard.css">
 <script src="https://cdn.staticfile.org/clipboard.js/2.0.10/clipboard.min.js"></script>
<script>
  function wait(callback, seconds) {
    var timelag = null;
    timelag = window.setTimeout(callback, seconds);
  }
  !function (e, t, a) {
    var initCopyCode = function(){
      var copyHtml = '';
      copyHtml += '<button class="btn-copy" data-clipboard-snippet="">';
      copyHtml += '<i class="ri-file-copy-2-line"></i><span>COPY</span>';
      copyHtml += '</button>';
      $(".highlight .code pre").before(copyHtml);
      $(".article pre code").before(copyHtml);
      var clipboard = new ClipboardJS('.btn-copy', {
        target: function(trigger) {
          return trigger.nextElementSibling;
        }
      });
      clipboard.on('success', function(e) {
        let $btn = $(e.trigger);
        $btn.addClass('copied');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-checkbox-circle-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPIED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-checkbox-circle-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
      clipboard.on('error', function(e) {
        e.clearSelection();
        let $btn = $(e.trigger);
        $btn.addClass('copy-failed');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-time-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPY FAILED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-time-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
    }
    initCopyCode();
  }(window, document);
</script>
 
<!-- CanvasBackground -->

<script>
  if (window.mermaid) {
    mermaid.initialize({ theme: "forest" });
  }
</script>


    
    

  </div>
</body>

</html>