<!DOCTYPE html>


<html lang="zh-CN">
  

    <head>
      <meta charset="utf-8" />
        
      <meta name="description" content="一个八股文拾荒者&lt;br&gt;- A collector who is focuced on asshole-Java." />
      
      <meta
        name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1"
      />
      <title>12B009.[底层原理]-WAL技术-数据预读-文件打开模式-同步IO-异步IO |  xugang.xie&#39;s blog</title>
  <meta name="generator" content="hexo-theme-ayer">
      
      <link rel="shortcut icon" href="/favicon.ico" />
       
<link rel="stylesheet" href="/dist/main.css">

      
<link rel="stylesheet" href="/css/fonts/remixicon.css">

      
<link rel="stylesheet" href="/css/custom.css">
 
      <script src="https://cdn.staticfile.org/pace/1.2.4/pace.min.js"></script>
       
 

      <link
        rel="stylesheet"
        href="https://cdn.jsdelivr.net/npm/@sweetalert2/theme-bulma@5.0.1/bulma.min.css"
      />
      <script src="https://cdn.jsdelivr.net/npm/sweetalert2@11.0.19/dist/sweetalert2.min.js"></script>

      <!-- mermaid -->
      
      <style>
        .swal2-styled.swal2-confirm {
          font-size: 1.6rem;
        }
      </style>
    <link rel="alternate" href="/atom.xml" title="xugang.xie's blog" type="application/atom+xml">
</head>
  </html>
</html>


<body>
  <div id="app">
    
      
    <main class="content on">
      <section class="outer">
  <article
  id="post-12B009.[底层原理]-WAL技术-数据预读-文件打开模式-同步IO-异步IO"
  class="article article-type-post"
  itemscope
  itemprop="blogPost"
  data-scroll-reveal
>
  <div class="article-inner">
    
    <header class="article-header">
       
<h1 class="article-title sea-center" style="border-left:0" itemprop="name">
  12B009.[底层原理]-WAL技术-数据预读-文件打开模式-同步IO-异步IO
</h1>
 

      
    </header>
     
    <div class="article-meta">
      <a href="/2020/05/01/12B009.%5B%E5%BA%95%E5%B1%82%E5%8E%9F%E7%90%86%5D-WAL%E6%8A%80%E6%9C%AF-%E6%95%B0%E6%8D%AE%E9%A2%84%E8%AF%BB-%E6%96%87%E4%BB%B6%E6%89%93%E5%BC%80%E6%A8%A1%E5%BC%8F-%E5%90%8C%E6%AD%A5IO-%E5%BC%82%E6%AD%A5IO/" class="article-date">
  <time datetime="2020-04-30T16:00:00.000Z" itemprop="datePublished">2020-05-01</time>
</a> 
  <div class="article-category">
    <a class="article-category-link" href="/categories/Database-%E6%95%B0%E6%8D%AE%E5%BA%93/">Database-数据库</a>
  </div>
  
<div class="word_count">
    <span class="post-time">
        <span class="post-meta-item-icon">
            <i class="ri-quill-pen-line"></i>
            <span class="post-meta-item-text"> 字数统计:</span>
            <span class="post-count">1.5k</span>
        </span>
    </span>

    <span class="post-time">
        &nbsp; | &nbsp;
        <span class="post-meta-item-icon">
            <i class="ri-book-open-line"></i>
            <span class="post-meta-item-text"> 阅读时长≈</span>
            <span class="post-count">9 分钟</span>
        </span>
    </span>
</div>
 
    </div>
      



  
    <div class="article-entry" itemprop="articleBody">
       
  <blockquote>
<p>WAL&#x6280;&#x672F;-&#x6570;&#x636E;&#x9884;&#x8BFB;-&#x6587;&#x4EF6;&#x6253;&#x5F00;&#x6A21;&#x5F0F;-&#x540C;&#x6B65;IO-&#x5F02;&#x6B65;IO</p>
</blockquote>
<span id="more"></span>

<p><strong>WAL&#x6280;&#x672F;</strong> : &#x65E5;&#x5FD7;&#x5148;&#x884C;&#x6280;&#x672F;&#xFF0C;&#x57FA;&#x672C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x90FD;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x3002;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x9700;&#x8981;&#x5199;&#x6570;&#x636E;&#x5757;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x524D;&#x53F0;&#x7EBF;&#x7A0B;&#x628A;&#x5BF9;&#x5E94;&#x7684;&#x65E5;&#x5FD7;&#x5148;&#x5199;&#xFF08;&#x6279;&#x91CF;&#x987A;&#x5E8F;&#x5199;&#xFF09;&#x5230;&#x78C1;&#x76D8;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x544A;&#x8BC9;&#x5BA2;&#x6237;&#x7AEF;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#xFF0C;&#x81F3;&#x4E8E;&#x771F;&#x6B63;&#x5199;&#x6570;&#x636E;&#x5757;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x79BB;&#x6563;&#x968F;&#x673A;&#x5199;&#xFF09;&#x5219;&#x653E;&#x5230;&#x540E;&#x53F0;IO&#x7EBF;&#x7A0B;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#xFF0C;&#x867D;&#x7136;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x65E5;&#x5FD7;&#x662F;&#x6279;&#x91CF;&#x987A;&#x5E8F;&#x5199;&#xFF0C;&#x6548;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x5BA2;&#x6237;&#x7AEF;&#x5F88;&#x5FEB;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x76F8;&#x5E94;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x771F;&#x6B63;&#x7684;&#x6570;&#x636E;&#x5757;&#x843D;&#x76D8;&#x4E4B;&#x524D;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5954;&#x6E83;&#xFF0C;&#x91CD;&#x542F;&#x65F6;&#x5019;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65E5;&#x5FD7;&#x6765;&#x505A;&#x5D29;&#x6E83;&#x6062;&#x590D;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4E22;&#x5931;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x9884;&#x8BFB;</strong> : &#x4E0E;&#x6570;&#x636E;&#x5757;A&#x201C;&#x76F8;&#x90BB;&#x201D;&#x7684;&#x6570;&#x636E;&#x5757;B&#x548C;C&#x5728;A&#x88AB;&#x8BFB;&#x53D6;&#x7684;&#x65F6;&#x5019;&#xFF0C;B&#x548C;C&#x4E5F;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6982;&#x7387;&#x88AB;&#x8BFB;&#x53D6;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5728;&#x8BFB;&#x53D6;B&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x63D0;&#x524D;&#x628A;&#x4ED6;&#x4EEC;&#x8BFB;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6570;&#x636E;&#x9884;&#x8BFB;&#x6280;&#x672F;&#x3002;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x76F8;&#x90BB;&#x6709;&#x4E24;&#x79CD;&#x542B;&#x4E49;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x7269;&#x7406;&#x4E0A;&#x7684;&#x76F8;&#x90BB;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x76F8;&#x90BB;&#x3002;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4E2D;&#x76F8;&#x90BB;&#xFF0C;&#x53EB;&#x505A;&#x7269;&#x7406;&#x4E0A;&#x76F8;&#x90BB;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4E2D;&#x4E0D;&#x76F8;&#x90BB;&#xFF0C;&#x4F46;&#x662F;&#x903B;&#x8F91;&#x4E0A;&#x76F8;&#x90BB;&#xFF08;id=1&#x7684;&#x6570;&#x636E;&#x548C;id=2&#x7684;&#x6570;&#x636E;&#xFF0C;&#x903B;&#x8F91;&#x4E0A;&#x76F8;&#x90BB;&#xFF0C;&#x4F46;&#x662F;&#x7269;&#x7406;&#x4E0A;&#x4E0D;&#x4E00;&#x5B9A;&#x76F8;&#x90BB;&#xFF0C;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#xFF09;&#xFF0C;&#x5219;&#x53EB;&#x903B;&#x8F91;&#x76F8;&#x90BB;&#x3002;</p>
<p><strong>&#x6587;&#x4EF6;&#x6253;&#x5F00;&#x6A21;&#x5F0F;</strong> : Open&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5E38;&#x89C1;&#x7684;&#x6A21;&#x5F0F;&#x4E3B;&#x8981;&#x4E09;&#x79CD;&#xFF1A; <code>O_DIRECT</code> &#xFF0C; <code>O_SYNC</code> &#x4EE5;&#x53CA;default&#x6A21;&#x5F0F;&#x3002;O_DIRECT&#x6A21;&#x5F0F;&#x8868;&#x793A;&#x540E;&#x7EED;&#x5BF9;&#x6587;&#x4EF6;&#x7684;&#x64CD;&#x4F5C;&#x4E0D;&#x4F7F;&#x7528;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7F13;&#x5B58;&#xFF0C;&#x7528;&#x6237;&#x6001;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x8BBE;&#x5907;&#x6587;&#x4EF6;&#xFF0C;&#x7ED5;&#x8FC7;&#x4E86;&#x5185;&#x6838;&#x7684;&#x7F13;&#x5B58;&#x548C;&#x4F18;&#x5316;&#xFF0C;&#x4ECE;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x4F7F;&#x7528;O_DIRECT&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x5199;&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x8FD4;&#x56DE;&#x6210;&#x529F;&#xFF0C;&#x6570;&#x636E;&#x5C31;&#x771F;&#x7684;&#x843D;&#x76D8;&#x4E86;&#xFF08;&#x4E0D;&#x8003;&#x8651;&#x78C1;&#x76D8;&#x81EA;&#x5E26;&#x7684;&#x7F13;&#x5B58;&#xFF09;&#xFF0C;&#x4F7F;&#x7528;O_DIRECT&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x8BFB;&#x6587;&#x4EF6;&#xFF0C;&#x6BCF;&#x6B21;&#x8BFB;&#x64CD;&#x4F5C;&#x662F;&#x771F;&#x7684;&#x4ECE;&#x78C1;&#x76D8;&#x4E2D;&#x8BFB;&#x53D6;&#xFF0C;&#x4E0D;&#x4F1A;&#x4ECE;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7F13;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x3002;O_SYNC&#x8868;&#x793A;&#x4F7F;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7F13;&#x5B58;&#xFF0C;&#x5BF9;&#x6587;&#x4EF6;&#x7684;&#x8BFB;&#x5199;&#x90FD;&#x7ECF;&#x8FC7;&#x5185;&#x6838;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x8FD8;&#x4FDD;&#x8BC1;&#x6BCF;&#x6B21;&#x5199;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x6570;&#x636E;&#x4E00;&#x5B9A;&#x843D;&#x76D8;&#x3002;default&#x6A21;&#x5F0F;&#x4E0E;O_SYNC&#x6A21;&#x5F0F;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x5199;&#x6570;&#x636E;&#x540E;&#x4E0D;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E00;&#x5B9A;&#x843D;&#x76D8;&#xFF0C;&#x6570;&#x636E;&#x6709;&#x53EF;&#x80FD;&#x8FD8;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5F53;&#x4E3B;&#x673A;&#x5B95;&#x673A;&#xFF0C;&#x6570;&#x636E;&#x6709;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x5199;&#x64CD;&#x4F5C;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x6216;&#x8005;&#x589E;&#x52A0;&#x7684;&#x6570;&#x636E;&#x843D;&#x76D8;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x9700;&#x8981;&#x6587;&#x4EF6;&#x5143;&#x4FE1;&#x606F;&#x843D;&#x76D8;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x90E8;&#x5206;&#x90FD;&#x843D;&#x76D8;&#x4E86;&#xFF0C;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x4E0D;&#x4E22;&#x3002;O_DIRECT&#x6A21;&#x5F0F;&#x4E0D;&#x4FDD;&#x8BC1;&#x6587;&#x4EF6;&#x5143;&#x4FE1;&#x606F;&#x843D;&#x76D8;(&#x4F46;&#x5927;&#x90E8;&#x5206;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x4FDD;&#x8BC1;&#xFF0C;Bug #45892)&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4E0D;&#x505A;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#xFF0C;&#x7528;O_DIRECT&#x5199;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x4E5F;&#x5B58;&#x5728;&#x4E22;&#x5931;&#x7684;&#x98CE;&#x9669;&#x3002;O_SYNC&#x5219;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x548C;&#x5143;&#x4FE1;&#x606F;&#x90FD;&#x843D;&#x76D8;&#x3002;default&#x6A21;&#x5F0F;&#x4E24;&#x79CD;&#x6570;&#x636E;&#x90FD;&#x4E0D;&#x4FDD;&#x8BC1;&#x3002; &#x8C03;&#x7528;&#x51FD;&#x6570;fsync&#x540E;&#xFF0C;&#x80FD;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x548C;&#x65E5;&#x5FD7;&#x90FD;&#x843D;&#x76D8;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x7528;O_DIRECT&#x548C;default&#x6A21;&#x5F0F;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5199;&#x5B8C;&#x6570;&#x636E;&#xFF0C;&#x9700;&#x8981;&#x8C03;&#x7528;fsync&#x51FD;&#x6570;&#x3002;</p>
<p><strong>&#x540C;&#x6B65;IO</strong> : &#x6211;&#x4EEC;&#x5E38;&#x7528;&#x7684;read/write&#x51FD;&#x6570;&#xFF08;Linux&#x4E0A;&#xFF09;&#x5C31;&#x662F;&#x8FD9;&#x7C7B;IO&#xFF0C;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x4F1A;&#x7B49;&#x5F85;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x6D88;&#x606F;&#x901A;&#x77E5;&#x673A;&#x5236;&#xFF0C;&#x56E0;&#x4E3A;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x4E86;&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x540E;&#x7EED;&#x76F4;&#x63A5;&#x68C0;&#x67E5;&#x8FD4;&#x56DE;&#x503C;&#x5C31;&#x53EF;&#x77E5;&#x9053;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x6210;&#x529F;&#x3002;&#x8FD9;&#x7C7B;IO&#x64CD;&#x4F5C;&#xFF0C;&#x7F16;&#x7A0B;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x9700;&#x8981;&#x8C03;&#x7528;&#x8005;&#x7B49;&#x5F85;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x6025;&#x9700;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#x8C03;&#x7528;&#xFF0C;&#x4F8B;&#x5982;WAL&#x4E2D;&#x65E5;&#x5FD7;&#x5FC5;&#x987B;&#x5728;&#x8FD4;&#x56DE;&#x5BA2;&#x6237;&#x7AEF;&#x524D;&#x843D;&#x76D8;&#xFF0C;&#x5219;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x540C;&#x6B65;IO&#x64CD;&#x4F5C;&#x3002;</p>
<p><strong>&#x5F02;&#x6B65;IO</strong> : &#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x540E;&#x53F0;&#x5237;&#x6570;&#x636E;&#x5757;&#x7684;IO&#x7EBF;&#x7A0B;&#xFF0C;&#x57FA;&#x672C;&#x90FD;&#x4F7F;&#x7528;&#x4E86;&#x5F02;&#x6B65;IO&#x3002;&#x6570;&#x636E;&#x5E93;&#x524D;&#x53F0;&#x7EBF;&#x7A0B;&#x53EA;&#x9700;&#x8981;&#x628A;&#x5237;&#x5757;&#x8BF7;&#x6C42;&#x63D0;&#x4EA4;&#x5230;&#x5F02;&#x6B65;IO&#x7684;&#x961F;&#x5217;&#x4E2D;&#x5373;&#x53EF;&#x8FD4;&#x56DE;&#x505A;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;IO&#x7EBF;&#x7A0B;&#xFF0C;&#x5219;&#x5B9A;&#x671F;&#x68C0;&#x67E5;&#x8FD9;&#x4E9B;&#x63D0;&#x4EA4;&#x7684;&#x8BF7;&#x6C42;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x5982;&#x679C;&#x5B8C;&#x6210;&#x518D;&#x505A;&#x4E00;&#x4E9B;&#x540E;&#x7EED;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x3002;&#x540C;&#x65F6;&#x5F02;&#x6B65;IO&#x7531;&#x4E8E;&#x5E38;&#x5E38;&#x662F;&#x4E00;&#x6279;&#x4E00;&#x6279;&#x7684;&#x8BF7;&#x6C42;&#x63D0;&#x4EA4;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x540C;&#x8BF7;&#x6C42;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E14;&#x504F;&#x79FB;&#x91CF;&#x8FDE;&#x7EED;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;IO&#x8BF7;&#x6C42;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;1&#xFF0C;&#x504F;&#x79FB;&#x91CF;100&#x5F00;&#x59CB;&#x7684;200&#x5B57;&#x8282;&#x6570;&#x636E;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BF7;&#x6C42;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;1&#xFF0C;&#x504F;&#x79FB;&#x91CF;300&#x5F00;&#x59CB;&#x7684;100&#x5B57;&#x8282;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x8FD9;&#x4E24;&#x4E2A;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x4E3A;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;1&#xFF0C;&#x504F;&#x79FB;&#x91CF;100&#x5F00;&#x59CB;&#x7684;300&#x5B57;&#x8282;&#x6570;&#x636E;&#x3002;&#x6570;&#x636E;&#x9884;&#x8BFB;&#x4E2D;&#x7684;&#x903B;&#x8F91;&#x9884;&#x8BFB;&#x4E5F;&#x5E38;&#x5E38;&#x4F7F;&#x7528;&#x5F02;&#x6B65;IO&#x6280;&#x672F;&#x3002; &#x76EE;&#x524D;Linux&#x4E0A;&#x7684;&#x5F02;&#x6B65;IO&#x5E93;&#xFF0C;&#x9700;&#x8981;&#x6587;&#x4EF6;&#x4F7F;&#x7528;O_DIRECT&#x6A21;&#x5F0F;&#x6253;&#x5F00;&#xFF0C;&#x4E14;&#x6570;&#x636E;&#x5757;&#x5B58;&#x653E;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x3001;&#x6587;&#x4EF6;&#x8BFB;&#x5199;&#x7684;&#x504F;&#x79FB;&#x91CF;&#x548C;&#x8BFB;&#x5199;&#x7684;&#x6570;&#x636E;&#x91CF;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x903B;&#x8F91;&#x5757;&#x5927;&#x5C0F;&#x7684;&#x6574;&#x6570;&#x500D;&#xFF0C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x903B;&#x8F91;&#x5757;&#x5927;&#x5C0F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;sudo blockdev &#x2013;getss /dev/sda5&#x7684;&#x8BED;&#x53E5;&#x67E5;&#x8BE2;&#x3002;&#x5982;&#x679C;&#x4E0A;&#x8FF0;&#x4E09;&#x8005;&#x4E0D;&#x662F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x903B;&#x8F91;&#x5757;&#x5927;&#x5C0F;&#x7684;&#x6574;&#x6570;&#x500D;&#xFF0C;&#x5219;&#x5728;&#x8C03;&#x7528;&#x8BFB;&#x5199;&#x51FD;&#x6570;&#x65F6;&#x5019;&#x4F1A;&#x62A5;&#x9519;EINVAL&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x4E0D;&#x4F7F;&#x7528;O_DIRECT&#x6253;&#x5F00;&#xFF0C;&#x5219;&#x7A0B;&#x5E8F;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#xFF0C;&#x53EA;&#x662F;&#x9000;&#x5316;&#x6210;&#x540C;&#x6B65;IO&#xFF0C;&#x963B;&#x585E;&#x5728;io_submit&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E0A;&#x3002;</p>
<p>From: <a target="_blank" rel="noopener" href="http://mysql.taobao.org/monthly/2017/03/01/">http://mysql.taobao.org/monthly/2017/03/01/</a></p>
 
      <!-- reward -->
      
    </div>
    

    <!-- copyright -->
    
    <footer class="article-footer">
       
  <ul class="article-tag-list" itemprop="keywords"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/MySQL/" rel="tag">MySQL</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/%E5%BA%95%E5%B1%82%E5%8E%9F%E7%90%86/" rel="tag">底层原理</a></li></ul>

    </footer>
  </div>

   
  <nav class="article-nav">
    
      <a href="/2020/05/01/12B013.%5B%E5%BA%95%E5%B1%82%E5%8E%9F%E7%90%86%5D-Buffer%20Pool%E7%B3%BB%E5%88%97-%E7%BC%93%E5%86%B2%E6%B1%A0%E7%9A%84%E6%94%B9%E8%BF%9B%E7%89%88LRU/" class="article-nav-link">
        <strong class="article-nav-caption">上一篇</strong>
        <div class="article-nav-title">
          
            12B013.[底层原理]-Buffer Pool系列-缓冲池的改进版LRU
          
        </div>
      </a>
    
    
      <a href="/2020/05/01/12B015.%5B%E5%BA%95%E5%B1%82%E5%8E%9F%E7%90%86%5D-Change%20Buffer%E7%B3%BB%E5%88%97-%E6%B7%B1%E5%85%A5%E7%90%86%E8%A7%A3Change%20Buffer/" class="article-nav-link">
        <strong class="article-nav-caption">下一篇</strong>
        <div class="article-nav-title">12B015.[底层原理]-Change Buffer系列-深入理解Change Buffer</div>
      </a>
    
  </nav>

  
   
    
    <script src="https://cdn.staticfile.org/twikoo/1.4.18/twikoo.all.min.js"></script>
    <div id="twikoo" class="twikoo"></div>
    <script>
        twikoo.init({
            envId: ""
        })
    </script>
 
</article>

</section>
      <footer class="footer">
  <div class="outer">
    <ul>
      <li>
        Copyrights &copy;
        2015-2023
        <i class="ri-heart-fill heart_icon"></i> xugang.xie
      </li>
    </ul>
    <ul>
      <li>
        
      </li>
    </ul>
    <ul>
      <li>
        
        
        <span>
  <span><i class="ri-user-3-fill"></i>访问人数:<span id="busuanzi_value_site_uv"></span></span>
  <span class="division">|</span>
  <span><i class="ri-eye-fill"></i>浏览次数:<span id="busuanzi_value_page_pv"></span></span>
</span>
        
      </li>
    </ul>
    <ul>
      
    </ul>
    <ul>
      
    </ul>
    <ul>
      <li>
        <!-- cnzz统计 -->
        
        <script type="text/javascript" src='https://s9.cnzz.com/z_stat.php?id=1278069914&amp;web_id=1278069914'></script>
        
      </li>
    </ul>
  </div>
</footer>    
    </main>
    <div class="float_btns">
      <div class="totop" id="totop">
  <i class="ri-arrow-up-line"></i>
</div>

<div class="todark" id="todark">
  <i class="ri-moon-line"></i>
</div>

    </div>
    <aside class="sidebar on">
      <button class="navbar-toggle"></button>
<nav class="navbar">
  
  <div class="logo">
    <a href="/"><img src="/images/ayer-side.svg" alt="xugang.xie&#39;s blog"></a>
  </div>
  
  <ul class="nav nav-main">
    
    <li class="nav-item">
      <a class="nav-item-link" href="/">主页</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/archives">归档</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/categories">分类</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/tags">标签</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/friends">友链</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/about">关于我</a>
    </li>
    
  </ul>
</nav>
<nav class="navbar navbar-bottom">
  <ul class="nav">
    <li class="nav-item">
      
      <a class="nav-item-link nav-item-search"  title="搜索">
        <i class="ri-search-line"></i>
      </a>
      
      
      <a class="nav-item-link" target="_blank" href="/atom.xml" title="RSS Feed">
        <i class="ri-rss-line"></i>
      </a>
      
    </li>
  </ul>
</nav>
<div class="search-form-wrap">
  <div class="local-search local-search-plugin">
  <input type="search" id="local-search-input" class="local-search-input" placeholder="Search...">
  <div id="local-search-result" class="local-search-result"></div>
</div>
</div>
    </aside>
    <div id="mask"></div>

<!-- #reward -->
<div id="reward">
  <span class="close"><i class="ri-close-line"></i></span>
  <p class="reward-p"><i class="ri-cup-line"></i>请我喝杯咖啡吧~</p>
  <div class="reward-box">
    
    <div class="reward-item">
      <img class="reward-img" src="/images/alipay.jpg">
      <span class="reward-type">支付宝</span>
    </div>
    
    
    <div class="reward-item">
      <img class="reward-img" src="/images/wechat.jpg">
      <span class="reward-type">微信</span>
    </div>
    
  </div>
</div>
    
<script src="/js/jquery-3.6.0.min.js"></script>
 
<script src="/js/lazyload.min.js"></script>

<!-- Tocbot -->
 
<script src="/js/tocbot.min.js"></script>

<script>
  tocbot.init({
    tocSelector: ".tocbot",
    contentSelector: ".article-entry",
    headingSelector: "h1, h2, h3, h4, h5, h6",
    hasInnerContainers: true,
    scrollSmooth: true,
    scrollContainer: "main",
    positionFixedSelector: ".tocbot",
    positionFixedClass: "is-position-fixed",
    fixedSidebarOffset: "auto",
  });
</script>

<script src="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.js"></script>
<link
  rel="stylesheet"
  href="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.css"
/>
<script src="https://cdn.staticfile.org/justifiedGallery/3.8.1/js/jquery.justifiedGallery.min.js"></script>

<script src="/dist/main.js"></script>

<!-- ImageViewer -->
 <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                        <div class="pswp__preloader__cut">
                            <div class="pswp__preloader__donut"></div>
                        </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div>
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>

<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.css">
<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/default-skin/default-skin.min.css">
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.js"></script>
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe-ui-default.min.js"></script>

<script>
    function viewer_init() {
        let pswpElement = document.querySelectorAll('.pswp')[0];
        let $imgArr = document.querySelectorAll(('.article-entry img:not(.reward-img)'))

        $imgArr.forEach(($em, i) => {
            $em.onclick = () => {
                // slider展开状态
                // todo: 这样不好，后面改成状态
                if (document.querySelector('.left-col.show')) return
                let items = []
                $imgArr.forEach(($em2, i2) => {
                    let img = $em2.getAttribute('data-idx', i2)
                    let src = $em2.getAttribute('data-target') || $em2.getAttribute('src')
                    let title = $em2.getAttribute('alt')
                    // 获得原图尺寸
                    const image = new Image()
                    image.src = src
                    items.push({
                        src: src,
                        w: image.width || $em2.width,
                        h: image.height || $em2.height,
                        title: title
                    })
                })
                var gallery = new PhotoSwipe(pswpElement, PhotoSwipeUI_Default, items, {
                    index: parseInt(i)
                });
                gallery.init()
            }
        })
    }
    viewer_init()
</script> 
<!-- MathJax -->

<!-- Katex -->

<!-- busuanzi  -->
 
<script src="/js/busuanzi-2.3.pure.min.js"></script>
 
<!-- ClickLove -->

<!-- ClickBoom1 -->

<!-- ClickBoom2 -->

<!-- CodeCopy -->
 
<link rel="stylesheet" href="/css/clipboard.css">
 <script src="https://cdn.staticfile.org/clipboard.js/2.0.10/clipboard.min.js"></script>
<script>
  function wait(callback, seconds) {
    var timelag = null;
    timelag = window.setTimeout(callback, seconds);
  }
  !function (e, t, a) {
    var initCopyCode = function(){
      var copyHtml = '';
      copyHtml += '<button class="btn-copy" data-clipboard-snippet="">';
      copyHtml += '<i class="ri-file-copy-2-line"></i><span>COPY</span>';
      copyHtml += '</button>';
      $(".highlight .code pre").before(copyHtml);
      $(".article pre code").before(copyHtml);
      var clipboard = new ClipboardJS('.btn-copy', {
        target: function(trigger) {
          return trigger.nextElementSibling;
        }
      });
      clipboard.on('success', function(e) {
        let $btn = $(e.trigger);
        $btn.addClass('copied');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-checkbox-circle-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPIED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-checkbox-circle-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
      clipboard.on('error', function(e) {
        e.clearSelection();
        let $btn = $(e.trigger);
        $btn.addClass('copy-failed');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-time-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPY FAILED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-time-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
    }
    initCopyCode();
  }(window, document);
</script>
 
<!-- CanvasBackground -->

<script>
  if (window.mermaid) {
    mermaid.initialize({ theme: "forest" });
  }
</script>


    
    

  </div>
</body>

</html>