<!DOCTYPE html>


<html lang="zh-CN">
  

    <head>
      <meta charset="utf-8" />
        
      <meta name="description" content="一个八股文拾荒者&lt;br&gt;- A collector who is focuced on asshole-Java." />
      
      <meta
        name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1"
      />
      <title>JMM-运行时数据区域 |  xugang.xie&#39;s blog</title>
  <meta name="generator" content="hexo-theme-ayer">
      
      <link rel="shortcut icon" href="/favicon.ico" />
       
<link rel="stylesheet" href="/dist/main.css">

      
<link rel="stylesheet" href="/css/fonts/remixicon.css">

      
<link rel="stylesheet" href="/css/custom.css">
 
      <script src="https://cdn.staticfile.org/pace/1.2.4/pace.min.js"></script>
       
 

      <link
        rel="stylesheet"
        href="https://cdn.jsdelivr.net/npm/@sweetalert2/theme-bulma@5.0.1/bulma.min.css"
      />
      <script src="https://cdn.jsdelivr.net/npm/sweetalert2@11.0.19/dist/sweetalert2.min.js"></script>

      <!-- mermaid -->
      
      <style>
        .swal2-styled.swal2-confirm {
          font-size: 1.6rem;
        }
      </style>
    <link rel="alternate" href="/atom.xml" title="xugang.xie's blog" type="application/atom+xml">
</head>
  </html>
</html>


<body>
  <div id="app">
    
      
    <main class="content on">
      <section class="outer">
  <article
  id="post-2.001.JMM-运行时数据区域"
  class="article article-type-post"
  itemscope
  itemprop="blogPost"
  data-scroll-reveal
>
  <div class="article-inner">
    
    <header class="article-header">
       
<h1 class="article-title sea-center" style="border-left:0" itemprop="name">
  JMM-运行时数据区域
</h1>
 

      
    </header>
     
    <div class="article-meta">
      <a href="/2022/05/05/2.001.JMM-%E8%BF%90%E8%A1%8C%E6%97%B6%E6%95%B0%E6%8D%AE%E5%8C%BA%E5%9F%9F/" class="article-date">
  <time datetime="2022-05-04T16:00:00.000Z" itemprop="datePublished">2022-05-05</time>
</a> 
  <div class="article-category">
    <a class="article-category-link" href="/categories/JMM/">JMM</a>
  </div>
  
<div class="word_count">
    <span class="post-time">
        <span class="post-meta-item-icon">
            <i class="ri-quill-pen-line"></i>
            <span class="post-meta-item-text"> 字数统计:</span>
            <span class="post-count">3.6k</span>
        </span>
    </span>

    <span class="post-time">
        &nbsp; | &nbsp;
        <span class="post-meta-item-icon">
            <i class="ri-book-open-line"></i>
            <span class="post-meta-item-text"> 阅读时长≈</span>
            <span class="post-count">22 分钟</span>
        </span>
    </span>
</div>
 
    </div>
      
    <div class="tocbot"></div>




  
    <div class="article-entry" itemprop="articleBody">
       
  <h3 id="&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x57DF;"><a href="#&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x57DF;" class="headerlink" title="&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x57DF;"></a>&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x57DF;</h3><p>JVM&#x865A;&#x62DF;&#x673A;&#x5728;&#x6267;&#x884C; Java &#x7A0B;&#x5E8F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x628A;&#x5B83;&#x7BA1;&#x7406;&#x7684;&#x5185;&#x5B58;&#x5212;&#x5206;&#x6210;&#x82E5;&#x5E72;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x533A;&#x57DF;&#x3002;</p>
<p>java&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x5206;&#x4E3A;<code>&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;</code>&#x548C;<code>&#x7EBF;&#x7A0B;&#x79C1;&#x6709;</code>&#x4E24;&#x90E8;&#x5206;&#x3002;</p>
<span id="more"></span>
<ul>
<li>&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x90E8;&#x5206;&#xFF0C;jdk1.8&#x4E4B;&#x524D;&#x7684;&#x662F;&#xFF1A;&#x5806;&#x533A;&#x3001;&#x65B9;&#x6CD5;&#x533A;(&#x65B9;&#x6CD5;&#x533A;&#x6709;&#x5B57;&#x7B26;&#x4E32;&#x5E38;&#x91CF;&#x6C60;)&#x3001;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#xFF1B;jdk1.8&#x4EE5;&#x540E;&#x7684;&#x53EA;&#x6709;&#x5806;&#x533A;&#x548C;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#xFF1B;jdk1.8&#x540E;&#x7684;&#x65B9;&#x6CD5;&#x533A;&#x88AB;&#x79FB;&#x9664;&#xFF0C;&#x5728;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x4E2D;&#x589E;&#x52A0;&#x4E86;&#x4E2A;Meta&#x5143;&#x6570;&#x636E;&#x533A;&#xFF1B;</li>
<li>&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x90E8;&#x5206;&#xFF0C;&#x65E0;&#x8BBA;jdk1.8&#x4E4B;&#x524D;&#x8FD8;&#x662F;&#x4E4B;&#x540E;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x5206;&#x4E3A;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x3001;&#x865A;&#x62DF;&#x673A;&#x6808;&#x3001;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#xFF1B;</li>
</ul>
<p><strong>JDK 1.8 &#x4E4B;&#x524D;</strong>&#xFF1A;<br><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/2.001.JVM-%E8%BF%90%E8%A1%8C%E6%97%B6%E6%95%B0%E6%8D%AE%E5%8C%BA%E5%9F%9F/%E8%BF%90%E8%A1%8C%E6%97%B6%E5%86%85%E5%AD%98%E5%8C%BA%E5%9F%9F.png"></p>
<p><strong>JDK 1.8</strong>&#xFF1A;<br><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/2.001.JVM-%E8%BF%90%E8%A1%8C%E6%97%B6%E6%95%B0%E6%8D%AE%E5%8C%BA%E5%9F%9F/%E8%BF%90%E8%A1%8C%E6%97%B6%E5%86%85%E5%AD%98%E5%8C%BA%E5%9F%9F-1.8%E4%BB%A5%E5%90%8E.png"></p>
<ul>
<li>&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7684;<strong>&#x865A;&#x62DF;&#x673A;&#x6808;</strong>&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;<strong>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x3001;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x3001;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x3001;&#x65B9;&#x6CD5;&#x51FA;&#x53E3;&#x4FE1;&#x606F;</strong>&#x3002;</li>
<li>&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;<strong>&#x5806;&#x533A;</strong>&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x662F;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x57DF;&#x3002;&#x73B0;&#x4EE3;&#x7684;JVM&#x6536;&#x96C6;&#x5668;&#x90FD;&#x91C7;&#x7528;&#x5206;&#x4EE3;&#x7B97;&#x6CD5;&#x3002;</li>
<li>JDK7&#x4EE5;&#x53CA;&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5806;&#x5185;&#x5B58;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x4E3A;<strong>&#x5E74;&#x8F7B;&#x4EE3;&#x3001;&#x5E74;&#x8001;&#x4EE3;&#x3001;&#x6C38;&#x4E45;&#x4EE3;</strong>&#x3002;JDK8&#x4EE5;&#x540E;&#x7684;&#x65B9;&#x6CD5;&#x533A;&#xFF08;&#x6C38;&#x4E45;&#x4EE3;&#xFF09;&#x88AB;&#x79FB;&#x9664;&#x4E86;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#x5143;&#x7A7A;&#x95F4;&#xFF0C;&#x5143;&#x7A7A;&#x95F4;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x3002;</li>
<li>&#x5E74;&#x8F7B;&#x4EE3;&#x91CC;&#x9762;&#x518D;&#x7EC6;&#x5206;&#xFF0C;&#x5212;&#x5206;&#x4E3A;&#xFF1A;<code>Eden&#x533A;</code>&#x548C;<code>&#x4E24;&#x4E2A;Survivor&#x533A;</code>&#x3002;Eden&#x533A;&#x57DF;&#x548C;S0 S1&#x6807;&#x8BB0;&#x590D;&#x5236;&#x8FC7;&#x7A0B;&#xFF0C;&#x6682;&#x65F6;&#x7565;</li>
</ul>
<hr>
<h4 id="&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;"><a href="#&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;" class="headerlink" title="&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;"></a>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;</h4><p>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x662F;&#x4E00;&#x5757;&#x8F83;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x6240;&#x6267;&#x884C;&#x7684;&#x5B57;&#x8282;&#x7801;&#x7684;&#x884C;&#x53F7;&#x6307;&#x793A;&#x5668;&#x3002;<br><strong>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x4E2A;&#x4F5C;&#x7528;</strong>&#xFF1A;</p>
<ol>
<li>&#x5B57;&#x8282;&#x7801;&#x89E3;&#x91CA;&#x5668;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x6765;&#x4F9D;&#x6B21;&#x8BFB;&#x53D6;&#x6307;&#x4EE4;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x7684;&#x6D41;&#x7A0B;&#x63A7;&#x5236;&#xFF0C;&#x5982;&#xFF1A;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x3001;&#x9009;&#x62E9;&#x3001;&#x5FAA;&#x73AF;&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3002;</li>
<li>&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4ECE;&#x800C;&#x5F53;&#x7EBF;&#x7A0B;&#x88AB;&#x5207;&#x6362;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x77E5;&#x9053;&#x8BE5;&#x7EBF;&#x7A0B;&#x4E0A;&#x6B21;&#x8FD0;&#x884C;&#x5230;&#x54EA;&#x513F;&#x4E86;&#x3002;<br>&#x6CE8;&#x610F;&#xFF1A;<strong>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x662F;&#x552F;&#x4E00;&#x4E00;&#x4E2A;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0; OutOfMemoryError &#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x5B83;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x968F;&#x7740;&#x7EBF;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x800C;&#x521B;&#x5EFA;&#xFF0C;&#x968F;&#x7740;&#x7EBF;&#x7A0B;&#x7684;&#x7ED3;&#x675F;&#x800C;&#x6B7B;&#x4EA1;</strong>&#x3002;</li>
</ol>
<h4 id="&#x865A;&#x62DF;&#x673A;&#x6808;"><a href="#&#x865A;&#x62DF;&#x673A;&#x6808;" class="headerlink" title="&#x865A;&#x62DF;&#x673A;&#x6808;"></a>&#x865A;&#x62DF;&#x673A;&#x6808;</h4><p>&#x865A;&#x62DF;&#x673A;&#x6808;&#x4E5F;&#x662F;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x5B83;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x548C;&#x7EBF;&#x7A0B;&#x76F8;&#x540C;&#xFF0C;&#x63CF;&#x8FF0;&#x7684;&#x662F; Java &#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x6BCF;&#x6B21;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x6808;&#x4F20;&#x9012;&#x7684;&#x3002;</p>
<p><strong>Java &#x5185;&#x5B58;&#x53EF;&#x4EE5;&#x7C97;&#x7CD9;&#x7684;&#x533A;&#x5206;&#x4E3A;&#x5806;&#x5185;&#x5B58;&#xFF08;Heap&#xFF09;&#x548C;&#x6808;&#x5185;&#x5B58; (Stack),&#x5176;&#x4E2D;&#x6808;&#x5C31;&#x662F;&#x73B0;&#x5728;&#x8BF4;&#x7684;&#x865A;&#x62DF;&#x673A;&#x6808;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x865A;&#x62DF;&#x673A;&#x6808;&#x4E2D;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x90E8;&#x5206;</strong>&#x3002; &#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;Java <strong>&#x865A;&#x62DF;&#x673A;&#x6808;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x4E2A;&#x6808;&#x5E27;&#x7EC4;&#x6210;</strong>&#xFF0C;&#x800C;&#x6BCF;&#x4E2A;&#x6808;&#x5E27;&#x4E2D;&#x90FD;&#x62E5;&#x6709;&#xFF1A;<strong>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x3001;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x3001;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x3001;&#x65B9;&#x6CD5;&#x51FA;&#x53E3;&#x4FE1;&#x606F;</strong>&#x3002;&#xFF09;</p>
<p><strong>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x4E3B;&#x8981;&#x5B58;&#x653E;&#x4E86;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x77E5;&#x7684;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;</strong>&#xFF08;boolean&#x3001;byte&#x3001;char&#x3001;short&#x3001;int&#x3001;float&#x3001;long&#x3001;double&#xFF09;&#x3001;<strong>&#x5BF9;&#x8C61;&#x5F15;&#x7528;</strong>&#xFF08;reference &#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x4E0D;&#x540C;&#x4E8E;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x5BF9;&#x8C61;&#x8D77;&#x59CB;&#x5730;&#x5740;&#x7684;&#x5F15;&#x7528;&#x6307;&#x9488;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x5BF9;&#x8C61;&#x7684;&#x53E5;&#x67C4;&#x6216;&#x5176;&#x4ED6;&#x4E0E;&#x6B64;&#x5BF9;&#x8C61;&#x76F8;&#x5173;&#x7684;&#x4F4D;&#x7F6E;&#xFF09;&#x3002;</p>
<p>Java &#x865A;&#x62DF;&#x673A;&#x6808;&#x4F1A;&#x51FA;&#x73B0;&#x4E24;&#x79CD;&#x5F02;&#x5E38;&#xFF1A;<strong>StackOverFlowError</strong> &#x548C; <strong>OutOfMemoryError</strong>&#x3002;</p>
<ul>
<li><strong>StackOverFlowError</strong>&#xFF1A; &#x82E5; Java &#x865A;&#x62DF;&#x673A;&#x6808;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x4E0D;&#x5141;&#x8BB8;&#x52A8;&#x6001;&#x6269;&#x5C55;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x7EBF;&#x7A0B;&#x8BF7;&#x6C42;&#x6808;&#x7684;&#x6DF1;&#x5EA6;&#x8D85;&#x8FC7;&#x5F53;&#x524D; Java &#x865A;&#x62DF;&#x673A;&#x6808;&#x7684;&#x6700;&#x5927;&#x6DF1;&#x5EA6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x629B;&#x51FA; StackOverFlowError &#x5F02;&#x5E38;&#x3002;</li>
<li><strong>OutOfMemoryError</strong>&#xFF1A; &#x82E5; Java &#x865A;&#x62DF;&#x673A;&#x6808;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x5141;&#x8BB8;&#x52A8;&#x6001;&#x6269;&#x5C55;&#xFF0C;&#x4E14;&#x5F53;&#x7EBF;&#x7A0B;&#x8BF7;&#x6C42;&#x6808;&#x65F6;&#x5185;&#x5B58;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x65E0;&#x6CD5;&#x518D;&#x52A8;&#x6001;&#x6269;&#x5C55;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x629B;&#x51FA; OutOfMemoryError &#x5F02;&#x5E38;&#x3002;<br>Java &#x865A;&#x62DF;&#x673A;&#x6808;&#x4E5F;&#x662F;&#x7EBF;&#x7A0B;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684; Java &#x865A;&#x62DF;&#x673A;&#x6808;&#xFF0C;&#x800C;&#x4E14;&#x968F;&#x7740;&#x7EBF;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x800C;&#x521B;&#x5EFA;&#xFF0C;&#x968F;&#x7740;&#x7EBF;&#x7A0B;&#x7684;&#x6B7B;&#x4EA1;&#x800C;&#x6B7B;&#x4EA1;&#x3002;</li>
</ul>
<p><strong>&#x90A3;&#x4E48;&#x65B9;&#x6CD5;/&#x51FD;&#x6570;&#x5982;&#x4F55;&#x8C03;&#x7528;&#xFF1F;</strong></p>
<p>Java &#x6808;&#x53EF;&#x7528;&#x7C7B;&#x6BD4;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x6808;&#xFF0C;Java &#x6808;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x662F;&#x6808;&#x5E27;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;&#x6808;&#x5E27;&#x88AB;&#x538B;&#x5165; Java &#x6808;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#x88AB;&#x5F39;&#x51FA;&#x3002;</p>
<p>Java &#x65B9;&#x6CD5;&#x6709;&#x4E24;&#x79CD;&#x8FD4;&#x56DE;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li>return &#x8BED;&#x53E5;&#x3002;</li>
<li>&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;</li>
</ul>
<p>&#x4E0D;&#x7BA1;&#x54EA;&#x79CD;&#x8FD4;&#x56DE;&#x65B9;&#x5F0F;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6808;&#x5E27;&#x88AB;&#x5F39;&#x51FA;&#x3002;</p>
<h4 id="&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;"><a href="#&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;" class="headerlink" title="&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;"></a>&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;</h4><p>&#x548C;&#x865A;&#x62DF;&#x673A;&#x6808;&#x6240;&#x53D1;&#x6325;&#x7684;&#x4F5C;&#x7528;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x533A;&#x522B;&#x662F;&#xFF1A; <strong>&#x865A;&#x62DF;&#x673A;&#x6808;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C; Java &#x65B9;&#x6CD5; &#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5B57;&#x8282;&#x7801;&#xFF09;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#x5219;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x4F7F;&#x7528;&#x5230;&#x7684; Native &#x65B9;&#x6CD5;&#x670D;&#x52A1;</strong>&#x3002; &#x5728; HotSpot &#x865A;&#x62DF;&#x673A;&#x4E2D;&#x548C; Java &#x865A;&#x62DF;&#x673A;&#x6808;&#x5408;&#x4E8C;&#x4E3A;&#x4E00;&#x3002;</p>
<p>&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x88AB;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;&#x4E5F;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x8BE5;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8868;&#x3001;&#x64CD;&#x4F5C;&#x6570;&#x6808;&#x3001;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x3001;&#x51FA;&#x53E3;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#x76F8;&#x5E94;&#x7684;&#x6808;&#x5E27;&#x4E5F;&#x4F1A;&#x51FA;&#x6808;&#x5E76;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0; StackOverFlowError &#x548C; OutOfMemoryError &#x4E24;&#x79CD;&#x5F02;&#x5E38;&#x3002;</p>
<h4 id="&#x5806;"><a href="#&#x5806;" class="headerlink" title="&#x5806;"></a>&#x5806;</h4><p>Java &#x865A;&#x62DF;&#x673A;&#x6240;&#x7BA1;&#x7406;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x4E00;&#x5757;&#xFF0C;Java &#x5806;&#x662F;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x5728;&#x865A;&#x62DF;&#x673A;&#x542F;&#x52A8;&#x65F6;&#x521B;&#x5EFA;&#x3002;<strong>&#x6B64;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x7684;&#x552F;&#x4E00;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x5B58;&#x653E;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x4EE5;&#x53CA;&#x6570;&#x7EC4;&#x90FD;&#x5728;&#x8FD9;&#x91CC;&#x5206;&#x914D;&#x5185;&#x5B58;</strong>&#x3002;</p>
<p>Java &#x5806;&#x662F;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7BA1;&#x7406;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x57DF;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x88AB;&#x79F0;&#x4F5C;<strong>GC &#x5806;&#xFF08;Garbage Collected Heap&#xFF09;</strong> &#x3002;&#x4ECE;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x7531;&#x4E8E;&#x73B0;&#x5728;&#x6536;&#x96C6;&#x5668;&#x57FA;&#x672C;&#x90FD;&#x91C7;&#x7528;&#x5206;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5; Java &#x5806;&#x8FD8;&#x53EF;&#x4EE5;&#x7EC6;&#x5206;&#x4E3A;&#xFF1A;&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#xFF1A;&#x518D;&#x7EC6;&#x81F4;&#x4E00;&#x70B9;&#x6709;&#xFF1A;Eden &#x7A7A;&#x95F4;&#x3001;From Survivor&#x3001;To Survivor &#x7A7A;&#x95F4;&#x7B49;&#x3002;&#x8FDB;&#x4E00;&#x6B65;&#x5212;&#x5206;&#x7684;&#x76EE;&#x7684;&#x662F;&#x66F4;&#x597D;&#x5730;&#x56DE;&#x6536;&#x5185;&#x5B58;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x5FEB;&#x5730;&#x5206;&#x914D;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x5728; JDK 7 &#x7248;&#x672C;&#x53CA;JDK 7 &#x7248;&#x672C;&#x4E4B;&#x524D;&#xFF0C;&#x5806;&#x5185;&#x5B58;&#x88AB;&#x901A;&#x5E38;&#x88AB;&#x5206;&#x4E3A;&#x4E0B;&#x9762;&#x4E09;&#x90E8;&#x5206;&#xFF1A;</p>
<ol>
<li>&#x65B0;&#x751F;&#x4EE3;&#x5185;&#x5B58;(Young Ceneration)</li>
<li>&#x8001;&#x751F;&#x4EE3;(Old Generation)</li>
<li>&#x6C38;&#x751F;&#x4EE3;(Permanent Generation)</li>
</ol>
<p><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/2.001.JVM-%E8%BF%90%E8%A1%8C%E6%97%B6%E6%95%B0%E6%8D%AE%E5%8C%BA%E5%9F%9F/1.jpg"></p>
<p>JDK 8 &#x7248;&#x672C;&#x4E4B;&#x540E;&#x65B9;&#x6CD5;&#x533A;&#xFF08;HotSpot &#x7684;&#x6C38;&#x4E45;&#x4EE3;&#xFF09;&#x88AB;&#x5F7B;&#x5E95;&#x79FB;&#x9664;&#x4E86;&#xFF08;JDK1.7 &#x5C31;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4E86;&#xFF09;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x662F;&#x5143;&#x7A7A;&#x95F4;&#xFF0C;&#x5143;&#x7A7A;&#x95F4;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/2.001.JVM-%E8%BF%90%E8%A1%8C%E6%97%B6%E6%95%B0%E6%8D%AE%E5%8C%BA%E5%9F%9F/2.jpg"></p>
<p><strong>&#x4E0A;&#x56FE;&#x6240;&#x793A;&#x7684; Eden &#x533A;&#x3001;&#x4E24;&#x4E2A; Survivor &#x533A;&#x90FD;&#x5C5E;&#x4E8E;&#x65B0;&#x751F;&#x4EE3;&#xFF08;&#x4E3A;&#x4E86;&#x533A;&#x5206;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A; Survivor &#x533A;&#x57DF;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x88AB;&#x547D;&#x540D;&#x4E3A; from &#x548C; to&#xFF09;&#xFF0C;&#x4E2D;&#x95F4;&#x4E00;&#x5C42;&#x5C5E;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x3002;</strong></p>
<p>&#x5806;&#x8FD9;&#x91CC;&#x6700;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x7684;&#x5C31;&#x662F; OutOfMemoryError &#x5F02;&#x5E38;&#xFF0C;&#x5E76;&#x4E14;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x4E4B;&#x540E;&#x7684;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x8FD8;&#x4F1A;&#x6709;&#x51E0;&#x79CD;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ol>
<li><strong>OutOfMemoryError: GC Overhead Limit Exceeded</strong> &#xFF1A; &#x5F53;JVM&#x82B1;&#x592A;&#x591A;&#x65F6;&#x95F4;&#x6267;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5E76;&#x4E14;&#x53EA;&#x80FD;&#x56DE;&#x6536;&#x5F88;&#x5C11;&#x7684;&#x5806;&#x7A7A;&#x95F4;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x6B64;&#x9519;&#x8BEF;&#x3002;</li>
<li><strong>java.lang.OutOfMemoryError: Java heap space</strong> :&#x5047;&#x5982;&#x5728;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x65F6;, &#x5806;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;&#x4EE5;&#x5B58;&#x653E;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;, &#x5C31;&#x4F1A;&#x5F15;&#x53D1;<strong>java.lang.OutOfMemoryError: Java heap space</strong> &#x9519;&#x8BEF;&#x3002;(&#x548C;&#x672C;&#x673A;&#x7269;&#x7406;&#x5185;&#x5B58;&#x65E0;&#x5173;&#xFF0C;&#x548C;&#x4F60;&#x914D;&#x7F6E;&#x7684;&#x5BF9;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x6709;&#x5173;&#xFF01;)</li>
<li>&#x2026;&#x2026;</li>
</ol>
<h4 id="&#x65B9;&#x6CD5;&#x533A;"><a href="#&#x65B9;&#x6CD5;&#x533A;" class="headerlink" title="&#x65B9;&#x6CD5;&#x533A;"></a>&#x65B9;&#x6CD5;&#x533A;</h4><p>&#x65B9;&#x6CD5;&#x533A;&#x4E0E; Java &#x5806;&#x4E00;&#x6837;&#xFF0C;&#x662F;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5DF2;&#x88AB;&#x865A;&#x62DF;&#x673A;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x4FE1;&#x606F;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x3001;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x7B49;&#x6570;&#x636E;&#x3002;&#x867D;&#x7136; Java &#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x628A;&#x65B9;&#x6CD5;&#x533A;&#x63CF;&#x8FF0;&#x4E3A;&#x5806;&#x7684;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5374;&#x6709;&#x4E00;&#x4E2A;&#x522B;&#x540D;&#x53EB;&#x505A; Non-Heap&#xFF08;&#x975E;&#x5806;&#xFF09;&#xFF0C;&#x76EE;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x4E0E; Java &#x5806;&#x533A;&#x5206;&#x5F00;&#x6765;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x533A;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x6C38;&#x4E45;&#x4EE3;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x4F1A;&#x5206;&#x4E0D;&#x6E05;&#x65B9;&#x6CD5;&#x533A;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5173;&#x7CFB;&#xFF1A;</p>
<h5 id="&#x65B9;&#x6CD5;&#x533A;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5173;&#x7CFB;"><a href="#&#x65B9;&#x6CD5;&#x533A;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5173;&#x7CFB;" class="headerlink" title="&#x65B9;&#x6CD5;&#x533A;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5173;&#x7CFB;"></a>&#x65B9;&#x6CD5;&#x533A;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5173;&#x7CFB;</h5><blockquote>
<p>&#x300A;Java &#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x300B;&#x53EA;&#x662F;&#x89C4;&#x5B9A;&#x4E86;&#x6709;&#x65B9;&#x6CD5;&#x533A;&#x8FD9;&#x4E48;&#x4E2A;&#x6982;&#x5FF5;&#x548C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x89C4;&#x5B9A;&#x5982;&#x4F55;&#x53BB;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684; JVM &#x4E0A;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x5B9E;&#x73B0;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x4E86;&#x3002; &#x65B9;&#x6CD5;&#x533A;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5173;&#x7CFB;&#x5F88;&#x50CF; Java &#x4E2D;&#x63A5;&#x53E3;&#x548C;&#x7C7B;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x7C7B;&#x5B9E;&#x73B0;&#x4E86;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x6C38;&#x4E45;&#x4EE3;&#x5C31;&#x662F; HotSpot &#x865A;&#x62DF;&#x673A;&#x5BF9;&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E2D;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002; &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6C38;&#x4E45;&#x4EE3;&#x662F; HotSpot &#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x65B9;&#x6CD5;&#x533A;&#x662F; Java &#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E2D;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x89C4;&#x8303;&#xFF0C;&#x800C;&#x6C38;&#x4E45;&#x4EE3;&#x662F;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x6807;&#x51C6;&#x4E00;&#x4E2A;&#x662F;&#x5B9E;&#x73B0;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x865A;&#x62DF;&#x673A;&#x5B9E;&#x73B0;&#x5E76;&#x6CA1;&#x6709;&#x6C38;&#x4E45;&#x4EE3;&#x8FD9;&#x4E00;&#x8BF4;&#x6CD5;&#x3002;</p>
</blockquote>
<h5 id="&#x5E38;&#x7528;&#x53C2;&#x6570;"><a href="#&#x5E38;&#x7528;&#x53C2;&#x6570;" class="headerlink" title="&#x5E38;&#x7528;&#x53C2;&#x6570;"></a>&#x5E38;&#x7528;&#x53C2;&#x6570;</h5><p>JDK 1.8 &#x4E4B;&#x524D;&#x6C38;&#x4E45;&#x4EE3;&#x8FD8;&#x6CA1;&#x88AB;&#x5F7B;&#x5E95;&#x79FB;&#x9664;&#x7684;&#x65F6;&#x5019;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x6765;&#x8C03;&#x8282;&#x65B9;&#x6CD5;&#x533A;&#x5927;&#x5C0F;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">-XX:PermSize=N //&#x65B9;&#x6CD5;&#x533A; (&#x6C38;&#x4E45;&#x4EE3;) &#x521D;&#x59CB;&#x5927;&#x5C0F;</span><br><span class="line">-XX:MaxPermSize=N //&#x65B9;&#x6CD5;&#x533A; (&#x6C38;&#x4E45;&#x4EE3;) &#x6700;&#x5927;&#x5927;&#x5C0F;,&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x503C;&#x5C06;&#x4F1A;&#x629B;&#x51FA; OutOfMemoryError &#x5F02;&#x5E38;:java.lang.OutOfMemoryError: PermGen</span><br></pre></td></tr></table></figure>

<p>&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x884C;&#x4E3A;&#x5728;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x662F;&#x6BD4;&#x8F83;&#x5C11;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x6570;&#x636E;&#x8FDB;&#x5165;&#x65B9;&#x6CD5;&#x533A;&#x540E;&#x5C31;&#x201C;&#x6C38;&#x4E45;&#x5B58;&#x5728;&#x201D;&#x4E86;&#x3002;</p>
<p>JDK 1.8 &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x65B9;&#x6CD5;&#x533A;&#xFF08;HotSpot &#x7684;&#x6C38;&#x4E45;&#x4EE3;&#xFF09;&#x88AB;&#x5F7B;&#x5E95;&#x79FB;&#x9664;&#x4E86;&#xFF08;JDK1.7 &#x5C31;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4E86;&#xFF09;&#xFF0C;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x662F;&#x5143;&#x7A7A;&#x95F4;&#xFF0C;&#x5143;&#x7A7A;&#x95F4;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x53C2;&#x6570;&#xFF1A;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">-XX:MetaspaceSize=N //&#x8BBE;&#x7F6E; Metaspace &#x7684;&#x521D;&#x59CB;&#xFF08;&#x548C;&#x6700;&#x5C0F;&#x5927;&#x5C0F;&#xFF09;</span><br><span class="line">-XX:MaxMetaspaceSize=N //&#x8BBE;&#x7F6E; Metaspace &#x7684;&#x6700;&#x5927;&#x5927;&#x5C0F;</span><br></pre></td></tr></table></figure>

<p>&#x4E0E;&#x6C38;&#x4E45;&#x4EE3;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6307;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x8BDD;&#xFF0C;&#x968F;&#x7740;&#x66F4;&#x591A;&#x7C7B;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x4F1A;&#x8017;&#x5C3D;&#x6240;&#x6709;&#x53EF;&#x7528;&#x7684;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x3002;</p>
<h5 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5C06;&#x6C38;&#x4E45;&#x4EE3;-PermGen-&#x66FF;&#x6362;&#x4E3A;&#x5143;&#x7A7A;&#x95F4;-MetaSpace-&#x5462;"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5C06;&#x6C38;&#x4E45;&#x4EE3;-PermGen-&#x66FF;&#x6362;&#x4E3A;&#x5143;&#x7A7A;&#x95F4;-MetaSpace-&#x5462;" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5C06;&#x6C38;&#x4E45;&#x4EE3; (PermGen) &#x66FF;&#x6362;&#x4E3A;&#x5143;&#x7A7A;&#x95F4; (MetaSpace) &#x5462;?"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5C06;&#x6C38;&#x4E45;&#x4EE3; (PermGen) &#x66FF;&#x6362;&#x4E3A;&#x5143;&#x7A7A;&#x95F4; (MetaSpace) &#x5462;?</h5><p>&#x6574;&#x4E2A;&#x6C38;&#x4E45;&#x4EE3;&#x6709;&#x4E00;&#x4E2A; JVM &#x672C;&#x8EAB;&#x8BBE;&#x7F6E;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x4E0A;&#x9650;&#xFF0C;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x800C;&#x5143;&#x7A7A;&#x95F4;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#xFF0C;&#x53D7;&#x672C;&#x673A;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5F97;&#x5230; java.lang.OutOfMemoryError&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; -XX&#xFF1A;MaxMetaspaceSize &#x6807;&#x5FD7;&#x8BBE;&#x7F6E;&#x6700;&#x5927;&#x5143;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A; unlimited&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x53EA;&#x53D7;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x7684;&#x9650;&#x5236;&#x3002;-XX&#xFF1A;MetaspaceSize &#x8C03;&#x6574;&#x6807;&#x5FD7;&#x5B9A;&#x4E49;&#x5143;&#x7A7A;&#x95F4;&#x7684;&#x521D;&#x59CB;&#x5927;&#x5C0F;&#x5982;&#x679C;&#x672A;&#x6307;&#x5B9A;&#x6B64;&#x6807;&#x5FD7;&#xFF0C;&#x5219; Metaspace &#x5C06;&#x6839;&#x636E;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x6C42;&#x52A8;&#x6001;&#x5730;&#x91CD;&#x65B0;&#x8C03;&#x6574;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x8FD9;&#x53EA;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5E95;&#x5C42;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6682;&#x65F6;&#x6CA1;&#x7814;&#x7A76;&#x3002;</p>
<h5 id="&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;"><a href="#&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;" class="headerlink" title="&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;"></a>&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;</h5><p>&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;&#x662F;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;Class &#x6587;&#x4EF6;&#x4E2D;&#x9664;&#x4E86;&#x6709;&#x7C7B;&#x7684;&#x7248;&#x672C;&#x3001;&#x5B57;&#x6BB5;&#x3001;&#x65B9;&#x6CD5;&#x3001;&#x63A5;&#x53E3;&#x7B49;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x5E38;&#x91CF;&#x6C60;&#x4FE1;&#x606F;&#xFF08;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x7F16;&#x8BD1;&#x671F;&#x751F;&#x6210;&#x7684;&#x5404;&#x79CD;&#x5B57;&#x9762;&#x91CF;&#x548C;&#x7B26;&#x53F7;&#x5F15;&#x7528;&#xFF09;</p>
<p>&#x65E2;&#x7136;&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;&#x662F;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x81EA;&#x7136;&#x53D7;&#x5230;&#x65B9;&#x6CD5;&#x533A;&#x5185;&#x5B58;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5F53;&#x5E38;&#x91CF;&#x6C60;&#x65E0;&#x6CD5;&#x518D;&#x7533;&#x8BF7;&#x5230;&#x5185;&#x5B58;&#x65F6;&#x4F1A;&#x629B;&#x51FA; OutOfMemoryError &#x5F02;&#x5E38;&#x3002;</p>
<p>JDK1.7 &#x53CA;&#x4E4B;&#x540E;&#x7248;&#x672C;&#x7684; JVM &#x5DF2;&#x7ECF;&#x5C06;&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;&#x4ECE;&#x65B9;&#x6CD5;&#x533A;&#x4E2D;&#x79FB;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x5728; Java &#x5806;&#xFF08;Heap&#xFF09;&#x4E2D;&#x5F00;&#x8F9F;&#x4E86;&#x4E00;&#x5757;&#x533A;&#x57DF;&#x5B58;&#x653E;&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x6C60;</p>
<p><img src="https://cdn.jsdelivr.net/gh/XugangXie/xxg-img-repo@main/2.001.JVM-%E8%BF%90%E8%A1%8C%E6%97%B6%E6%95%B0%E6%8D%AE%E5%8C%BA%E5%9F%9F/3.jpg"></p>
<h4 id="&#x76F4;&#x63A5;&#x5185;&#x5B58;"><a href="#&#x76F4;&#x63A5;&#x5185;&#x5B58;" class="headerlink" title="&#x76F4;&#x63A5;&#x5185;&#x5B58;"></a>&#x76F4;&#x63A5;&#x5185;&#x5B58;</h4><p><strong>&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x5E76;&#x4E0D;&#x662F;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5B58;&#x4E5F;&#x88AB;&#x9891;&#x7E41;&#x5730;&#x4F7F;&#x7528;&#x3002;&#x800C;&#x4E14;&#x4E5F;&#x53EF;&#x80FD;&#x5BFC;&#x81F4; OutOfMemoryError &#x5F02;&#x5E38;&#x51FA;&#x73B0;&#x3002;</strong></p>
<p>JDK1.4 &#x4E2D;&#x65B0;&#x52A0;&#x5165;&#x7684; <strong>NIO(New Input/Output) &#x7C7B;</strong>&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;<strong>&#x901A;&#x9053;&#xFF08;Channel&#xFF09;</strong> &#x4E0E;<strong>&#x7F13;&#x5B58;&#x533A;&#xFF08;Buffer&#xFF09;</strong> &#x7684; I/O &#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528; Native &#x51FD;&#x6570;&#x5E93;&#x76F4;&#x63A5;&#x5206;&#x914D;&#x5806;&#x5916;&#x5185;&#x5B58;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x5728; Java &#x5806;&#x4E2D;&#x7684; DirectByteBuffer &#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x8FD9;&#x5757;&#x5185;&#x5B58;&#x7684;&#x5F15;&#x7528;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x5728;&#x4E00;&#x4E9B;&#x573A;&#x666F;&#x4E2D;&#x663E;&#x8457;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;<strong>&#x907F;&#x514D;&#x4E86;&#x5728; Java &#x5806;&#x548C; Native &#x5806;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x590D;&#x5236;&#x6570;&#x636E;</strong>&#x3002;</p>
<p>&#x672C;&#x673A;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#x4E0D;&#x4F1A;&#x53D7;&#x5230; Java &#x5806;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x65E2;&#x7136;&#x662F;&#x5185;&#x5B58;&#x5C31;&#x4F1A;&#x53D7;&#x5230;&#x672C;&#x673A;&#x603B;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x4EE5;&#x53CA;&#x5904;&#x7406;&#x5668;&#x5BFB;&#x5740;&#x7A7A;&#x95F4;&#x7684;&#x9650;&#x5236;&#x3002;</p>
<hr>
<blockquote>
<p>java8&#x4E4B;&#x5143;&#x7A7A;&#x95F4;&#xFF08;Metaspace&#xFF09;:<a target="_blank" rel="noopener" href="https://blog.csdn.net/weixin_38308374/article/details/110679083">https://blog.csdn.net/weixin_38308374/article/details/110679083</a></p>
</blockquote>
<p>&#x4ECE;java7&#x5F00;&#x59CB;&#xFF0C;&#x539F;&#x6765;&#x5B58;&#x50A8;&#x4E8E;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x6570;&#x636E;&#x5C31;&#x4E0D;&#x65AD;&#x7684;&#x88AB;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#xFF0C;&#x6709;&#x4E0D;&#x5C11;&#x6570;&#x636E;&#x90FD;&#x79FB;&#x52A8;&#x5230;&#x4E86;&#x5806;&#x533A;&#xFF0C;&#x6BD4;&#x5982;&#x5B57;&#x7B26;&#x4E32;&#x5E38;&#x91CF;&#x6C60;&#x632A;&#x5230;&#x4E86;&#x5806;&#x533A;&#xFF0C;&#x5728;java8&#x6700;&#x7EC8;&#x5C06;&#x6C38;&#x4E45;&#x4EE3;&#x79FB;&#x9664;&#xFF0C;&#x53E6;&#x5916;&#x65B0;&#x589E;&#x4E86;&#x4E00;&#x4E2A;&#x533A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5143;&#x7A7A;&#x95F4;&#xFF08;Metaspace&#xFF09;&#xFF0C;&#x5143;&#x7A7A;&#x95F4;&#x627F;&#x63A5;&#x4E86;&#x90E8;&#x5206;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6C38;&#x4E45;&#x4EE3;&#x66F4;&#x89C4;&#x8303;&#x7684;&#x540D;&#x5B57;&#x7684;&#x53EB;&#x505A;&#x65B9;&#x6CD5;&#x533A;&#xFF0C;<strong>&#x6C38;&#x4E45;&#x4EE3;&#x662F;&#x65B9;&#x6CD5;&#x533A;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x65B9;&#x6CD5;&#x533A;&#x662F;java&#x89C4;&#x8303;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x53EA;&#x6709;hotspot&#x624D;&#x6709;&#x6C38;&#x4E45;&#x4EE3;</strong>&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x53EB;&#x5B83;&#x6C38;&#x4E45;&#x4EE3;&#x662F;&#x56E0;&#x4E3A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6548;&#x679C;&#x5F88;&#x5DEE;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x76F4;&#x5230;&#x7A0B;&#x5E8F;&#x505C;&#x6B62;&#x8FD0;&#x884C;&#x3002;<br>&#x6C38;&#x4E45;&#x4EE3;&#x91CC;&#x9762;&#x4E00;&#x822C;&#x5B58;&#x50A8;&#x7C7B;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x7C7B;&#x5E38;&#x91CF;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x5E38;&#x91CF;&#x3001;&#x65B9;&#x6CD5;&#x4EE3;&#x7801;&#x3001;&#x7C7B;&#x7684;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x7B49;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x56DE;&#x6536;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x7C7B;&#x5378;&#x8F7D;&#xFF0C;&#x800C;&#x7C7B;&#x5378;&#x8F7D;&#x7684;&#x6761;&#x4EF6;&#x975E;&#x5E38;&#x82DB;&#x523B;&#xFF0C;&#x6240;&#x4EE5;&#x7A7A;&#x95F4;&#x4E00;&#x822C;&#x56DE;&#x6536;&#x5F88;&#x96BE;&#x3002;&#x5F53;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;&#x5927;&#x91CF;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7C7B;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x4FE1;&#x606F;&#x90FD;&#x8981;&#x5B58;&#x50A8;&#x5230;&#x6C38;&#x4E45;&#x4EE3;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x65B9;&#x6CD5;&#x533A;&#x6EA2;&#x51FA;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x533A;&#x548C;&#x5143;&#x7A7A;&#x95F4;&#x6700;&#x5927;&#x533A;&#x522B;&#x662F;&#xFF1A;&#x5143;&#x7A7A;&#x95F4;&#x5E76;&#x4E0D;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x5185;&#x5B58;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5143;&#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#x4EC5;&#x53D7;&#x672C;&#x5730;&#x5185;&#x5B58;&#x9650;&#x5236;</p>
<p>&#x5C3D;&#x7BA1;&#x6CA1;&#x6709;&#x4E86;PermGen error&#x5F02;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x7C7B;&#x7684;&#x4FE1;&#x606F;&#x5B58;&#x653E;&#x5728;&#x5143;&#x7A7A;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5143;&#x7A7A;&#x95F4;&#x8BBE;&#x7F6E;&#x7684;&#x8FC7;&#x5C0F;&#xFF0C;&#x800C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x52A0;&#x8F7D;&#x5F88;&#x591A;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x662F;&#x4F1A;&#x9020;&#x6210;&#x5143;&#x7A7A;&#x95F4;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#xFF0C;&#x6BD4;&#x5982;&#x4F1A;&#x62A5;&#x5982;&#x4E0B;&#x5F02;&#x5E38;&#xFF1A;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">Caused by: java.lang.OutOfMemoryError: Metaspace</span><br></pre></td></tr></table></figure>

<hr>
<p>&#x5728;java8&#x4E2D;&#xFF0C;<code>&#x7B26;&#x53F7;&#x5F15;&#x7528;</code>&#x5B58;&#x50A8;&#x5728;<code>native heap</code>&#x4E2D;&#xFF0C;<code>&#x5B57;&#x7B26;&#x4E32;&#x5E38;&#x91CF;</code>&#x548C;<code>&#x9759;&#x6001;&#x7C7B;&#x578B;</code>&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x5728;&#x666E;&#x901A;&#x7684;<code>&#x5806;&#x533A;</code>&#x4E2D;&#x3002;</p>
<hr>
<blockquote>
<p>&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x5806;&#x5916;&#x5185;&#x5B58; Metaspace:<a target="_blank" rel="noopener" href="https://javadoop.com/post/metaspace">https://javadoop.com/post/metaspace</a></p>
</blockquote>
 
      <!-- reward -->
      
    </div>
    

    <!-- copyright -->
    
    <footer class="article-footer">
       
  <ul class="article-tag-list" itemprop="keywords"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/%E5%86%85%E5%AD%98%E6%A8%A1%E5%9E%8B/" rel="tag">内存模型</a></li></ul>

    </footer>
  </div>

   
  <nav class="article-nav">
    
      <a href="/2022/05/05/2.002.JMM-Java%E5%AF%B9%E8%B1%A1%E7%9A%84%E5%86%85%E5%AD%98%E5%88%86%E9%85%8D%E8%BF%87%E7%A8%8B%E6%98%AF%E5%A6%82%E4%BD%95%E4%BF%9D%E8%AF%81%E7%BA%BF%E7%A8%8B%E5%AE%89%E5%85%A8%E7%9A%84/" class="article-nav-link">
        <strong class="article-nav-caption">上一篇</strong>
        <div class="article-nav-title">
          
            JMM-Java对象的内存分配过程是如何保证线程安全的
          
        </div>
      </a>
    
    
      <a href="/2022/05/05/2.003.JMM-%E5%AF%B9%E8%B1%A1%E7%9A%84%E8%AE%BF%E9%97%AE%E5%AE%9A%E4%BD%8D%E7%9A%84%E4%B8%A4%E7%A7%8D%E6%96%B9%E5%BC%8F/" class="article-nav-link">
        <strong class="article-nav-caption">下一篇</strong>
        <div class="article-nav-title">JMM-对象的访问定位的两种方式</div>
      </a>
    
  </nav>

  
   
    
    <script src="https://cdn.staticfile.org/twikoo/1.4.18/twikoo.all.min.js"></script>
    <div id="twikoo" class="twikoo"></div>
    <script>
        twikoo.init({
            envId: ""
        })
    </script>
 
</article>

</section>
      <footer class="footer">
  <div class="outer">
    <ul>
      <li>
        Copyrights &copy;
        2015-2023
        <i class="ri-heart-fill heart_icon"></i> xugang.xie
      </li>
    </ul>
    <ul>
      <li>
        
      </li>
    </ul>
    <ul>
      <li>
        
        
        <span>
  <span><i class="ri-user-3-fill"></i>访问人数:<span id="busuanzi_value_site_uv"></span></span>
  <span class="division">|</span>
  <span><i class="ri-eye-fill"></i>浏览次数:<span id="busuanzi_value_page_pv"></span></span>
</span>
        
      </li>
    </ul>
    <ul>
      
    </ul>
    <ul>
      
    </ul>
    <ul>
      <li>
        <!-- cnzz统计 -->
        
        <script type="text/javascript" src='https://s9.cnzz.com/z_stat.php?id=1278069914&amp;web_id=1278069914'></script>
        
      </li>
    </ul>
  </div>
</footer>    
    </main>
    <div class="float_btns">
      <div class="totop" id="totop">
  <i class="ri-arrow-up-line"></i>
</div>

<div class="todark" id="todark">
  <i class="ri-moon-line"></i>
</div>

    </div>
    <aside class="sidebar on">
      <button class="navbar-toggle"></button>
<nav class="navbar">
  
  <div class="logo">
    <a href="/"><img src="/images/ayer-side.svg" alt="xugang.xie&#39;s blog"></a>
  </div>
  
  <ul class="nav nav-main">
    
    <li class="nav-item">
      <a class="nav-item-link" href="/">主页</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/archives">归档</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/categories">分类</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/tags">标签</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/friends">友链</a>
    </li>
    
    <li class="nav-item">
      <a class="nav-item-link" href="/about">关于我</a>
    </li>
    
  </ul>
</nav>
<nav class="navbar navbar-bottom">
  <ul class="nav">
    <li class="nav-item">
      
      <a class="nav-item-link nav-item-search"  title="搜索">
        <i class="ri-search-line"></i>
      </a>
      
      
      <a class="nav-item-link" target="_blank" href="/atom.xml" title="RSS Feed">
        <i class="ri-rss-line"></i>
      </a>
      
    </li>
  </ul>
</nav>
<div class="search-form-wrap">
  <div class="local-search local-search-plugin">
  <input type="search" id="local-search-input" class="local-search-input" placeholder="Search...">
  <div id="local-search-result" class="local-search-result"></div>
</div>
</div>
    </aside>
    <div id="mask"></div>

<!-- #reward -->
<div id="reward">
  <span class="close"><i class="ri-close-line"></i></span>
  <p class="reward-p"><i class="ri-cup-line"></i>请我喝杯咖啡吧~</p>
  <div class="reward-box">
    
    <div class="reward-item">
      <img class="reward-img" src="/images/alipay.jpg">
      <span class="reward-type">支付宝</span>
    </div>
    
    
    <div class="reward-item">
      <img class="reward-img" src="/images/wechat.jpg">
      <span class="reward-type">微信</span>
    </div>
    
  </div>
</div>
    
<script src="/js/jquery-3.6.0.min.js"></script>
 
<script src="/js/lazyload.min.js"></script>

<!-- Tocbot -->
 
<script src="/js/tocbot.min.js"></script>

<script>
  tocbot.init({
    tocSelector: ".tocbot",
    contentSelector: ".article-entry",
    headingSelector: "h1, h2, h3, h4, h5, h6",
    hasInnerContainers: true,
    scrollSmooth: true,
    scrollContainer: "main",
    positionFixedSelector: ".tocbot",
    positionFixedClass: "is-position-fixed",
    fixedSidebarOffset: "auto",
  });
</script>

<script src="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.js"></script>
<link
  rel="stylesheet"
  href="https://cdn.staticfile.org/jquery-modal/0.9.2/jquery.modal.min.css"
/>
<script src="https://cdn.staticfile.org/justifiedGallery/3.8.1/js/jquery.justifiedGallery.min.js"></script>

<script src="/dist/main.js"></script>

<!-- ImageViewer -->
 <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                        <div class="pswp__preloader__cut">
                            <div class="pswp__preloader__donut"></div>
                        </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div>
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>

<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.css">
<link rel="stylesheet" href="https://cdn.staticfile.org/photoswipe/4.1.3/default-skin/default-skin.min.css">
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe.min.js"></script>
<script src="https://cdn.staticfile.org/photoswipe/4.1.3/photoswipe-ui-default.min.js"></script>

<script>
    function viewer_init() {
        let pswpElement = document.querySelectorAll('.pswp')[0];
        let $imgArr = document.querySelectorAll(('.article-entry img:not(.reward-img)'))

        $imgArr.forEach(($em, i) => {
            $em.onclick = () => {
                // slider展开状态
                // todo: 这样不好，后面改成状态
                if (document.querySelector('.left-col.show')) return
                let items = []
                $imgArr.forEach(($em2, i2) => {
                    let img = $em2.getAttribute('data-idx', i2)
                    let src = $em2.getAttribute('data-target') || $em2.getAttribute('src')
                    let title = $em2.getAttribute('alt')
                    // 获得原图尺寸
                    const image = new Image()
                    image.src = src
                    items.push({
                        src: src,
                        w: image.width || $em2.width,
                        h: image.height || $em2.height,
                        title: title
                    })
                })
                var gallery = new PhotoSwipe(pswpElement, PhotoSwipeUI_Default, items, {
                    index: parseInt(i)
                });
                gallery.init()
            }
        })
    }
    viewer_init()
</script> 
<!-- MathJax -->

<!-- Katex -->

<!-- busuanzi  -->
 
<script src="/js/busuanzi-2.3.pure.min.js"></script>
 
<!-- ClickLove -->

<!-- ClickBoom1 -->

<!-- ClickBoom2 -->

<!-- CodeCopy -->
 
<link rel="stylesheet" href="/css/clipboard.css">
 <script src="https://cdn.staticfile.org/clipboard.js/2.0.10/clipboard.min.js"></script>
<script>
  function wait(callback, seconds) {
    var timelag = null;
    timelag = window.setTimeout(callback, seconds);
  }
  !function (e, t, a) {
    var initCopyCode = function(){
      var copyHtml = '';
      copyHtml += '<button class="btn-copy" data-clipboard-snippet="">';
      copyHtml += '<i class="ri-file-copy-2-line"></i><span>COPY</span>';
      copyHtml += '</button>';
      $(".highlight .code pre").before(copyHtml);
      $(".article pre code").before(copyHtml);
      var clipboard = new ClipboardJS('.btn-copy', {
        target: function(trigger) {
          return trigger.nextElementSibling;
        }
      });
      clipboard.on('success', function(e) {
        let $btn = $(e.trigger);
        $btn.addClass('copied');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-checkbox-circle-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPIED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-checkbox-circle-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
      clipboard.on('error', function(e) {
        e.clearSelection();
        let $btn = $(e.trigger);
        $btn.addClass('copy-failed');
        let $icon = $($btn.find('i'));
        $icon.removeClass('ri-file-copy-2-line');
        $icon.addClass('ri-time-line');
        let $span = $($btn.find('span'));
        $span[0].innerText = 'COPY FAILED';
        
        wait(function () { // 等待两秒钟后恢复
          $icon.removeClass('ri-time-line');
          $icon.addClass('ri-file-copy-2-line');
          $span[0].innerText = 'COPY';
        }, 2000);
      });
    }
    initCopyCode();
  }(window, document);
</script>
 
<!-- CanvasBackground -->

<script>
  if (window.mermaid) {
    mermaid.initialize({ theme: "forest" });
  }
</script>


    
    

  </div>
</body>

</html>